[Killed] EqualityOperator
errors/Custom.ts:13:25
 
 const extract = (dict: IDictionary, name: string): string => {
   const value = dict.lookup(name)
-  if (value === null || value.type !== ValueType.string) {
+  if (value === null || value.type === ValueType.string) {
     throw new TypeCheck()
   }
killedBy: errors/Custom on a valid dictionary gives access to the dictionary
statusReason: TypeCheck: Operand is of the wrong type

[Killed] ConditionalExpression
errors/Custom.ts:13:25
 
 const extract = (dict: IDictionary, name: string): string => {
   const value = dict.lookup(name)
-  if (value === null || value.type !== ValueType.string) {
+  if (value === null || false) {
     throw new TypeCheck()
   }
killedBy: errors/Custom detect invalid property (name)
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: TypeCheck

Received function did not throw

[Killed] BlockStatement
errors/Custom.ts:31:20
     return this._dictionary
   }
 
-  release (): void {
-    ShareableObject.release({
-      type: ValueType.dict,
-      data: this._dictionary
-    })
-  }
+  release (): void {}
 
   // region IWritableDictionary
killedBy: errors/Custom on a valid dictionary releases the dictionary
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
errors/Custom.ts:48:50
     return this._dictionary.lookup(name)
   }
 
-  def (name: string, value: InternalValue): void {
-    this._dictionary.def(name, value)
-  }
+  def (name: string, value: InternalValue): void {}
 
   // endregion IWritableDictionary
killedBy: errors/Custom on a valid dictionary IWritableDictionary enables the modification of the dictionary
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"data": "test", "type": "stringtype"}
Received: null
