[Killed] StringLiteral
errors/InternalError.ts:30:32
 
   release (): void {}
 
-  private _callstack: string = ''
+  private _callstack: string = "Stryker was here!"
 
   get callstack (): string {
killedBy: errors/InternalError callstack maps default stack
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "InternalError.spec.ts"
Received string:    "Stryker was here!"

[Killed] ConditionalExpression
errors/InternalError.ts:33:9
   private _callstack: string = ''
 
   get callstack (): string {
-    if (this._callstack !== '') {
+    if (false) {
       return this._callstack
     }
killedBy: errors/InternalError callstack offers a setter
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 14

- abc
+     at Object.<anonymous> (C:\Users\I850991\git\arnaud\progbots\engine\.stryker-tmp\sandbox4481113\errors\InternalError.spec.ts:95:21)
+     at Promise.then.completed (C:\Users\I850991\git\arnaud\progbots\engine\node_modules\jest-circus\build\utils.js:293:28)

[Killed] BlockStatement
errors/InternalError.ts:33:33
   private _callstack: string = ''
 
   get callstack (): string {
-    if (this._callstack !== '') {
-      return this._callstack
-    }
+    if (this._callstack !== '') {}
     return this.stack?.split(CR).slice(1).join(CR) ?? NO_STACK
   }
killedBy: errors/InternalError callstack offers a setter
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 14

- abc
+     at Object.<anonymous> (C:\Users\I850991\git\arnaud\progbots\engine\.stryker-tmp\sandbox4481113\errors\InternalError.spec.ts:95:21)
+     at Promise.then.completed (C:\Users\I850991\git\arnaud\progbots\engine\node_modules\jest-circus\build\utils.js:293:28)

[Killed] MethodExpression
errors/InternalError.ts:36:12
     if (this._callstack !== '') {
       return this._callstack
     }
-    return this.stack?.split(CR).slice(1).join(CR) ?? NO_STACK
+    return this.stack?.split(CR).join(CR) ?? NO_STACK
   }
 
killedBy: errors/InternalError callstack maps default stack
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "InternalError:"
Received string:        "InternalError: test

[Killed] BlockStatement
errors/InternalError.ts:39:33
     return this.stack?.split(CR).slice(1).join(CR) ?? NO_STACK
   }
 
-  set callstack (value: string) {
-    if (this._callstack === '') {
-      this._callstack = value
-    }
-  }
+  set callstack (value: string) {}
 
   // region IDictionary
killedBy: errors/InternalError callstack offers a setter
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 14

- abc
+     at Object.<anonymous> (C:\Users\I850991\git\arnaud\progbots\engine\.stryker-tmp\sandbox4481113\errors\InternalError.spec.ts:95:21)
+     at Promise.then.completed (C:\Users\I850991\git\arnaud\progbots\engine\node_modules\jest-circus\build\utils.js:293:28)

[Killed] ConditionalExpression
errors/InternalError.ts:40:9
   }
 
   set callstack (value: string) {
-    if (this._callstack === '') {
+    if (true) {
       this._callstack = value
     }
killedBy: errors/InternalError callstack can only be set once
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "abc"
Received: "def"

[Killed] ConditionalExpression
errors/InternalError.ts:40:9
   }
 
   set callstack (value: string) {
-    if (this._callstack === '') {
+    if (false) {
       this._callstack = value
     }
killedBy: errors/InternalError callstack offers a setter
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 14

- abc
+     at Object.<anonymous> (C:\Users\I850991\git\arnaud\progbots\engine\.stryker-tmp\sandbox4481113\errors\InternalError.spec.ts:95:21)
+     at Promise.then.completed (C:\Users\I850991\git\arnaud\progbots\engine\node_modules\jest-circus\build\utils.js:293:28)

[Killed] BlockStatement
errors/InternalError.ts:53:33
 
   lookup (name: string): Value | null {
     let data: string | undefined
-    if (name === TYPE_PROPERTY) {
-      data = 'system'
-    } else if (name === NAME_PROPERTY) {
+    if (name === TYPE_PROPERTY) {} else if (name === NAME_PROPERTY) {
       data = this.name
     } else if (name === MESSAGE_PROPERTY) {
killedBy: errors/InternalError behaves like a Dictionary exposes type
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"data": "system", "type": "stringtype"}
Received: null

[Killed] ConditionalExpression
errors/InternalError.ts:53:9
 
   lookup (name: string): Value | null {
     let data: string | undefined
-    if (name === TYPE_PROPERTY) {
+    if (true) {
       data = 'system'
     } else if (name === NAME_PROPERTY) {
killedBy: errors/InternalError behaves like a Dictionary exposes name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "data": "InternalError",
+   "data": "system",

[Killed] ConditionalExpression
errors/InternalError.ts:55:16
     let data: string | undefined
     if (name === TYPE_PROPERTY) {
       data = 'system'
-    } else if (name === NAME_PROPERTY) {
+    } else if (false) {
       data = this.name
     } else if (name === MESSAGE_PROPERTY) {
killedBy: errors/InternalError behaves like a Dictionary exposes name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"data": "InternalError", "type": "stringtype"}
Received: null

[Killed] BlockStatement
errors/InternalError.ts:55:40
     let data: string | undefined
     if (name === TYPE_PROPERTY) {
       data = 'system'
-    } else if (name === NAME_PROPERTY) {
-      data = this.name
-    } else if (name === MESSAGE_PROPERTY) {
+    } else if (name === NAME_PROPERTY) {} else if (name === MESSAGE_PROPERTY) {
       data = this.message
     } else if (name === STACK_PROPERTY) {
killedBy: errors/InternalError behaves like a Dictionary exposes name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"data": "InternalError", "type": "stringtype"}
Received: null

[Killed] ConditionalExpression
errors/InternalError.ts:57:16
       data = 'system'
     } else if (name === NAME_PROPERTY) {
       data = this.name
-    } else if (name === MESSAGE_PROPERTY) {
+    } else if (false) {
       data = this.message
     } else if (name === STACK_PROPERTY) {
killedBy: errors/InternalError behaves like a Dictionary exposes message
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"data": "test", "type": "stringtype"}
Received: null

[Killed] ConditionalExpression
errors/InternalError.ts:57:16
       data = 'system'
     } else if (name === NAME_PROPERTY) {
       data = this.name
-    } else if (name === MESSAGE_PROPERTY) {
+    } else if (true) {
       data = this.message
     } else if (name === STACK_PROPERTY) {
killedBy: errors/InternalError behaves like a Dictionary exposes stack
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "InternalError.spec.ts"
Received string:    "test"

[Killed] ConditionalExpression
errors/InternalError.ts:59:16
       data = this.name
     } else if (name === MESSAGE_PROPERTY) {
       data = this.message
-    } else if (name === STACK_PROPERTY) {
+    } else if (false) {
       data = this.callstack
     }
killedBy: errors/InternalError behaves like a Dictionary exposes stack
statusReason: Error: Unexpected null stack

[Killed] EqualityOperator
errors/InternalError.ts:59:16
       data = this.name
     } else if (name === MESSAGE_PROPERTY) {
       data = this.message
-    } else if (name === STACK_PROPERTY) {
+    } else if (name !== STACK_PROPERTY) {
       data = this.callstack
     }
killedBy: errors/InternalError behaves like a Dictionary exposes stack
statusReason: Error: Unexpected null stack

[Killed] BlockStatement
errors/InternalError.ts:62:29
     } else if (name === STACK_PROPERTY) {
       data = this.callstack
     }
-    if (data !== undefined) {
-      return {
-        type: ValueType.string,
-        data
-      }
-    }
+    if (data !== undefined) {}
     return null
   }
killedBy: errors/InternalError behaves like a Dictionary exposes type
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"data": "system", "type": "stringtype"}
Received: null
