[Killed] BlockStatement
objects/Array.ts:8:51
 const EMPTY_ARRAY = 'Empty array'
 
 export class ArrayLike extends BaseArray {
-  protected pushImpl (value: InternalValue): void {
-    this._values.push(value)
-  }
+  protected pushImpl (value: InternalValue): void {}
 
   protected popImpl (): InternalValue {
killedBy: objects/Array offers an array reference
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "data": 1,

[Killed] BlockStatement
objects/Array.ts:27:40
     return value
   }
 
-  unshift (value: InternalValue): void {
-    this.addValueRef(value)
-    this._values.unshift(value)
-  }
+  unshift (value: InternalValue): void {}
 
   set (index: number, value: InternalValue): void {
killedBy: objects/Array implements unshift
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

@@ -1,11 +1,7 @@
  Array [
    Object {

[Killed] BlockStatement
objects/Array.ts:32:51
     this._values.unshift(value)
   }
 
-  set (index: number, value: InternalValue): void {
-    if (index < 0) {
-      throw new RangeCheck()
-    }
-    const oldValue = this._values[index]
-    this.addValueRef(value)
-    if (oldValue !== undefined) {
-      this.releaseValue(oldValue)
-    }
-    this._values[index] = value
-  }
+  set (index: number, value: InternalValue): void {}
 
   some (predicate: (value: InternalValue, index: number) => boolean): boolean {
killedBy: objects/Array set allows setting a new item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

@@ -5,10 +5,6 @@
    },
    Object {

[Killed] BlockStatement
objects/Array.ts:33:20
   }
 
   set (index: number, value: InternalValue): void {
-    if (index < 0) {
-      throw new RangeCheck()
-    }
+    if (index < 0) {}
     const oldValue = this._values[index]
     this.addValueRef(value)
killedBy: objects/Array set fails with RangeCheck on invalid index
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: RangeCheck

Received function did not throw

[Killed] ConditionalExpression
objects/Array.ts:33:9
   }
 
   set (index: number, value: InternalValue): void {
-    if (index < 0) {
+    if (true) {
       throw new RangeCheck()
     }
killedBy: objects/Array set allows setting a new item
statusReason: RangeCheck: Operand is too big or too small

[Killed] BlockStatement
objects/Array.ts:38:33
     }
     const oldValue = this._values[index]
     this.addValueRef(value)
-    if (oldValue !== undefined) {
-      this.releaseValue(oldValue)
-    }
+    if (oldValue !== undefined) {}
     this._values[index] = value
   }
killedBy: objects/Array set allows overriding an item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 22
Received: 31

[Killed] ConditionalExpression
objects/Array.ts:38:9
     }
     const oldValue = this._values[index]
     this.addValueRef(value)
-    if (oldValue !== undefined) {
+    if (true) {
       this.releaseValue(oldValue)
     }
killedBy: objects/Array set allows setting a new item
statusReason: TypeError: Cannot read properties of undefined (reading 'untracked')

[Killed] MethodExpression
objects/Array.ts:45:12
   }
 
   some (predicate: (value: InternalValue, index: number) => boolean): boolean {
-    return this._values.some(predicate)
+    return this._values.every(predicate)
   }
 }
killedBy: objects/Array offers some
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false
