[Killed] EqualityOperator
objects/BaseArray.ts:31:9
 
   at (index: number): Value {
     const value = this._values[index]
-    if (value === undefined) {
+    if (value !== undefined) {
       throw new RangeCheck()
     }
killedBy: objects/BaseArray IArray exposes at
statusReason: RangeCheck: Operand is too big or too small

[Killed] ConditionalExpression
objects/BaseArray.ts:31:9
 
   at (index: number): Value {
     const value = this._values[index]
-    if (value === undefined) {
+    if (true) {
       throw new RangeCheck()
     }
killedBy: objects/BaseArray IArray exposes at
statusReason: RangeCheck: Operand is too big or too small

[Killed] BlockStatement
objects/BaseArray.ts:40:54
 
   // endregion IArray
 
-  protected addValueRef (value: InternalValue): void {
-    this._memoryTracker.addValueRef(value)
-    this._memoryTracker.increment(BaseArray.VALUE_ADDITIONAL_SIZE)
-  }
+  protected addValueRef (value: InternalValue): void {}
 
   protected abstract pushImpl (value: InternalValue): void
killedBy: objects/BaseArray tracks memory used
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
objects/BaseArray.ts:47:37
 
   protected abstract pushImpl (value: InternalValue): void
 
-  push (value: InternalValue): void {
-    this.addValueRef(value)
-    this.pushImpl(value)
-  }
+  push (value: InternalValue): void {}
 
   protected releaseValue (value: InternalValue): void {
killedBy: objects/BaseArray tracks memory used
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
objects/BaseArray.ts:52:55
     this.pushImpl(value)
   }
 
-  protected releaseValue (value: InternalValue): void {
-    this._memoryTracker.releaseValue(value)
-    this._memoryTracker.decrement(BaseArray.VALUE_ADDITIONAL_SIZE)
-  }
+  protected releaseValue (value: InternalValue): void {}
 
   protected abstract popImpl (): InternalValue
killedBy: objects/BaseArray removing items releases memory when removing items
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 39
Received:   39

[Killed] BlockStatement
objects/BaseArray.ts:59:16
 
   protected abstract popImpl (): InternalValue
 
-  pop (): void {
-    if (this._values.length === 0) {
-      throw new InternalError(EMPTY_ARRAY)
-    }
-    const value = this.popImpl()
-    this.releaseValue(value)
-  }
+  pop (): void {}
 
   get ref (): readonly InternalValue[] {
killedBy: objects/BaseArray removing items releases memory when removing items
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 39
Received:   39

[Killed] ConditionalExpression
objects/BaseArray.ts:60:9
   protected abstract popImpl (): InternalValue
 
   pop (): void {
-    if (this._values.length === 0) {
+    if (false) {
       throw new InternalError(EMPTY_ARRAY)
     }
killedBy: objects/BaseArray removing items fails after all items were removed
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: InternalError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'untracked')"

      190 |       stryCov_9fa48("860");

[Killed] BlockStatement
objects/BaseArray.ts:60:36
   protected abstract popImpl (): InternalValue
 
   pop (): void {
-    if (this._values.length === 0) {
-      throw new InternalError(EMPTY_ARRAY)
-    }
+    if (this._values.length === 0) {}
     const value = this.popImpl()
     this.releaseValue(value)
killedBy: objects/BaseArray removing items fails after all items were removed
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: InternalError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'untracked')"

      190 |       stryCov_9fa48("860");

[Killed] BlockStatement
objects/BaseArray.ts:71:29
     return this._values
   }
 
-  protected _clear (): void {
-    for (const value of this._values) {
-      this._memoryTracker.releaseValue(value)
-    }
-    this._memoryTracker.decrement(this._values.length * BaseArray.VALUE_ADDITIONAL_SIZE)
-    this._values.length = 0
-  }
+  protected _clear (): void {}
 
   protected _dispose (): void {
killedBy: objects/BaseArray removing items fails after all items were removed
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: InternalError

Received function did not throw

[Killed] BlockStatement
objects/BaseArray.ts:72:39
   }
 
   protected _clear (): void {
-    for (const value of this._values) {
-      this._memoryTracker.releaseValue(value)
-    }
+    for (const value of this._values) {}
     this._memoryTracker.decrement(this._values.length * BaseArray.VALUE_ADDITIONAL_SIZE)
     this._values.length = 0
killedBy: objects/BaseArray releases memory once disposed
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ArithmeticOperator
objects/BaseArray.ts:75:35
     for (const value of this._values) {
       this._memoryTracker.releaseValue(value)
     }
-    this._memoryTracker.decrement(this._values.length * BaseArray.VALUE_ADDITIONAL_SIZE)
+    this._memoryTracker.decrement(this._values.length / BaseArray.VALUE_ADDITIONAL_SIZE)
     this._values.length = 0
   }
killedBy: objects/BaseArray releases memory once disposed
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 11.25

[Killed] BlockStatement
objects/BaseArray.ts:79:31
     this._values.length = 0
   }
 
-  protected _dispose (): void {
-    this._clear()
-    this._memoryTracker.decrement(BaseArray.INITIAL_SIZE)
-  }
+  protected _dispose (): void {}
 }
 
killedBy: objects/BaseArray releases memory once disposed
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1
