[Killed] BlockStatement
objects/dictionaries/Dictionary.ts:28:30
 
   lookup (name: string): Value | null {
     const value = this._values[name]
-    if (value === undefined) {
-      return null
-    }
+    if (value === undefined) {}
     return value
   }
killedBy: objects/dictionaries/Dictionary returns null on an unknown name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: null
Received: undefined

[Killed] ConditionalExpression
objects/dictionaries/Dictionary.ts:28:9
 
   lookup (name: string): Value | null {
     const value = this._values[name]
-    if (value === undefined) {
+    if (false) {
       return null
     }
killedBy: objects/dictionaries/Dictionary returns null on an unknown name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: null
Received: undefined

[Killed] BlockStatement
objects/dictionaries/Dictionary.ts:38:50
 
   // region IWritableDictionary
 
-  def (name: string, value: InternalValue): void {
-    // TODO: how do we delete a value (can we ?)
-    const old = this._values[name]
-    if (old !== undefined) {
-      this._memoryTracker.releaseValue(old)
-    } else {
-      this._memoryTracker.addValueRef({
-        type: ValueType.string,
-        data: name
-      })
-      this._memoryTracker.increment(Dictionary.VALUE_ADDITIONAL_SIZE)
-    }
-    this._memoryTracker.addValueRef(value)
-    this._values[name] = value
-  }
+  def (name: string, value: InternalValue): void {}
 
   // endregion IWritableDictionary
killedBy: objects/dictionaries/Dictionary tracks memory used
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] BlockStatement
objects/dictionaries/Dictionary.ts:41:28
   def (name: string, value: InternalValue): void {
     // TODO: how do we delete a value (can we ?)
     const old = this._values[name]
-    if (old !== undefined) {
-      this._memoryTracker.releaseValue(old)
-    } else {
+    if (old !== undefined) {} else {
       this._memoryTracker.addValueRef({
         type: ValueType.string,
killedBy: objects/dictionaries/Dictionary allows the override of a named value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 97
Received: 102

[Killed] ConditionalExpression
objects/dictionaries/Dictionary.ts:41:9
   def (name: string, value: InternalValue): void {
     // TODO: how do we delete a value (can we ?)
     const old = this._values[name]
-    if (old !== undefined) {
+    if (false) {
       this._memoryTracker.releaseValue(old)
     } else {
killedBy: objects/dictionaries/Dictionary allows the override of a named value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 97
Received: 126

[Killed] BlockStatement
objects/dictionaries/Dictionary.ts:43:12
     const old = this._values[name]
     if (old !== undefined) {
       this._memoryTracker.releaseValue(old)
-    } else {
-      this._memoryTracker.addValueRef({
-        type: ValueType.string,
-        data: name
-      })
-      this._memoryTracker.increment(Dictionary.VALUE_ADDITIONAL_SIZE)
-    }
+    } else {}
     this._memoryTracker.addValueRef(value)
     this._values[name] = value
killedBy: objects/dictionaries/Dictionary releases memory once disposed
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: -78

[Killed] BlockStatement
objects/dictionaries/Dictionary.ts:56:31
 
   // endregion IWritableDictionary
 
-  protected _dispose (): void {
-    this.names.forEach(name => {
-      const value = this._values[name]
-      this._memoryTracker.releaseValue(value)
-      this._memoryTracker.releaseValue({
-        type: ValueType.string,
-        data: name
-      })
-      this._memoryTracker.decrement(Dictionary.VALUE_ADDITIONAL_SIZE)
-    })
-    this._memoryTracker.decrement(Dictionary.INITIAL_SIZE)
-  }
+  protected _dispose (): void {}
 }
 
killedBy: objects/dictionaries/Dictionary releases memory once disposed
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 97

[Killed] BlockStatement
objects/dictionaries/Dictionary.ts:57:32
   // endregion IWritableDictionary
 
   protected _dispose (): void {
-    this.names.forEach(name => {
-      const value = this._values[name]
-      this._memoryTracker.releaseValue(value)
-      this._memoryTracker.releaseValue({
-        type: ValueType.string,
-        data: name
-      })
-      this._memoryTracker.decrement(Dictionary.VALUE_ADDITIONAL_SIZE)
-    })
+    this.names.forEach(name => {})
     this._memoryTracker.decrement(Dictionary.INITIAL_SIZE)
   }
killedBy: objects/dictionaries/Dictionary releases memory once disposed
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 93
