[Killed] EqualityOperator
objects/dictionaries/System.ts:25:9
 
   lookup (name: string): Value | null {
     const operator = operators[name]
-    if (operator === undefined) {
+    if (operator !== undefined) {
       return null
     }
killedBy: objects/dictionaries/System returns null on unknown name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: null
Received: {"data": undefined, "type": "operatortype"}

[Killed] ConditionalExpression
objects/dictionaries/System.ts:25:9
 
   lookup (name: string): Value | null {
     const operator = operators[name]
-    if (operator === undefined) {
+    if (false) {
       return null
     }
killedBy: objects/dictionaries/System returns null on unknown name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: null
Received: {"data": undefined, "type": "operatortype"}
