[Killed] BlockStatement
objects/ShareableObject.ts:7:72
 const TOOMANY_RELEASE = 'Superfluous release'
 
 export abstract class ShareableObject {
-  public static addRef (values: InternalValue | InternalValue[]): void {
-    if (Array.isArray(values)) {
-      values.forEach(value => {
-        if (value.data instanceof ShareableObject) {
-          value.data.addRef()
-        }
-      })
-    } else if (values.data instanceof ShareableObject) {
-      values.data.addRef()
-    }
-  }
+  public static addRef (values: InternalValue | InternalValue[]): void {}
 
   public static release (values: InternalValue | InternalValue[]): void {
killedBy: objects/ShareableObject offers a generic addRef helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:8:32
 
 export abstract class ShareableObject {
   public static addRef (values: InternalValue | InternalValue[]): void {
-    if (Array.isArray(values)) {
-      values.forEach(value => {
-        if (value.data instanceof ShareableObject) {
-          value.data.addRef()
-        }
-      })
-    } else if (values.data instanceof ShareableObject) {
+    if (Array.isArray(values)) {} else if (values.data instanceof ShareableObject) {
       values.data.addRef()
     }
killedBy: objects/ShareableObject offers a mass and generic addRef helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:9:31
 export abstract class ShareableObject {
   public static addRef (values: InternalValue | InternalValue[]): void {
     if (Array.isArray(values)) {
-      values.forEach(value => {
-        if (value.data instanceof ShareableObject) {
-          value.data.addRef()
-        }
-      })
+      values.forEach(value => {})
     } else if (values.data instanceof ShareableObject) {
       values.data.addRef()
killedBy: objects/ShareableObject offers a mass and generic addRef helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:10:52
   public static addRef (values: InternalValue | InternalValue[]): void {
     if (Array.isArray(values)) {
       values.forEach(value => {
-        if (value.data instanceof ShareableObject) {
-          value.data.addRef()
-        }
+        if (value.data instanceof ShareableObject) {}
       })
     } else if (values.data instanceof ShareableObject) {
killedBy: objects/ShareableObject offers a mass and generic addRef helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:14:56
           value.data.addRef()
         }
       })
-    } else if (values.data instanceof ShareableObject) {
-      values.data.addRef()
-    }
+    } else if (values.data instanceof ShareableObject) {}
   }
 
killedBy: objects/ShareableObject offers a generic addRef helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:19:73
     }
   }
 
-  public static release (values: InternalValue | InternalValue[]): void {
-    if (Array.isArray(values)) {
-      values.forEach(value => {
-        if (value.data instanceof ShareableObject) {
-          value.data.release()
-        }
-      })
-    } else if (values.data instanceof ShareableObject) {
-      values.data.release()
-    }
-  }
+  public static release (values: InternalValue | InternalValue[]): void {}
 
   private _refCount: number
killedBy: objects/ShareableObject offers a generic release helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:20:32
   }
 
   public static release (values: InternalValue | InternalValue[]): void {
-    if (Array.isArray(values)) {
-      values.forEach(value => {
-        if (value.data instanceof ShareableObject) {
-          value.data.release()
-        }
-      })
-    } else if (values.data instanceof ShareableObject) {
+    if (Array.isArray(values)) {} else if (values.data instanceof ShareableObject) {
       values.data.release()
     }
killedBy: objects/ShareableObject offers a mass and generic release helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:21:31
 
   public static release (values: InternalValue | InternalValue[]): void {
     if (Array.isArray(values)) {
-      values.forEach(value => {
-        if (value.data instanceof ShareableObject) {
-          value.data.release()
-        }
-      })
+      values.forEach(value => {})
     } else if (values.data instanceof ShareableObject) {
       values.data.release()
killedBy: objects/ShareableObject offers a mass and generic release helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:22:52
   public static release (values: InternalValue | InternalValue[]): void {
     if (Array.isArray(values)) {
       values.forEach(value => {
-        if (value.data instanceof ShareableObject) {
-          value.data.release()
-        }
+        if (value.data instanceof ShareableObject) {}
       })
     } else if (values.data instanceof ShareableObject) {
killedBy: objects/ShareableObject offers a mass and generic release helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:26:56
           value.data.release()
         }
       })
-    } else if (values.data instanceof ShareableObject) {
-      values.data.release()
-    }
+    } else if (values.data instanceof ShareableObject) {}
   }
 
killedBy: objects/ShareableObject offers a generic release helper
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
objects/ShareableObject.ts:41:19
     return this._refCount
   }
 
-  addRef (): void {
-    ++this._refCount
-  }
+  addRef (): void {}
 
   release (): void {
killedBy: objects/ShareableObject calls _dispose on last reference count
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] UpdateOperator
objects/ShareableObject.ts:42:5
   }
 
   addRef (): void {
-    ++this._refCount
+    --this._refCount
   }
 
killedBy: objects/ShareableObject calls _dispose on last reference count
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] BlockStatement
objects/ShareableObject.ts:45:20
     ++this._refCount
   }
 
-  release (): void {
-    const refCount = --this._refCount
-    if (refCount === 0) {
-      this._dispose()
-    } else
-    // Stryker disable next-line EqualityOperator
-    if (refCount < 0) {
-      throw new Internal(TOOMANY_RELEASE)
-    }
-  }
+  release (): void {}
 
   protected abstract _dispose (): void
killedBy: objects/ShareableObject calls _dispose on last reference count
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] UpdateOperator
objects/ShareableObject.ts:46:22
   }
 
   release (): void {
-    const refCount = --this._refCount
+    const refCount = ++this._refCount
     if (refCount === 0) {
       this._dispose()
killedBy: objects/ShareableObject calls _dispose on last reference count
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 3

[Killed] ConditionalExpression
objects/ShareableObject.ts:47:9
 
   release (): void {
     const refCount = --this._refCount
-    if (refCount === 0) {
+    if (true) {
       this._dispose()
     } else
killedBy: objects/ShareableObject calls _dispose on last reference count
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] EqualityOperator
objects/ShareableObject.ts:47:9
 
   release (): void {
     const refCount = --this._refCount
-    if (refCount === 0) {
+    if (refCount !== 0) {
       this._dispose()
     } else
killedBy: objects/ShareableObject calls _dispose on last reference count
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
objects/ShareableObject.ts:51:9
       this._dispose()
     } else
     // Stryker disable next-line EqualityOperator
-    if (refCount < 0) {
+    if (true) {
       throw new Internal(TOOMANY_RELEASE)
     }
killedBy: objects/ShareableObject calls _dispose on last reference count
statusReason: Internal: Superfluous release

[Killed] BlockStatement
objects/ShareableObject.ts:51:23
       this._dispose()
     } else
     // Stryker disable next-line EqualityOperator
-    if (refCount < 0) {
-      throw new Internal(TOOMANY_RELEASE)
-    }
+    if (refCount < 0) {}
   }
 
killedBy: objects/ShareableObject detects invalid use of release
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: Internal

Received function did not throw
