[Killed] BlockStatement
operators/array/close-array.ts:5:56
 import { ValueType } from '../../index'
 import { closeToMark } from '../open-close-helper'
 
-export function * closeArray (state: State): Generator {
-  closeToMark(state, ValueType.array)
-}
+export function * closeArray (state: State): Generator {}
 
 Object.defineProperty(closeArray, 'name', {
killedBy: operators/array/close-array (]) creates an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 5
