[Killed] BlockStatement
operators/array/open-array.ts:4:55
 import { State } from '../../state/index'
 import { openWithMark } from '../open-close-helper'
 
-export function * openArray (state: State): Generator {
-  openWithMark(state)
-}
+export function * openArray (state: State): Generator {}
 
 Object.defineProperty(openArray, 'name', {
killedBy: operators/array/close-array (]) creates an array
statusReason: Error: expect(received).toBeUndefined()

Received: [UnmatchedMark: Unmatched mark in the operand stack]
