[Killed] BlockStatement
operators/constant/false.ts:4:60
 import { State } from '../../state/index'
 import { ValueType } from '../../index'
 
-export function * falseOp ({ operands }: State): Generator {
-  operands.push({
-    type: ValueType.boolean,
-    data: false
-  })
-}
+export function * falseOp ({ operands }: State): Generator {}
 
 Object.defineProperty(falseOp, 'name', {
killedBy: operators/constant/false adds false to the stack
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] BooleanLiteral
operators/constant/false.ts:7:11
 export function * falseOp ({ operands }: State): Generator {
   operands.push({
     type: ValueType.boolean,
-    data: false
+    data: true
   })
 }
killedBy: operators/constant/false adds false to the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,
