[Killed] BlockStatement
operators/constant/true.ts:4:59
 import { State } from '../../state/index'
 import { ValueType } from '../../index'
 
-export function * trueOp ({ operands }: State): Generator {
-  operands.push({
-    type: ValueType.boolean,
-    data: true
-  })
-}
+export function * trueOp ({ operands }: State): Generator {}
 
 Object.defineProperty(trueOp, 'name', {
killedBy: operators/constant/true adds true to the stack
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] BooleanLiteral
operators/constant/true.ts:7:11
 export function * trueOp ({ operands }: State): Generator {
   operands.push({
     type: ValueType.boolean,
-    data: true
+    data: false
   })
 }
killedBy: operators/constant/true adds true to the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": true,
