[Killed] BlockStatement
operators/errors.ts:20:57
 
   const ErrorConstructor = ErrorClass as (new () => InternalError)
 
-  const operator = function * (state: State): Generator {
-    throw new ErrorConstructor()
-  }
+  const operator = function * (state: State): Generator {}
 
   Object.defineProperty(operator, 'name', {
killedBy: operators/errors it throws RangeCheck
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined
