[Killed] BlockStatement
operators/flow/close-block.ts:5:56
 import { ValueType } from '../../index'
 import { closeToMark } from '../open-close-helper'
 
-export function * closeBlock (state: State): Generator {
-  closeToMark(state, ValueType.block)
-  state.allowCall()
-}
+export function * closeBlock (state: State): Generator {}
 
 Object.defineProperty(closeBlock, 'name', {
killedBy: operators/flow/close-block (}) creates a block
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
    Object {
-     "data": "add",
