[Killed] BlockStatement
operators/flow/finally.ts:5:55
 import { ValueType } from '../../index'
 import { ShareableObject } from '../../objects/ShareableObject'
 
-export function * finallyOp (state: State): Generator {
-  const { operands } = state
-  const [blockFinally, block] = operands.check(ValueType.block, ValueType.block)
-  ShareableObject.addRef([block, blockFinally])
-  let released = false
-  const release = (): void => {
-    if (!released) {
-      ShareableObject.release([block, blockFinally])
-      released = true
-    }
-  }
-  try {
-    operands.splice(2)
-    yield * state.evalBlockOrProc(block)
-  } finally {
-    try {
-      yield * state.evalBlockOrProc(blockFinally)
-    } finally {
-      release()
-    }
-    release()
-  }
-}
+export function * finallyOp (state: State): Generator {}
 
 Object.defineProperty(finallyOp, 'name', {
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    2

[Killed] BooleanLiteral
operators/flow/finally.ts:9:18
   const { operands } = state
   const [blockFinally, block] = operands.check(ValueType.block, ValueType.block)
   ShareableObject.addRef([block, blockFinally])
-  let released = false
+  let released = true
   const release = (): void => {
     if (!released) {
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 69

[Killed] BlockStatement
operators/flow/finally.ts:10:31
   const [blockFinally, block] = operands.check(ValueType.block, ValueType.block)
   ShareableObject.addRef([block, blockFinally])
   let released = false
-  const release = (): void => {
-    if (!released) {
-      ShareableObject.release([block, blockFinally])
-      released = true
-    }
-  }
+  const release = (): void => {}
   try {
     operands.splice(2)
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 69

[Killed] ConditionalExpression
operators/flow/finally.ts:11:9
   ShareableObject.addRef([block, blockFinally])
   let released = false
   const release = (): void => {
-    if (!released) {
+    if (true) {
       ShareableObject.release([block, blockFinally])
       released = true
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toBeUndefined()

Received: [Internal: Superfluous release]

[Killed] BlockStatement
operators/flow/finally.ts:11:20
   ShareableObject.addRef([block, blockFinally])
   let released = false
   const release = (): void => {
-    if (!released) {
-      ShareableObject.release([block, blockFinally])
-      released = true
-    }
+    if (!released) {}
   }
   try {
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 69

[Killed] ArrayDeclaration
operators/flow/finally.ts:12:31
   let released = false
   const release = (): void => {
     if (!released) {
-      ShareableObject.release([block, blockFinally])
+      ShareableObject.release([])
       released = true
     }
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 69

[Killed] BooleanLiteral
operators/flow/finally.ts:13:18
   const release = (): void => {
     if (!released) {
       ShareableObject.release([block, blockFinally])
-      released = true
+      released = false
     }
   }
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toBeUndefined()

Received: [Internal: Superfluous release]

[Killed] BlockStatement
operators/flow/finally.ts:16:7
       released = true
     }
   }
-  try {
-    operands.splice(2)
-    yield * state.evalBlockOrProc(block)
-  } finally {
+  try {} finally {
     try {
       yield * state.evalBlockOrProc(blockFinally)
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 33

@@ -2,13 +2,45 @@
    Object {
      "data": 3,

[Killed] BlockStatement
operators/flow/finally.ts:19:13
   try {
     operands.splice(2)
     yield * state.evalBlockOrProc(block)
-  } finally {
-    try {
-      yield * state.evalBlockOrProc(blockFinally)
-    } finally {
-      release()
-    }
-    release()
-  }
+  } finally {}
 }
 
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    2

[Killed] BlockStatement
operators/flow/finally.ts:20:9
     operands.splice(2)
     yield * state.evalBlockOrProc(block)
   } finally {
-    try {
-      yield * state.evalBlockOrProc(blockFinally)
-    } finally {
+    try {} finally {
       release()
     }
killedBy: operators/flow/finally always execute the finally block
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    2

[Killed] BlockStatement
operators/flow/finally.ts:22:15
   } finally {
     try {
       yield * state.evalBlockOrProc(blockFinally)
-    } finally {
-      release()
-    }
+    } finally {}
     release()
   }
killedBy: operators/flow/finally throws the last error
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 121
