[Killed] BlockStatement
operators/flow/loop.ts:6:50
 import { ShareableObject } from '../../objects/ShareableObject'
 import { State } from '../../state/index'
 
-export function * loop (state: State): Generator {
-  const { operands } = state
-  const [block] = operands.check(ValueType.block)
-  ShareableObject.addRef(block)
-  try {
-    operands.pop()
-    // Stryker disable next-line all: will obviously lead to a timeout
-    while (true) {
-      yield * state.evalBlockOrProc(block)
-    }
-  } catch (e) {
-    if (!(e instanceof Break)) {
-      throw e
-    }
-  } finally {
-    ShareableObject.release(block)
-  }
-}
+export function * loop (state: State): Generator {}
 
killedBy: operators/flow/loop loops until break is called
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 5
Received:    1

[Killed] BlockStatement
operators/flow/loop.ts:10:7
   const { operands } = state
   const [block] = operands.check(ValueType.block)
   ShareableObject.addRef(block)
-  try {
-    operands.pop()
-    // Stryker disable next-line all: will obviously lead to a timeout
-    while (true) {
-      yield * state.evalBlockOrProc(block)
-    }
-  } catch (e) {
+  try {} catch (e) {
     if (!(e instanceof Break)) {
       throw e
killedBy: operators/flow/loop loops until break is called
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 5
Received:    1

[Killed] BlockStatement
operators/flow/loop.ts:16:15
     while (true) {
       yield * state.evalBlockOrProc(block)
     }
-  } catch (e) {
-    if (!(e instanceof Break)) {
-      throw e
-    }
-  } finally {
+  } catch (e) {} finally {
     ShareableObject.release(block)
   }
killedBy: operators/flow/loop loops until an error occurs
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BooleanLiteral
operators/flow/loop.ts:17:9
       yield * state.evalBlockOrProc(block)
     }
   } catch (e) {
-    if (!(e instanceof Break)) {
+    if (e instanceof Break) {
       throw e
     }
killedBy: operators/flow/loop loops until break is called
statusReason: Error: expect(received).toBeUndefined()

Received: [InvalidBreak: break has been invoked outside of a loop]

[Killed] ConditionalExpression
operators/flow/loop.ts:17:9
       yield * state.evalBlockOrProc(block)
     }
   } catch (e) {
-    if (!(e instanceof Break)) {
+    if (true) {
       throw e
     }
killedBy: operators/flow/loop loops until break is called
statusReason: Error: expect(received).toBeUndefined()

Received: [InvalidBreak: break has been invoked outside of a loop]
