[Killed] BlockStatement
operators/flow/open-block.ts:4:55
 import { State } from '../../state/index'
 import { openWithMark } from '../open-close-helper'
 
-export function * openBlock (state: State): Generator {
-  openWithMark(state)
-  state.preventCall()
-}
+export function * openBlock (state: State): Generator {}
 
 Object.defineProperty(openBlock, 'name', {
killedBy: operators/flow/open-block ({) adds a mark
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0
