[Killed] BlockStatement
operators/flow/throw.ts:9:60
 import { Custom } from '../../errors/Custom'
 import { InternalError } from '../../errors/InternalError'
 
-export function * throwOp ({ operands }: State): Generator {
-  const [dictValue] = operands.check(ValueType.dict)
-  const dict = dictValue.data as IDictionary
-  if (dict instanceof InternalError) {
-    throw dict
-  }
-  try {
-    checkIWritableDictionary(dict)
-  } catch (e) {
-    throw new TypeCheck()
-  }
-  const customError = new Custom(dict) // may throw TypeCheck
-  ShareableObject.addRef(dictValue)
-  operands.pop()
-  throw customError
-}
+export function * throwOp ({ operands }: State): Generator {}
 
 Object.defineProperty(throwOp, 'name', {
killedBy: operators/flow/throw enables the forward of a known excption
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
operators/flow/throw.ts:12:7
 export function * throwOp ({ operands }: State): Generator {
   const [dictValue] = operands.check(ValueType.dict)
   const dict = dictValue.data as IDictionary
-  if (dict instanceof InternalError) {
+  if (false) {
     throw dict
   }
killedBy: operators/flow/throw enables the forward of a known excption
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "StackUnderflow"
Received: "TypeCheck"

[Killed] BlockStatement
operators/flow/throw.ts:12:38
 export function * throwOp ({ operands }: State): Generator {
   const [dictValue] = operands.check(ValueType.dict)
   const dict = dictValue.data as IDictionary
-  if (dict instanceof InternalError) {
-    throw dict
-  }
+  if (dict instanceof InternalError) {}
   try {
     checkIWritableDictionary(dict)
killedBy: operators/flow/throw enables the forward of a known excption
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "StackUnderflow"
Received: "TypeCheck"
