[Killed] EqualityOperator
operators/generic/get.ts:22:9
     }
     const pos = index.data
     const string = container.data as string
-    if (pos < 0 || pos >= string.length) {
+    if (pos >= 0 || pos >= string.length) {
       throw new RangeCheck()
     }
killedBy: operators/generic/get gets character code of a string
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] EqualityOperator
operators/generic/get.ts:22:9
     }
     const pos = index.data
     const string = container.data as string
-    if (pos < 0 || pos >= string.length) {
+    if (pos <= 0 || pos >= string.length) {
       throw new RangeCheck()
     }
killedBy: operators/generic/get gets character code of a string
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] BlockStatement
operators/generic/get.ts:51:56
   [ValueType.proc]: arrayLikeGetter
 }
 
-export function * get ({ operands }: State): Generator {
-  const [index, container] = operands.check(null, null)
-  const getter = getters[container.type]
-  if (getter === undefined) {
-    throw new TypeCheck()
-  }
-  const value = getter(container, index)
-  operands.splice(2, value)
-}
+export function * get ({ operands }: State): Generator {}
 
killedBy: operators/generic/get gets item of an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": 31,

[Killed] BlockStatement
operators/generic/get.ts:54:29
 export function * get ({ operands }: State): Generator {
   const [index, container] = operands.check(null, null)
   const getter = getters[container.type]
-  if (getter === undefined) {
-    throw new TypeCheck()
-  }
+  if (getter === undefined) {}
   const value = getter(container, index)
   operands.splice(2, value)
killedBy: operators/generic/get fails with TypeCheck if container is not an array, a string, a dict, a block or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"

[Killed] ConditionalExpression
operators/generic/get.ts:54:7
 export function * get ({ operands }: State): Generator {
   const [index, container] = operands.check(null, null)
   const getter = getters[container.type]
-  if (getter === undefined) {
+  if (true) {
     throw new TypeCheck()
   }
killedBy: operators/generic/get gets item of an array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]
