[Killed] ConditionalExpression
operators/generic/in.ts:8:46
 
 function arrayLikeImpl (container: InternalValue, value: InternalValue): boolean {
   const array = container.data as ArrayLike
-  return array.some((item: InternalValue) => item.type === value.type && item.data === value.data)
+  return array.some((item: InternalValue) => false)
 }
 
killedBy: operators/generic/in checks item of an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": true,

[Killed] ConditionalExpression
operators/generic/in.ts:8:46
 
 function arrayLikeImpl (container: InternalValue, value: InternalValue): boolean {
   const array = container.data as ArrayLike
-  return array.some((item: InternalValue) => item.type === value.type && item.data === value.data)
+  return array.some((item: InternalValue) => true)
 }
 
killedBy: operators/generic/in checks item of an array (2)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,

[Killed] BlockStatement
operators/generic/in.ts:28:57
   [ValueType.proc]: arrayLikeImpl
 }
 
-export function * inOp ({ operands }: State): Generator {
-  const [value, container] = operands.check(null, null)
-  const impl = implementations[container.type]
-  if (impl === undefined) {
-    throw new TypeCheck()
-  }
-  operands.splice(2, {
-    type: ValueType.boolean,
-    data: impl(container, value)
-  })
-}
+export function * inOp ({ operands }: State): Generator {}
 
 Object.defineProperty(inOp, 'name', {
killedBy: operators/generic/in checks item of an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": true,

[Killed] BlockStatement
operators/generic/in.ts:31:27
 export function * inOp ({ operands }: State): Generator {
   const [value, container] = operands.check(null, null)
   const impl = implementations[container.type]
-  if (impl === undefined) {
-    throw new TypeCheck()
-  }
+  if (impl === undefined) {}
   operands.splice(2, {
     type: ValueType.boolean,
killedBy: operators/generic/in fails with TypeCheck if container is not an array, a dict, a block or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"

[Killed] ConditionalExpression
operators/generic/in.ts:31:7
 export function * inOp ({ operands }: State): Generator {
   const [value, container] = operands.check(null, null)
   const impl = implementations[container.type]
-  if (impl === undefined) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/generic/in fails with TypeCheck if container is not an array, a dict, a block or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"
