[Killed] BlockStatement
operators/generic/length.ts:29:59
   [ValueType.proc]: arrayLikeLength
 }
 
-export function * length ({ operands }: State): Generator {
-  const [container] = operands.check(null)
-  const sizer = sizers[container.type]
-  if (sizer === undefined) {
-    throw new TypeCheck()
-  }
-  operands.splice(1, {
-    type: ValueType.integer,
-    data: sizer(container)
-  })
-}
+export function * length ({ operands }: State): Generator {}
 
killedBy: operators/generic/length returns the length of an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  2
+ Received  + 11

  Array [
    Object {
-     "data": 0,

[Killed] ConditionalExpression
operators/generic/length.ts:32:7
 export function * length ({ operands }: State): Generator {
   const [container] = operands.check(null)
   const sizer = sizers[container.type]
-  if (sizer === undefined) {
+  if (true) {
     throw new TypeCheck()
   }
killedBy: operators/generic/length returns the length of an array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] BlockStatement
operators/generic/length.ts:32:28
 export function * length ({ operands }: State): Generator {
   const [container] = operands.check(null)
   const sizer = sizers[container.type]
-  if (sizer === undefined) {
-    throw new TypeCheck()
-  }
+  if (sizer === undefined) {}
   operands.splice(1, {
     type: ValueType.integer,
killedBy: operators/generic/length fails with TypeCheck if container is not an array, a string, a dict or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"
