[Killed] BlockStatement
operators/generic/set.ts:14:42
     }
     const pos = index.data
     const string = container.data as string
-    if (pos < 0 || pos >= string.length) {
-      throw new RangeCheck()
-    }
+    if (pos < 0 || pos >= string.length) {}
     return {
       type: ValueType.string,
killedBy: operators/generic/set fails with RangeCheck if container is a string and index is out of range
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] MethodExpression
operators/generic/set.ts:20:9
     return {
       type: ValueType.string,
       data: [
-        string.substring(0, pos),
+        string,
         String.fromCharCode(value.data),
         string.substring(pos + 1)
killedBy: operators/generic/set sets character code of a string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": "Abc",

[Killed] ArithmeticOperator
operators/generic/set.ts:22:26
       data: [
         string.substring(0, pos),
         String.fromCharCode(value.data),
-        string.substring(pos + 1)
+        string.substring(pos - 1)
       ].join('')
     }
killedBy: operators/generic/set sets character code of a string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": "Abc",

[Killed] MethodExpression
operators/generic/set.ts:22:9
       data: [
         string.substring(0, pos),
         String.fromCharCode(value.data),
-        string.substring(pos + 1)
+        string
       ].join('')
     }
killedBy: operators/generic/set sets character code of a string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": "Abc",

[Killed] EqualityOperator
operators/generic/set.ts:33:9
     }
     const pos = index.data
     const array = container.data as ArrayLike
-    if (pos >= array.length) {
+    if (pos < array.length) {
       throw new RangeCheck()
     }
killedBy: operators/generic/set sets item in an array
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] ConditionalExpression
operators/generic/set.ts:33:9
     }
     const pos = index.data
     const array = container.data as ArrayLike
-    if (pos >= array.length) {
+    if (true) {
       throw new RangeCheck()
     }
killedBy: operators/generic/set sets item in an array
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] BlockStatement
operators/generic/set.ts:52:56
   }
 }
 
-export function * set ({ operands }: State): Generator {
-  const [value, index, container] = operands.check(null, null, null)
-  const setter = setters[container.type]
-  if (setter === undefined) {
-    throw new TypeCheck()
-  }
-  operands.splice(3, setter(container, index, value))
-}
+export function * set ({ operands }: State): Generator {}
 
killedBy: operators/generic/set sets item in an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 22
+ Received  +  0

  Array [
    Object {
-     "data": ArrayLike {

[Killed] BlockStatement
operators/generic/set.ts:55:29
 export function * set ({ operands }: State): Generator {
   const [value, index, container] = operands.check(null, null, null)
   const setter = setters[container.type]
-  if (setter === undefined) {
-    throw new TypeCheck()
-  }
+  if (setter === undefined) {}
   operands.splice(3, setter(container, index, value))
 }
killedBy: operators/generic/set fails with TypeCheck if container is not a string, an array or a dict
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"

[Killed] ConditionalExpression
operators/generic/set.ts:55:7
 export function * set ({ operands }: State): Generator {
   const [value, index, container] = operands.check(null, null, null)
   const setter = setters[container.type]
-  if (setter === undefined) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/generic/set fails with TypeCheck if container is not a string, an array or a dict
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"
