[Killed] BlockStatement
operators/operandstack/roll.ts:5:57
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * roll ({ operands }: State): Generator {
-  const [steps, size] = operands.check(ValueType.integer, ValueType.integer).map(value => value.data as number)
-  if (size <= 0) {
-    throw new RangeCheck()
-  }
-  const values = operands.ref.slice(2, 2 + size).reverse()
-  const rolledValues = [...values, ...values]
-  const from = (size - steps) % size
-  operands.splice(2 + size,
-    // Stryker disable next-line ArithmeticOperator: replacing + with - leads to equivalent result
-    rolledValues.slice(from, from + size))
-}
+export function * roll ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/roll rolls 1 down
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "data": "a",

[Killed] ConditionalExpression
operators/operandstack/roll.ts:7:7
 
 export function * roll ({ operands }: State): Generator {
   const [steps, size] = operands.check(ValueType.integer, ValueType.integer).map(value => value.data as number)
-  if (size <= 0) {
+  if (true) {
     throw new RangeCheck()
   }
killedBy: operators/operandstack/roll rolls 1 down
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] EqualityOperator
operators/operandstack/roll.ts:7:7
 
 export function * roll ({ operands }: State): Generator {
   const [steps, size] = operands.check(ValueType.integer, ValueType.integer).map(value => value.data as number)
-  if (size <= 0) {
+  if (size < 0) {
     throw new RangeCheck()
   }
killedBy: operators/operandstack/roll fails with RangeCheck on invalid size (2)
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] MethodExpression
operators/operandstack/roll.ts:10:18
   if (size <= 0) {
     throw new RangeCheck()
   }
-  const values = operands.ref.slice(2, 2 + size).reverse()
+  const values = operands.ref.slice(2, 2 + size)
   const rolledValues = [...values, ...values]
   const from = (size - steps) % size
killedBy: operators/operandstack/roll rolls 1 down
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,12 +1,12 @@
  Array [
    Object {

[Killed] ArithmeticOperator
operators/operandstack/roll.ts:10:40
   if (size <= 0) {
     throw new RangeCheck()
   }
-  const values = operands.ref.slice(2, 2 + size).reverse()
+  const values = operands.ref.slice(2, 2 - size).reverse()
   const rolledValues = [...values, ...values]
   const from = (size - steps) % size
killedBy: operators/operandstack/roll rolls 1 down (2)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,20 +1,20 @@
  Array [
    Object {

[Killed] ArithmeticOperator
operators/operandstack/roll.ts:12:16
   }
   const values = operands.ref.slice(2, 2 + size).reverse()
   const rolledValues = [...values, ...values]
-  const from = (size - steps) % size
+  const from = (size - steps) * size
   operands.splice(2 + size,
     // Stryker disable next-line ArithmeticOperator: replacing + with - leads to equivalent result
killedBy: operators/operandstack/roll rolls 1 down
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 4
Received:    1

[Killed] ArithmeticOperator
operators/operandstack/roll.ts:12:17
   }
   const values = operands.ref.slice(2, 2 + size).reverse()
   const rolledValues = [...values, ...values]
-  const from = (size - steps) % size
+  const from = (size + steps) % size
   operands.splice(2 + size,
     // Stryker disable next-line ArithmeticOperator: replacing + with - leads to equivalent result
killedBy: operators/operandstack/roll rolls 1 down
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -1,16 +1,16 @@
  Array [
    Object {

[Killed] ArithmeticOperator
operators/operandstack/roll.ts:13:19
   const values = operands.ref.slice(2, 2 + size).reverse()
   const rolledValues = [...values, ...values]
   const from = (size - steps) % size
-  operands.splice(2 + size,
+  operands.splice(2 - size,
     // Stryker disable next-line ArithmeticOperator: replacing + with - leads to equivalent result
     rolledValues.slice(from, from + size))
killedBy: operators/operandstack/roll rolls 1 down
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -10,9 +10,9 @@
    Object {
      "data": "b",

[Killed] MethodExpression
operators/operandstack/roll.ts:15:5
   const from = (size - steps) % size
   operands.splice(2 + size,
     // Stryker disable next-line ArithmeticOperator: replacing + with - leads to equivalent result
-    rolledValues.slice(from, from + size))
+    rolledValues)
 }
 
killedBy: operators/operandstack/roll rolls 1 down
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Object {
-     "data": "a",
