[Killed] Regex
state/callstack.ts:15:14
 
 function stringify (text: string): string {
   return JSON.stringify(text
-    .replace(/\r?\n/g, '↵')
+    .replace(/\r\n/g, '↵')
     .replace(/\t/g, '⭲')
   )
killedBy: callstack formats parsed content
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"⭲1↵⭲2↵⭲add\""
Received: "\"⭲1\\n⭲2\\n⭲add\""

[Killed] StringLiteral
state/callstack.ts:16:21
 function stringify (text: string): string {
   return JSON.stringify(text
     .replace(/\r?\n/g, '↵')
-    .replace(/\t/g, '⭲')
+    .replace(/\t/g, "")
   )
 }
killedBy: callstack formats parsed content
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"⭲1↵⭲2↵⭲add\""
Received: "\"1↵2↵add\""

[Killed] EqualityOperator
state/callstack.ts:24:23
   const output = ['{']
   const array: IArray = value.data as IArray
   const { length } = array
-  for (let index = 0; index < length; ++index) {
+  for (let index = 0; index >= length; ++index) {
     const item = array.at(index)
     if (step === index) {
killedBy: callstack shows proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 2 add }"
Received: "{ }"

[Killed] BlockStatement
state/callstack.ts:24:48
   const output = ['{']
   const array: IArray = value.data as IArray
   const { length } = array
-  for (let index = 0; index < length; ++index) {
-    const item = array.at(index)
-    if (step === index) {
-      output.push(BEFORE_CURRENT + formatters[item.type](item) + AFTER_CURRENT)
-    } else {
-      output.push(formatters[item.type](item))
-    }
-  }
+  for (let index = 0; index < length; ++index) {}
   output.push('}')
   return output.join(' ')
killedBy: callstack shows proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 2 add }"
Received: "{ }"

[Killed] ConditionalExpression
state/callstack.ts:26:9
   const { length } = array
   for (let index = 0; index < length; ++index) {
     const item = array.at(index)
-    if (step === index) {
+    if (false) {
       output.push(BEFORE_CURRENT + formatters[item.type](item) + AFTER_CURRENT)
     } else {
killedBy: callstack shows proc with current value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 »2« add }"
Received: "{ 1 2 add }"

[Killed] BlockStatement
state/callstack.ts:26:25
   const { length } = array
   for (let index = 0; index < length; ++index) {
     const item = array.at(index)
-    if (step === index) {
-      output.push(BEFORE_CURRENT + formatters[item.type](item) + AFTER_CURRENT)
-    } else {
+    if (step === index) {} else {
       output.push(formatters[item.type](item))
     }
killedBy: callstack shows proc with current value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 »2« add }"
Received: "{ 1 add }"

[Killed] BlockStatement
state/callstack.ts:28:12
     const item = array.at(index)
     if (step === index) {
       output.push(BEFORE_CURRENT + formatters[item.type](item) + AFTER_CURRENT)
-    } else {
-      output.push(formatters[item.type](item))
-    }
+    } else {}
   }
   output.push('}')
killedBy: callstack shows proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 2 add }"
Received: "{ }"

[Killed] StringLiteral
state/callstack.ts:32:15
       output.push(formatters[item.type](item))
     }
   }
-  output.push('}')
+  output.push("")
   return output.join(' ')
 }
killedBy: callstack shows proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 2 add }"
Received: "{ 1 2 add "

[Killed] StringLiteral
state/callstack.ts:33:22
     }
   }
   output.push('}')
-  return output.join(' ')
+  return output.join("")
 }
 
killedBy: callstack shows proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 2 add }"
Received: "{12add}"

[Killed] BlockStatement
state/callstack.ts:41:29
   [ValueType.integer]: unexpected,
   [ValueType.string]: (value: Value, step: number | undefined): string => {
     const text = value.data as string
-    if (step !== undefined) {
-      const before = text.substring(0, step)
-      const parser = parse(text.substring(step))
-      const { value } = parser.next()
-      if (value === undefined) {
-        throw new Internal(UNEXPECTED_PARSER_FAILURE)
-      }
-      const keyword = formatters[value.type](value)
-      const after = text.substring(step + keyword.length)
-      return stringify(`${before}${BEFORE_CURRENT}${keyword}${AFTER_CURRENT}${after}`)
-    }
+    if (step !== undefined) {}
     return stringify(text)
   },
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\""
Received: "\"1 2 add\""

[Killed] MethodExpression
state/callstack.ts:42:22
   [ValueType.string]: (value: Value, step: number | undefined): string => {
     const text = value.data as string
     if (step !== undefined) {
-      const before = text.substring(0, step)
+      const before = text
       const parser = parse(text.substring(step))
       const { value } = parser.next()
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\""
Received: "\"1 2 add»2« add\""

[Killed] MethodExpression
state/callstack.ts:43:28
     const text = value.data as string
     if (step !== undefined) {
       const before = text.substring(0, step)
-      const parser = parse(text.substring(step))
+      const parser = parse(text)
       const { value } = parser.next()
       if (value === undefined) {
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\""
Received: "\"1 »1« add\""

[Killed] MethodExpression
state/callstack.ts:49:21
         throw new Internal(UNEXPECTED_PARSER_FAILURE)
       }
       const keyword = formatters[value.type](value)
-      const after = text.substring(step + keyword.length)
+      const after = text
       return stringify(`${before}${BEFORE_CURRENT}${keyword}${AFTER_CURRENT}${after}`)
     }
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\""
Received: "\"1 »2«1 2 add\""

[Killed] ArithmeticOperator
state/callstack.ts:49:36
         throw new Internal(UNEXPECTED_PARSER_FAILURE)
       }
       const keyword = formatters[value.type](value)
-      const after = text.substring(step + keyword.length)
+      const after = text.substring(step - keyword.length)
       return stringify(`${before}${BEFORE_CURRENT}${keyword}${AFTER_CURRENT}${after}`)
     }
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\""
Received: "\"1 »2« 2 add\""

[Killed] ConditionalExpression
state/callstack.ts:57:9
   [ValueType.call]: (value: Value): string => formatters[value.type](value),
   [ValueType.operator]: (value: Value, step: number | undefined): string => {
     const base = formatters[value.type](value)
-    if (step !== undefined) {
+    if (true) {
       return `${base}:${step}`
     }
killedBy: callstack shows operator and call
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

- -test-
+ -test-:undefined
  test @test.ps:0

[Killed] ConditionalExpression
state/callstack.ts:57:9
   [ValueType.call]: (value: Value): string => formatters[value.type](value),
   [ValueType.operator]: (value: Value, step: number | undefined): string => {
     const base = formatters[value.type](value)
-    if (step !== undefined) {
+    if (false) {
       return `${base}:${step}`
     }
killedBy: callstack shows operator and call progress
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

- -test-:2
+ -test-
  test @test.ps:0

[Killed] EqualityOperator
state/callstack.ts:73:23
   const { length } = calls
   const callstack: string[] = []
   let step: number | undefined
-  for (let index = 0; index < length; ++index) {
+  for (let index = 0; index <= length; ++index) {
     const value = calls.at(index) as InternalValue
     if (value.type === ValueType.integer) {
killedBy: callstack shows parser
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] UpdateOperator
state/callstack.ts:73:39
   const { length } = calls
   const callstack: string[] = []
   let step: number | undefined
-  for (let index = 0; index < length; ++index) {
+  for (let index = 0; index < length; --index) {
     const value = calls.at(index) as InternalValue
     if (value.type === ValueType.integer) {
killedBy: callstack shows parser
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
state/callstack.ts:75:43
   let step: number | undefined
   for (let index = 0; index < length; ++index) {
     const value = calls.at(index) as InternalValue
-    if (value.type === ValueType.integer) {
-      step = value.data
-      continue
-    }
+    if (value.type === ValueType.integer) {}
     let debugInfo = ''
     const { sourceFile, sourcePos } = value
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

- "1 »2« add"
+ /!\ unexpected stack item type integertype
+ "1 2 add"

[Killed] EqualityOperator
state/callstack.ts:81:9
     }
     let debugInfo = ''
     const { sourceFile, sourcePos } = value
-    if (sourceFile !== undefined && sourcePos !== undefined) {
+    if (sourceFile === undefined && sourcePos !== undefined) {
       debugInfo = ` @${sourceFile}:${sourcePos.toString()}`
     }
killedBy: callstack shows parser with current token and debug info
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\" @test.ps:0"
Received: "\"1 »2« add\""

[Killed] BlockStatement
state/callstack.ts:81:62
     }
     let debugInfo = ''
     const { sourceFile, sourcePos } = value
-    if (sourceFile !== undefined && sourcePos !== undefined) {
-      debugInfo = ` @${sourceFile}:${sourcePos.toString()}`
-    }
+    if (sourceFile !== undefined && sourcePos !== undefined) {}
     const rendered = renderers[value.type](value, step)
     callstack.push(rendered + debugInfo)
killedBy: callstack shows parser with current token and debug info
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\" @test.ps:0"
Received: "\"1 »2« add\""

[Killed] StringLiteral
state/callstack.ts:88:25
     callstack.push(rendered + debugInfo)
     step = undefined
   }
-  return callstack.join('\n')
+  return callstack.join("")
 }
 
killedBy: callstack shows operator and call
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

- -test-
- test @test.ps:0
+ -test-test @test.ps:0
