[Killed] ArithmeticOperator
state/MemoryTracker.ts:9:10
 const stringSizer = (data: string): number => {
   const encoder = new TextEncoder()
   const buffer = encoder.encode(data)
-  return buffer.length + 1 // terminal 0
+  return buffer.length - 1 // terminal 0
 }
 
killedBy: state/MemoryTracker string management small strings counts small string size
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 11
Received: 9

[Killed] EqualityOperator
state/MemoryTracker.ts:34:9
   private _addStringRef (value: Value): number {
     const text = value.data as string
     const size = stringSizer(text)
-    if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
+    if (text.length < MemoryTracker.CACHABLE_STRING_LENGTH) {
       const pos = this._strings.indexOf(text)
       if (pos === -1) {
killedBy: state/MemoryTracker string management small strings counts small string size
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 11
Received: 15

[Killed] BlockStatement
state/MemoryTracker.ts:34:62
   private _addStringRef (value: Value): number {
     const text = value.data as string
     const size = stringSizer(text)
-    if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
-      const pos = this._strings.indexOf(text)
-      if (pos === -1) {
-        this._strings.push(text)
-        this._stringsRefCount.push(1)
-        return size + MemoryTracker.INTEGER_SIZE
-      }
-      ++this._stringsRefCount[pos]
-      return 0
-    }
+    if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {}
     return size
   }
killedBy: state/MemoryTracker string management reference counts big strings stores string in a buffer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 42
Received: 38

[Killed] ConditionalExpression
state/MemoryTracker.ts:36:11
     const size = stringSizer(text)
     if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
       const pos = this._strings.indexOf(text)
-      if (pos === -1) {
+      if (false) {
         this._strings.push(text)
         this._stringsRefCount.push(1)
killedBy: state/MemoryTracker string management reference counts big strings stores string in a buffer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 42
Received: 5

[Killed] UnaryOperator
state/MemoryTracker.ts:36:19
     const size = stringSizer(text)
     if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
       const pos = this._strings.indexOf(text)
-      if (pos === -1) {
+      if (pos === +1) {
         this._strings.push(text)
         this._stringsRefCount.push(1)
killedBy: state/MemoryTracker string management reference counts big strings stores string in a buffer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 42
Received: 5

[Killed] ArithmeticOperator
state/MemoryTracker.ts:39:16
       if (pos === -1) {
         this._strings.push(text)
         this._stringsRefCount.push(1)
-        return size + MemoryTracker.INTEGER_SIZE
+        return size - MemoryTracker.INTEGER_SIZE
       }
       ++this._stringsRefCount[pos]
killedBy: state/MemoryTracker string management reference counts big strings stores string in a buffer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 42
Received: 34

[Killed] UpdateOperator
state/MemoryTracker.ts:41:7
         this._stringsRefCount.push(1)
         return size + MemoryTracker.INTEGER_SIZE
       }
-      ++this._stringsRefCount[pos]
+      --this._stringsRefCount[pos]
       return 0
     }
killedBy: state/MemoryTracker string management reference counts big strings frees memory on last release
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 37

[Killed] BlockStatement
state/MemoryTracker.ts:50:62
   private _releaseString (value: Value): number {
     const text = value.data as string
     const size = stringSizer(text)
-    if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
-      const pos = this._strings.indexOf(text)
-      const refCount = --this._stringsRefCount[pos]
-      if (refCount === 0) {
-        return size + MemoryTracker.INTEGER_SIZE
-      }
-      return 0
-    }
+    if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {}
     return size
   }
killedBy: state/MemoryTracker string management reference counts big strings does not free memory until removed the right number of times
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 42
Received: 9

[Killed] EqualityOperator
state/MemoryTracker.ts:50:9
   private _releaseString (value: Value): number {
     const text = value.data as string
     const size = stringSizer(text)
-    if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
+    if (text.length > MemoryTracker.CACHABLE_STRING_LENGTH) {
       const pos = this._strings.indexOf(text)
       const refCount = --this._stringsRefCount[pos]
killedBy: state/MemoryTracker string management reference counts big strings does not free memory until removed the right number of times
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 42
Received: 9

[Killed] UpdateOperator
state/MemoryTracker.ts:52:24
     const size = stringSizer(text)
     if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
       const pos = this._strings.indexOf(text)
-      const refCount = --this._stringsRefCount[pos]
+      const refCount = ++this._stringsRefCount[pos]
       if (refCount === 0) {
         return size + MemoryTracker.INTEGER_SIZE
killedBy: state/MemoryTracker string management reference counts big strings frees memory on last release
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 37

[Killed] BlockStatement
state/MemoryTracker.ts:53:27
     if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
       const pos = this._strings.indexOf(text)
       const refCount = --this._stringsRefCount[pos]
-      if (refCount === 0) {
-        return size + MemoryTracker.INTEGER_SIZE
-      }
+      if (refCount === 0) {}
       return 0
     }
killedBy: state/MemoryTracker string management reference counts big strings frees memory on last release
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 37

[Killed] ConditionalExpression
state/MemoryTracker.ts:53:11
     if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
       const pos = this._strings.indexOf(text)
       const refCount = --this._stringsRefCount[pos]
-      if (refCount === 0) {
+      if (true) {
         return size + MemoryTracker.INTEGER_SIZE
       }
killedBy: state/MemoryTracker string management reference counts big strings does not free memory until removed the right number of times
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 42
Received: 5

[Killed] ArithmeticOperator
state/MemoryTracker.ts:54:16
       const pos = this._strings.indexOf(text)
       const refCount = --this._stringsRefCount[pos]
       if (refCount === 0) {
-        return size + MemoryTracker.INTEGER_SIZE
+        return size - MemoryTracker.INTEGER_SIZE
       }
       return 0
killedBy: state/MemoryTracker string management reference counts big strings frees memory on last release
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 8

[Killed] BlockStatement
state/MemoryTracker.ts:73:44
     return this._total
   }
 
-  addValueRef (value: InternalValue): void {
-    let valueSize: number = MemoryTracker.VALUE_SIZE
-    if (value.untracked !== true) {
-      if (isString(value)) {
-        valueSize += this._addStringRef(value)
-      } else {
-        ShareableObject.addRef(value)
-      }
-    }
-    this.increment(valueSize)
-  }
+  addValueRef (value: InternalValue): void {}
 
   releaseValue (value: InternalValue): void {
killedBy: state/MemoryTracker integer data type counts bytes for the value
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not 0

[Killed] BooleanLiteral
state/MemoryTracker.ts:75:29
 
   addValueRef (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
-    if (value.untracked !== true) {
+    if (value.untracked !== false) {
       if (isString(value)) {
         valueSize += this._addStringRef(value)
killedBy: state/MemoryTracker string management untracked does not track memory allocated to the string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 42

[Killed] BlockStatement
state/MemoryTracker.ts:75:35
 
   addValueRef (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
-    if (value.untracked !== true) {
-      if (isString(value)) {
-        valueSize += this._addStringRef(value)
-      } else {
-        ShareableObject.addRef(value)
-      }
-    }
+    if (value.untracked !== true) {}
     this.increment(valueSize)
   }
killedBy: state/MemoryTracker string management small strings counts small string size
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 11
Received: 5

[Killed] BlockStatement
state/MemoryTracker.ts:76:28
   addValueRef (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
     if (value.untracked !== true) {
-      if (isString(value)) {
-        valueSize += this._addStringRef(value)
-      } else {
+      if (isString(value)) {} else {
         ShareableObject.addRef(value)
       }
killedBy: state/MemoryTracker string management small strings counts small string size
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 11
Received: 5

[Killed] ConditionalExpression
state/MemoryTracker.ts:76:11
   addValueRef (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
     if (value.untracked !== true) {
-      if (isString(value)) {
+      if (false) {
         valueSize += this._addStringRef(value)
       } else {
killedBy: state/MemoryTracker string management small strings counts small string size
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 11
Received: 5

[Killed] AssignmentOperator
state/MemoryTracker.ts:77:9
     let valueSize: number = MemoryTracker.VALUE_SIZE
     if (value.untracked !== true) {
       if (isString(value)) {
-        valueSize += this._addStringRef(value)
+        valueSize -= this._addStringRef(value)
       } else {
         ShareableObject.addRef(value)
killedBy: state/MemoryTracker string management small strings counts small string size
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 11
Received: -1

[Killed] BlockStatement
state/MemoryTracker.ts:78:14
     if (value.untracked !== true) {
       if (isString(value)) {
         valueSize += this._addStringRef(value)
-      } else {
-        ShareableObject.addRef(value)
-      }
+      } else {}
     }
     this.increment(valueSize)
killedBy: state/MemoryTracker shareable object management arraytype increments reference count on addValueRef
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] BlockStatement
state/MemoryTracker.ts:85:45
     this.increment(valueSize)
   }
 
-  releaseValue (value: InternalValue): void {
-    let valueSize: number = MemoryTracker.VALUE_SIZE
-    if (value.untracked !== true) {
-      if (isString(value)) {
-        valueSize += this._releaseString(value)
-      } else {
-        ShareableObject.release(value)
-      }
-    }
-    this.decrement(valueSize)
-  }
+  releaseValue (value: InternalValue): void {}
 
   increment (bytes: number): void {
killedBy: state/MemoryTracker integer data type frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 5

[Killed] EqualityOperator
state/MemoryTracker.ts:87:9
 
   releaseValue (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
-    if (value.untracked !== true) {
+    if (value.untracked === true) {
       if (isString(value)) {
         valueSize += this._releaseString(value)
killedBy: state/MemoryTracker string management small strings frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 6

[Killed] BlockStatement
state/MemoryTracker.ts:88:28
   releaseValue (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
     if (value.untracked !== true) {
-      if (isString(value)) {
-        valueSize += this._releaseString(value)
-      } else {
+      if (isString(value)) {} else {
         ShareableObject.release(value)
       }
killedBy: state/MemoryTracker string management small strings frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 6

[Killed] AssignmentOperator
state/MemoryTracker.ts:89:9
     let valueSize: number = MemoryTracker.VALUE_SIZE
     if (value.untracked !== true) {
       if (isString(value)) {
-        valueSize += this._releaseString(value)
+        valueSize -= this._releaseString(value)
       } else {
         ShareableObject.release(value)
killedBy: state/MemoryTracker string management small strings frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 12

[Killed] BlockStatement
state/MemoryTracker.ts:90:14
     if (value.untracked !== true) {
       if (isString(value)) {
         valueSize += this._releaseString(value)
-      } else {
-        ShareableObject.release(value)
-      }
+      } else {}
     }
     this.decrement(valueSize)
killedBy: state/MemoryTracker shareable object management arraytype decrements reference count on releaseValue
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
state/MemoryTracker.ts:97:35
     this.decrement(valueSize)
   }
 
-  increment (bytes: number): void {
-    this._used += bytes
-    if (this._used > this._total) {
-      throw new VMError()
-    }
-  }
+  increment (bytes: number): void {}
 
   decrement (bytes: number): void {
killedBy: state/MemoryTracker integer data type counts bytes for the value
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not 0

[Killed] AssignmentOperator
state/MemoryTracker.ts:98:5
   }
 
   increment (bytes: number): void {
-    this._used += bytes
+    this._used -= bytes
     if (this._used > this._total) {
       throw new VMError()
killedBy: state/MemoryTracker integer data type frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: -10

[Killed] EqualityOperator
state/MemoryTracker.ts:99:9
 
   increment (bytes: number): void {
     this._used += bytes
-    if (this._used > this._total) {
+    if (this._used >= this._total) {
       throw new VMError()
     }
killedBy: state/MemoryTracker VMerror does not raise an error when the limit is not exceeded
statusReason: Error: expect(received).not.toThrowError(expected)

Expected constructor: not VMError

Received message: "Virtual memory error"

      226 |         } else {
      227 |           stryCov_9fa48("877");

[Killed] ConditionalExpression
state/MemoryTracker.ts:99:9
 
   increment (bytes: number): void {
     this._used += bytes
-    if (this._used > this._total) {
+    if (true) {
       throw new VMError()
     }
killedBy: state/MemoryTracker integer data type counts bytes for the value
statusReason: VMError: Virtual memory error

[Killed] BlockStatement
state/MemoryTracker.ts:104:35
     }
   }
 
-  decrement (bytes: number): void {
-    this._used -= bytes
-  }
+  decrement (bytes: number): void {}
 }
 
killedBy: state/MemoryTracker integer data type frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 5

[Killed] AssignmentOperator
state/MemoryTracker.ts:105:5
   }
 
   decrement (bytes: number): void {
-    this._used -= bytes
+    this._used += bytes
   }
 }
killedBy: state/MemoryTracker integer data type frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 10
