[Killed] Regex
state/parser.ts:5:19
 import { InternalValue } from './index'
 
 export function * parse (source: string, sourceFile?: string): Generator<InternalValue, void> {
-  const matcher = /%[^\n]*|(?:"([^"]*)")|\s|((?:-|\+)?\d+)|(\[|\]|{|}|[^[\]{}}\s]+)/g
+  const matcher = /%[^\n]*|(?:"([^"]*)")|\s|((?:-|\+)?\d+)|(\[|\]|{|}|[^[\]{}}\s])/g
   let match = matcher.exec(source)
   // Stryker disable next-line BlockStatement
killedBy: state/parser generates calltype "add"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 3

[Killed] Regex
state/parser.ts:5:19
 import { InternalValue } from './index'
 
 export function * parse (source: string, sourceFile?: string): Generator<InternalValue, void> {
-  const matcher = /%[^\n]*|(?:"([^"]*)")|\s|((?:-|\+)?\d+)|(\[|\]|{|}|[^[\]{}}\s]+)/g
+  const matcher = /%[\n]*|(?:"([^"]*)")|\s|((?:-|\+)?\d+)|(\[|\]|{|}|[^[\]{}}\s]+)/g
   let match = matcher.exec(source)
   // Stryker disable next-line BlockStatement
killedBy: state/parser ignores comments and formatting, includes filename
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  0
+ Received  + 48

@@ -1,7 +1,55 @@
  Array [
    Object {

[Killed] ConditionalExpression
state/parser.ts:16:9
       source,
       sourcePos: match.index
     }
-    if (sourceFile !== undefined) {
+    if (false) {
       debugValue.sourceFile = sourceFile
     }
killedBy: state/parser ignores comments and formatting, includes filename
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

@@ -5,11 +5,10 @@
  % This is a comment
  1

[Killed] BlockStatement
state/parser.ts:16:35
       source,
       sourcePos: match.index
     }
-    if (sourceFile !== undefined) {
-      debugValue.sourceFile = sourceFile
-    }
+    if (sourceFile !== undefined) {}
     if (string !== undefined) {
       yield {
killedBy: state/parser ignores comments and formatting, includes filename
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

@@ -5,11 +5,10 @@
  % This is a comment
  1

[Killed] ConditionalExpression
state/parser.ts:19:9
     if (sourceFile !== undefined) {
       debugValue.sourceFile = sourceFile
     }
-    if (string !== undefined) {
+    if (false) {
       yield {
         ...debugValue,
killedBy: state/parser generates stringtype "a"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
state/parser.ts:19:9
     if (sourceFile !== undefined) {
       debugValue.sourceFile = sourceFile
     }
-    if (string !== undefined) {
+    if (true) {
       yield {
         ...debugValue,
killedBy: state/parser generates integertype 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "data": 1,
-   "type": "integertype",

[Killed] ConditionalExpression
state/parser.ts:25:16
         type: ValueType.string,
         data: string
       }
-    } else if (integer !== undefined) {
+    } else if (true) {
       yield {
         ...debugValue,
killedBy: state/parser generates calltype "add"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "data": "add",
-   "type": "calltype",

[Killed] ConditionalExpression
state/parser.ts:25:16
         type: ValueType.string,
         data: string
       }
-    } else if (integer !== undefined) {
+    } else if (false) {
       yield {
         ...debugValue,
killedBy: state/parser generates integertype 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
state/parser.ts:31:36
         type: ValueType.integer,
         data: parseInt(integer, 10)
       }
-    } else if (call !== undefined) {
-      yield {
-        ...debugValue,
-        type: ValueType.call,
-        data: call
-      }
-    }
+    } else if (call !== undefined) {}
     match = matcher.exec(source)
   }
killedBy: state/parser generates calltype "add"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
state/parser.ts:31:16
         type: ValueType.integer,
         data: parseInt(integer, 10)
       }
-    } else if (call !== undefined) {
+    } else if (true) {
       yield {
         ...debugValue,
killedBy: state/parser generates values
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  0
+ Received  + 12

@@ -4,14 +4,26 @@
      "source": "1 2 add",
      "sourcePos": 0,
