[Killed] BlockStatement
objects/dictionaries/types.ts:9:99
   def: (name: string, value: InternalValue) => void
 }
 
-export function checkIWritableDictionary (dict: IDictionary): asserts dict is IWritableDictionary {
-  const method = (dict as object as Record<string, Function>).def
-  if (typeof method !== 'function' || method.length !== 2) {
-    throw new InvalidAccess()
-  }
-}
+export function checkIWritableDictionary (dict: IDictionary): asserts dict is IWritableDictionary {}
 
killedBy: objects/dictionaries/types validates if the dictionary is read-only
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: InvalidAccess

Received function did not throw

[Killed] BlockStatement
objects/dictionaries/types.ts:11:60
 
 export function checkIWritableDictionary (dict: IDictionary): asserts dict is IWritableDictionary {
   const method = (dict as object as Record<string, Function>).def
-  if (typeof method !== 'function' || method.length !== 2) {
-    throw new InvalidAccess()
-  }
+  if (typeof method !== 'function' || method.length !== 2) {}
 }
 
killedBy: objects/dictionaries/types validates if the dictionary is read-only
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: InvalidAccess

Received function did not throw

[Killed] ConditionalExpression
objects/dictionaries/types.ts:11:7
 
 export function checkIWritableDictionary (dict: IDictionary): asserts dict is IWritableDictionary {
   const method = (dict as object as Record<string, Function>).def
-  if (typeof method !== 'function' || method.length !== 2) {
+  if (false) {
     throw new InvalidAccess()
   }
killedBy: objects/dictionaries/types validates if the dictionary is read-only
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: InvalidAccess

Received function did not throw
