[Killed] BlockStatement
objects/stacks/Dictionary.ts:15:39
 
   constructor (tracker: MemoryTracker, hostDictionary?: IDictionary) {
     super(tracker)
-    if (hostDictionary !== undefined) {
-      this.begin(new HostDictionary(hostDictionary))
-    }
+    if (hostDictionary !== undefined) {}
     this.begin(this._systemdict)
     this._globaldict = new Dictionary(tracker)
killedBy: objects/stacks/Dictionary initial setup with a host dictionary contains three dictionaries
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 2

[Killed] BlockStatement
objects/stacks/Dictionary.ts:32:41
     return this._globaldict
   }
 
-  begin (dictionary: IDictionary): void {
-    this.push({
-      type: ValueType.dict,
-      data: dictionary
-    })
-  }
+  begin (dictionary: IDictionary): void {}
 
   end (): void {
killedBy: objects/stacks/Dictionary initial setup contains two dictionaries
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] BlockStatement
objects/stacks/Dictionary.ts:39:16
     })
   }
 
-  end (): void {
-    if (this.length === this._minDictCount) {
-      throw new DictStackUnderflow()
-    }
-    this.pop()
-  }
+  end (): void {}
 
   where (name: string): {
killedBy: objects/stacks/Dictionary begin end removes the top dictionary from the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "data": Anything,
-   "type": "operatortype",

[Killed] BlockStatement
objects/stacks/Dictionary.ts:40:45
   }
 
   end (): void {
-    if (this.length === this._minDictCount) {
-      throw new DictStackUnderflow()
-    }
+    if (this.length === this._minDictCount) {}
     this.pop()
   }
killedBy: objects/stacks/Dictionary begin end fails when attempting to remove pre-installed dictionaries
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: DictStackUnderflow

Received function did not throw

[Killed] ConditionalExpression
objects/stacks/Dictionary.ts:40:9
   }
 
   end (): void {
-    if (this.length === this._minDictCount) {
+    if (false) {
       throw new DictStackUnderflow()
     }
killedBy: objects/stacks/Dictionary begin end fails when attempting to remove pre-installed dictionaries
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: DictStackUnderflow

Received function did not throw

[Killed] BlockStatement
objects/stacks/Dictionary.ts:50:49
     dict: IDictionary
     value: InternalValue
   } | null {
-    for (const dictionaryValue of this._values) {
-      const dictionary = dictionaryValue.data as IDictionary
-      const value = dictionary.lookup(name)
-      if (value !== null) {
-        return {
-          dict: dictionary,
-          value
-        }
-      }
-    }
+    for (const dictionaryValue of this._values) {}
     return null
   }
killedBy: objects/stacks/Dictionary where searches for a known name (from systemdict)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"dict": {"_refCount": 2}, "value": {"data": Anything, "type": "operatortype"}}
Received: null

[Killed] BlockStatement
objects/stacks/Dictionary.ts:53:27
     for (const dictionaryValue of this._values) {
       const dictionary = dictionaryValue.data as IDictionary
       const value = dictionary.lookup(name)
-      if (value !== null) {
-        return {
-          dict: dictionary,
-          value
-        }
-      }
+      if (value !== null) {}
     }
     return null
killedBy: objects/stacks/Dictionary where searches for a known name (from systemdict)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"dict": {"_refCount": 2}, "value": {"data": Anything, "type": "operatortype"}}
Received: null
