[Killed] ConditionalExpression
objects/stacks/Operand.ts:8:9
 
 export class OperandStack extends Stack {
   check (...types: Array<ValueType | null>): InternalValue[] {
-    if (types.length > this._values.length) {
+    if (true) {
       throw new StackUnderflow()
     }
killedBy: objects/stacks/Operand check retreives values of any type (1)
statusReason: StackUnderflow: Not enough operands on the stack to perform the operation

[Killed] EqualityOperator
objects/stacks/Operand.ts:8:9
 
 export class OperandStack extends Stack {
   check (...types: Array<ValueType | null>): InternalValue[] {
-    if (types.length > this._values.length) {
+    if (types.length <= this._values.length) {
       throw new StackUnderflow()
     }
killedBy: objects/stacks/Operand check retreives values of any type (1)
statusReason: StackUnderflow: Not enough operands on the stack to perform the operation

[Killed] EqualityOperator
objects/stacks/Operand.ts:13:11
     }
     return types.map((type: ValueType | null, pos: number): InternalValue => {
       const value = this._values[pos]
-      if (type !== null && value.type !== type) {
+      if (type === null && value.type !== type) {
         throw new TypeCheck()
       }
killedBy: objects/stacks/Operand check retreives values of any type (1)
statusReason: TypeCheck: Operand is of the wrong type

[Killed] LogicalOperator
objects/stacks/Operand.ts:13:11
     }
     return types.map((type: ValueType | null, pos: number): InternalValue => {
       const value = this._values[pos]
-      if (type !== null && value.type !== type) {
+      if (type !== null || value.type !== type) {
         throw new TypeCheck()
       }
killedBy: objects/stacks/Operand check retreives values of any type (1)
statusReason: TypeCheck: Operand is of the wrong type

[Killed] BlockStatement
objects/stacks/Operand.ts:20:74
     })
   }
 
-  splice (count: number, values?: InternalValue | InternalValue[]): void {
-    if (this.length < count) {
-      throw new StackUnderflow()
-    }
-    const removedValues = this._values.splice(0, count)
-    if (values !== undefined) {
-      if (!Array.isArray(values)) {
-        values = [values]
-      }
-      for (const value of values) {
-        this.push(value)
-      }
-    }
-    for (const value of removedValues) {
-      this.releaseValue(value)
-    }
-  }
+  splice (count: number, values?: InternalValue | InternalValue[]): void {}
 
   findMarkPos (): number {
killedBy: objects/stacks/Operand splice removes values from the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 4
Received: 26

[Killed] ConditionalExpression
objects/stacks/Operand.ts:21:9
   }
 
   splice (count: number, values?: InternalValue | InternalValue[]): void {
-    if (this.length < count) {
+    if (false) {
       throw new StackUnderflow()
     }
killedBy: objects/stacks/Operand splice fails with StackUnderflow if not enough values
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: StackUnderflow

Received function did not throw

[Killed] EqualityOperator
objects/stacks/Operand.ts:21:9
   }
 
   splice (count: number, values?: InternalValue | InternalValue[]): void {
-    if (this.length < count) {
+    if (this.length <= count) {
       throw new StackUnderflow()
     }
killedBy: objects/stacks/Operand splice removes values from the stack
statusReason: StackUnderflow: Not enough operands on the stack to perform the operation

[Killed] BlockStatement
objects/stacks/Operand.ts:25:31
       throw new StackUnderflow()
     }
     const removedValues = this._values.splice(0, count)
-    if (values !== undefined) {
-      if (!Array.isArray(values)) {
-        values = [values]
-      }
-      for (const value of values) {
-        this.push(value)
-      }
-    }
+    if (values !== undefined) {}
     for (const value of removedValues) {
       this.releaseValue(value)
killedBy: objects/stacks/Operand splice handling of shared objects does not release if added again (1)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
objects/stacks/Operand.ts:29:35
       if (!Array.isArray(values)) {
         values = [values]
       }
-      for (const value of values) {
-        this.push(value)
-      }
+      for (const value of values) {}
     }
     for (const value of removedValues) {
killedBy: objects/stacks/Operand splice handling of shared objects does not release if added again (1)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
objects/stacks/Operand.ts:33:40
         this.push(value)
       }
     }
-    for (const value of removedValues) {
-      this.releaseValue(value)
-    }
+    for (const value of removedValues) {}
   }
 
killedBy: objects/stacks/Operand splice removes values from the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 4
Received: 26

[Killed] EqualityOperator
objects/stacks/Operand.ts:39:66
   }
 
   findMarkPos (): number {
-    const pos = this._values.findIndex((value: InternalValue) => value.type === ValueType.mark)
+    const pos = this._values.findIndex((value: InternalValue) => value.type !== ValueType.mark)
     if (pos === -1) {
       throw new UnmatchedMark()
killedBy: objects/stacks/Operand findMarkPos gives position of the mark (1)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ArrowFunction
objects/stacks/Operand.ts:39:40
   }
 
   findMarkPos (): number {
-    const pos = this._values.findIndex((value: InternalValue) => value.type === ValueType.mark)
+    const pos = this._values.findIndex(() => undefined)
     if (pos === -1) {
       throw new UnmatchedMark()
killedBy: objects/stacks/Operand findMarkPos gives position of the mark (1)
statusReason: UnmatchedMark: Unmatched mark in the operand stack

[Killed] ConditionalExpression
objects/stacks/Operand.ts:40:9
 
   findMarkPos (): number {
     const pos = this._values.findIndex((value: InternalValue) => value.type === ValueType.mark)
-    if (pos === -1) {
+    if (true) {
       throw new UnmatchedMark()
     }
killedBy: objects/stacks/Operand findMarkPos gives position of the mark (1)
statusReason: UnmatchedMark: Unmatched mark in the operand stack

[Killed] BlockStatement
objects/stacks/Operand.ts:40:21
 
   findMarkPos (): number {
     const pos = this._values.findIndex((value: InternalValue) => value.type === ValueType.mark)
-    if (pos === -1) {
-      throw new UnmatchedMark()
-    }
+    if (pos === -1) {}
     return pos
   }
killedBy: objects/stacks/Operand findMarkPos fails with UnmatchedMark if no mark found
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: UnmatchedMark

Received function did not throw
