[Killed] BlockStatement
objects/stacks/Stack.ts:6:51
 import { BaseArray } from '../BaseArray'
 
 export class Stack extends BaseArray {
-  protected pushImpl (value: InternalValue): void {
-    this._values.unshift(value)
-  }
+  protected pushImpl (value: InternalValue): void {}
 
   protected popImpl (): InternalValue {
killedBy: objects/stacks/Stack offers an array reference
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "data": 2,

[Killed] BlockStatement
objects/stacks/Stack.ts:14:16
     return this._values.shift() as InternalValue
   }
 
-  pop (): void {
-    if (this._values.length === 0) {
-      throw new StackUnderflow()
-    }
-    super.pop()
-  }
+  pop (): void {}
 }
 
killedBy: objects/stacks/Stack implements a LIFO stack (pop)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

  Array [
    Object {
+     "data": 2,

[Killed] ConditionalExpression
objects/stacks/Stack.ts:15:9
   }
 
   pop (): void {
-    if (this._values.length === 0) {
+    if (true) {
       throw new StackUnderflow()
     }
killedBy: objects/stacks/Stack implements a LIFO stack (pop)
statusReason: StackUnderflow: Not enough operands on the stack to perform the operation

[Killed] BlockStatement
objects/stacks/Stack.ts:15:36
   }
 
   pop (): void {
-    if (this._values.length === 0) {
-      throw new StackUnderflow()
-    }
+    if (this._values.length === 0) {}
     super.pop()
   }
killedBy: objects/stacks/Stack fails pop with StackUnderflow after all items were removed
statusReason: Error: expect(received).toThrowError(expected)

Expected constructor: StackUnderflow
Received constructor: InternalError

Received message: "Empty array"

      132 |         } else {
