[Killed] BlockStatement
operators/array/aload.ts:6:58
 import { TypeCheck } from '../../errors/index'
 import { ArrayLike } from '../../objects/Array'
 
-export function * aload ({ operands }: State): Generator {
-  const [{ type, data }] = operands.check(null)
-  if (![ValueType.array, ValueType.block, ValueType.proc].includes(type)) {
-    throw new TypeCheck()
-  }
-  const array = data as unknown as ArrayLike
-  const { length } = array
-  array.addRef()
-  try {
-    operands.pop()
-    for (let index = 0; index < length; ++index) {
-      const value = array.at(index)
-      operands.push(value)
-    }
-  } finally {
-    array.release()
-  }
-}
+export function * aload ({ operands }: State): Generator {}
 
killedBy: operators/array/aload pushes all the element of the array
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    1

[Killed] ConditionalExpression
operators/array/aload.ts:8:7
 
 export function * aload ({ operands }: State): Generator {
   const [{ type, data }] = operands.check(null)
-  if (![ValueType.array, ValueType.block, ValueType.proc].includes(type)) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/array/aload fails with TypeCheck if not an array or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"

[Killed] BlockStatement
operators/array/aload.ts:8:75
 
 export function * aload ({ operands }: State): Generator {
   const [{ type, data }] = operands.check(null)
-  if (![ValueType.array, ValueType.block, ValueType.proc].includes(type)) {
-    throw new TypeCheck()
-  }
+  if (![ValueType.array, ValueType.block, ValueType.proc].includes(type)) {}
   const array = data as unknown as ArrayLike
   const { length } = array
killedBy: operators/array/aload fails with TypeCheck if not an array or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"

[Killed] BlockStatement
operators/array/aload.ts:14:7
   const array = data as unknown as ArrayLike
   const { length } = array
   array.addRef()
-  try {
-    operands.pop()
-    for (let index = 0; index < length; ++index) {
-      const value = array.at(index)
-      operands.push(value)
-    }
-  } finally {
+  try {} finally {
     array.release()
   }
killedBy: operators/array/aload pushes all the element of the array
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    1

[Killed] EqualityOperator
operators/array/aload.ts:16:25
   array.addRef()
   try {
     operands.pop()
-    for (let index = 0; index < length; ++index) {
+    for (let index = 0; index >= length; ++index) {
       const value = array.at(index)
       operands.push(value)
killedBy: operators/array/aload pushes all the element of the array
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    0

[Killed] BlockStatement
operators/array/aload.ts:16:50
   array.addRef()
   try {
     operands.pop()
-    for (let index = 0; index < length; ++index) {
-      const value = array.at(index)
-      operands.push(value)
-    }
+    for (let index = 0; index < length; ++index) {}
   } finally {
     array.release()
killedBy: operators/array/aload pushes all the element of the array
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    0

[Killed] BlockStatement
operators/array/aload.ts:20:13
       const value = array.at(index)
       operands.push(value)
     }
-  } finally {
-    array.release()
-  }
+  } finally {}
 }
 
killedBy: operators/array/aload pushes all the element of the array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 65
