[Killed] BlockStatement
operators/array/apop.ts:7:57
 import { ShareableObject } from '../../objects/ShareableObject'
 import { RangeCheck } from '../../errors'
 
-export function * apop ({ operands }: State): Generator {
-  const [{ data }] = operands.check(ValueType.array)
-  const array = data as unknown as ArrayLike
-  const value = array.ref.at(-1)
-  if (value === undefined) {
-    throw new RangeCheck()
-  }
-  ShareableObject.addRef(value)
-  array.pop()
-  operands.splice(1, value)
-}
+export function * apop ({ operands }: State): Generator {}
 
killedBy: operators/array/apop removes the last element of  the array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  3
+ Received  + 25

  Array [
    Object {
+     "data": 3,

[Killed] UnaryOperator
operators/array/apop.ts:10:30
 export function * apop ({ operands }: State): Generator {
   const [{ data }] = operands.check(ValueType.array)
   const array = data as unknown as ArrayLike
-  const value = array.ref.at(-1)
+  const value = array.ref.at(+1)
   if (value === undefined) {
     throw new RangeCheck()
killedBy: operators/array/apop removes the last element of  the array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,11 +6,11 @@
    Object {
      "data": 1,
