[Killed] BlockStatement
operators/array/join.ts:6:50
 import { State } from '../../state/index'
 import { ArrayLike } from '../../objects/Array'
 
-export function * join (state: State): Generator {
-  const { operands } = state
-  const [{ data }] = operands.check(ValueType.array)
-  const array = data as unknown as ArrayLike
-  if (array.some(value => value.type !== ValueType.string)) {
-    throw new TypeCheck()
-  }
-  const strings = array.ref.map(value => value.data as string)
-  operands.splice(1, {
-    type: ValueType.string,
-    data: strings.join('')
-  })
-}
+export function * join (state: State): Generator {}
 
killedBy: operators/array/join converts a string array into a string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 27

  Array [
    Object {
-     "data": "Hello World !",

[Killed] ConditionalExpression
operators/array/join.ts:10:7
   const { operands } = state
   const [{ data }] = operands.check(ValueType.array)
   const array = data as unknown as ArrayLike
-  if (array.some(value => value.type !== ValueType.string)) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/array/join fails with TypeCheck if not a string array
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
operators/array/join.ts:10:7
   const { operands } = state
   const [{ data }] = operands.check(ValueType.array)
   const array = data as unknown as ArrayLike
-  if (array.some(value => value.type !== ValueType.string)) {
+  if (true) {
     throw new TypeCheck()
   }
killedBy: operators/array/join converts a string array into a string
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] ArrowFunction
operators/array/join.ts:13:33
   if (array.some(value => value.type !== ValueType.string)) {
     throw new TypeCheck()
   }
-  const strings = array.ref.map(value => value.data as string)
+  const strings = array.ref.map(() => undefined)
   operands.splice(1, {
     type: ValueType.string,
killedBy: operators/array/join converts a string array into a string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": "Hello World !",
