[Killed] BlockStatement
operators/array/apush.ts:5:58
 import { ValueType } from '../../index'
 import { ArrayLike } from '../../objects/Array'
 
-export function * apush ({ operands }: State): Generator {
-  const [value, { data }] = operands.check(null, ValueType.array)
-  const array = data as unknown as ArrayLike
-  array.push(value)
-  operands.splice(2)
-}
+export function * apush ({ operands }: State): Generator {}
 
killedBy: operators/array/apush pushes the element in the array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]
