[Killed] BlockStatement
operators/constant/mark.ts:4:57
 import { State } from '../../state/index'
 import { ValueType } from '../../index'
 
-export function * mark ({ operands }: State): Generator {
-  operands.push({
-    type: ValueType.mark,
-    data: null
-  })
-}
+export function * mark ({ operands }: State): Generator {}
 
killedBy: operators/constant/mark adds a mark
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0
