[Killed] BlockStatement
operators/dict/dict.ts:5:50
 import { State } from '../../state/index'
 import { Dictionary } from '../../objects/dictionaries/index'
 
-export function * dict (state: State): Generator {
-  const dict = new Dictionary(state.memoryTracker)
-  state.operands.push({
-    type: ValueType.dict,
-    data: dict
-  })
-  dict.release()
-}
+export function * dict (state: State): Generator {}
 
killedBy: operators/dict/dict creates a new dictionary
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
