[Killed] EqualityOperator
operators/dict/dicttomark.ts:9:7
 export function * dicttomark (state: State): Generator {
   const { operands } = state
   const pos = operands.findMarkPos()
-  if (pos % 2 !== 0) {
+  if (pos % 2 === 0) {
     throw new TypeCheck()
   }
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] BlockStatement
operators/dict/dicttomark.ts:9:22
 export function * dicttomark (state: State): Generator {
   const { operands } = state
   const pos = operands.findMarkPos()
-  if (pos % 2 !== 0) {
-    throw new TypeCheck()
-  }
+  if (pos % 2 !== 0) {}
   const names = operands.ref.slice(0, pos).filter((_, index) => index % 2 === 1)
   if (names.some(value => value.type !== ValueType.string)) {
killedBy: operators/dict/dicttomark fails with TypeCheck if the stack does not contain the expected pairs
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] MethodExpression
operators/dict/dicttomark.ts:12:17
   if (pos % 2 !== 0) {
     throw new TypeCheck()
   }
-  const names = operands.ref.slice(0, pos).filter((_, index) => index % 2 === 1)
+  const names = operands.ref.filter((_, index) => index % 2 === 1)
   if (names.some(value => value.type !== ValueType.string)) {
     throw new TypeCheck()
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack (2)
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] EqualityOperator
operators/dict/dicttomark.ts:12:65
   if (pos % 2 !== 0) {
     throw new TypeCheck()
   }
-  const names = operands.ref.slice(0, pos).filter((_, index) => index % 2 === 1)
+  const names = operands.ref.slice(0, pos).filter((_, index) => index % 2 !== 1)
   if (names.some(value => value.type !== ValueType.string)) {
     throw new TypeCheck()
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack (2)
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] ConditionalExpression
operators/dict/dicttomark.ts:13:7
     throw new TypeCheck()
   }
   const names = operands.ref.slice(0, pos).filter((_, index) => index % 2 === 1)
-  if (names.some(value => value.type !== ValueType.string)) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/dict/dicttomark fails with TypeCheck if the stack does not contain the expected pairs (2)
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
operators/dict/dicttomark.ts:13:7
     throw new TypeCheck()
   }
   const names = operands.ref.slice(0, pos).filter((_, index) => index % 2 === 1)
-  if (names.some(value => value.type !== ValueType.string)) {
+  if (true) {
     throw new TypeCheck()
   }
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] BlockStatement
operators/dict/dicttomark.ts:17:7
     throw new TypeCheck()
   }
   const dict = new Dictionary(state.memoryTracker)
-  try {
-    names.forEach((name: InternalValue, index: number) => {
-      let value: InternalValue = operands.ref[2 * index]
-      if (value.type === ValueType.block) {
-        value = {
-          ...value,
-          type: ValueType.proc
-        }
-      }
-      dict.def(name.data as string, value)
-    })
-    operands.splice(pos + 1, {
-      type: ValueType.dict,
-      data: dict
-    })
-  } finally {
+  try {} finally {
     dict.release()
   }
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] BlockStatement
operators/dict/dicttomark.ts:18:59
   }
   const dict = new Dictionary(state.memoryTracker)
   try {
-    names.forEach((name: InternalValue, index: number) => {
-      let value: InternalValue = operands.ref[2 * index]
-      if (value.type === ValueType.block) {
-        value = {
-          ...value,
-          type: ValueType.proc
-        }
-      }
-      dict.def(name.data as string, value)
-    })
+    names.forEach((name: InternalValue, index: number) => {})
     operands.splice(pos + 1, {
       type: ValueType.dict,
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack (2)
statusReason: Error: expect(received).toBeUndefined()

Received: [Undefined: Name is not defined in the dictionary stack]

[Killed] ArithmeticOperator
operators/dict/dicttomark.ts:19:47
   const dict = new Dictionary(state.memoryTracker)
   try {
     names.forEach((name: InternalValue, index: number) => {
-      let value: InternalValue = operands.ref[2 * index]
+      let value: InternalValue = operands.ref[2 / index]
       if (value.type === ValueType.block) {
         value = {
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack (2)
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeError: Cannot read properties of undefined (reading 'type')]

[Killed] BlockStatement
operators/dict/dicttomark.ts:20:43
   try {
     names.forEach((name: InternalValue, index: number) => {
       let value: InternalValue = operands.ref[2 * index]
-      if (value.type === ValueType.block) {
-        value = {
-          ...value,
-          type: ValueType.proc
-        }
-      }
+      if (value.type === ValueType.block) {}
       dict.def(name.data as string, value)
     })
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack (3)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Array [
    Object {
-     "data": 3,

[Killed] ArithmeticOperator
operators/dict/dicttomark.ts:28:21
       }
       dict.def(name.data as string, value)
     })
-    operands.splice(pos + 1, {
+    operands.splice(pos - 1, {
       type: ValueType.dict,
       data: dict
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack (2)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -10,21 +10,21 @@
    Object {
      "data": 0,

[Killed] BlockStatement
operators/dict/dicttomark.ts:32:13
       type: ValueType.dict,
       data: dict
     })
-  } finally {
-    dict.release()
-  }
+  } finally {}
 }
 
killedBy: operators/dict/dicttomark builds a dictionary from values in the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 38
