[Killed] BlockStatement
operators/dictstack/bind.ts:9:35
 export function * bind ({ operands, dictionaries }: State): Generator {
   const [block] = operands.check(ValueType.block)
   const blocks: ArrayLike[] = [block.data as unknown as ArrayLike]
-  for (const procArray of blocks) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
-      const value = procArray.at(index)
-      if (value.type === ValueType.call) {
-        yield // bind cycle
-        try {
-          const resolvedValue = dictionaries.lookup(value.data)
-          // TODO: some operators can be replaced with values (true, false, mark...)
-          procArray.set(index, {
-            ...value, // propagate debug infos
-            ...resolvedValue
-          })
-        } catch (e) {
-          if (!(e instanceof Undefined)) {
-            throw e
-          }
-        }
-      } else if (value.type === ValueType.block) {
-        blocks.push(value.data as unknown as ArrayLike)
-      }
-    }
-  }
+  for (const procArray of blocks) {}
 }
 
killedBy: operators/dictstack/bind replaces block calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] EqualityOperator
operators/dictstack/bind.ts:10:25
   const [block] = operands.check(ValueType.block)
   const blocks: ArrayLike[] = [block.data as unknown as ArrayLike]
   for (const procArray of blocks) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
+    for (let index = 0; index <= procArray.ref.length; ++index) {
       const value = procArray.at(index)
       if (value.type === ValueType.call) {
killedBy: operators/dictstack/bind replaces block calls with their callees
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] EqualityOperator
operators/dictstack/bind.ts:10:25
   const [block] = operands.check(ValueType.block)
   const blocks: ArrayLike[] = [block.data as unknown as ArrayLike]
   for (const procArray of blocks) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
+    for (let index = 0; index >= procArray.ref.length; ++index) {
       const value = procArray.at(index)
       if (value.type === ValueType.call) {
killedBy: operators/dictstack/bind replaces block calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] BlockStatement
operators/dictstack/bind.ts:12:42
   for (const procArray of blocks) {
     for (let index = 0; index < procArray.ref.length; ++index) {
       const value = procArray.at(index)
-      if (value.type === ValueType.call) {
-        yield // bind cycle
-        try {
-          const resolvedValue = dictionaries.lookup(value.data)
-          // TODO: some operators can be replaced with values (true, false, mark...)
-          procArray.set(index, {
-            ...value, // propagate debug infos
-            ...resolvedValue
-          })
-        } catch (e) {
-          if (!(e instanceof Undefined)) {
-            throw e
-          }
-        }
-      } else if (value.type === ValueType.block) {
+      if (value.type === ValueType.call) {} else if (value.type === ValueType.block) {
         blocks.push(value.data as unknown as ArrayLike)
       }
killedBy: operators/dictstack/bind replaces block calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] BlockStatement
operators/dictstack/bind.ts:14:13
       const value = procArray.at(index)
       if (value.type === ValueType.call) {
         yield // bind cycle
-        try {
-          const resolvedValue = dictionaries.lookup(value.data)
-          // TODO: some operators can be replaced with values (true, false, mark...)
-          procArray.set(index, {
-            ...value, // propagate debug infos
-            ...resolvedValue
-          })
-        } catch (e) {
+        try {} catch (e) {
           if (!(e instanceof Undefined)) {
             throw e
killedBy: operators/dictstack/bind replaces block calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] BlockStatement
operators/dictstack/bind.ts:21:21
             ...value, // propagate debug infos
             ...resolvedValue
           })
-        } catch (e) {
-          if (!(e instanceof Undefined)) {
-            throw e
-          }
-        }
+        } catch (e) {}
       } else if (value.type === ValueType.block) {
         blocks.push(value.data as unknown as ArrayLike)
killedBy: operators/dictstack/bind should not ignore errors
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
operators/dictstack/bind.ts:22:15
             ...resolvedValue
           })
         } catch (e) {
-          if (!(e instanceof Undefined)) {
+          if (true) {
             throw e
           }
killedBy: operators/dictstack/bind should not fail if a call cannot be bound yet
statusReason: Error: expect(received).toBeUndefined()

Received: [Undefined: Name is not defined in the dictionary stack]

[Killed] BooleanLiteral
operators/dictstack/bind.ts:22:15
             ...resolvedValue
           })
         } catch (e) {
-          if (!(e instanceof Undefined)) {
+          if (e instanceof Undefined) {
             throw e
           }
killedBy: operators/dictstack/bind should not fail if a call cannot be bound yet
statusReason: Error: expect(received).toBeUndefined()

Received: [Undefined: Name is not defined in the dictionary stack]

[Killed] ConditionalExpression
operators/dictstack/bind.ts:26:18
             throw e
           }
         }
-      } else if (value.type === ValueType.block) {
+      } else if (true) {
         blocks.push(value.data as unknown as ArrayLike)
       }
killedBy: operators/dictstack/bind replaces block calls with their callees
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeError: Cannot read properties of undefined (reading 'length')]

[Killed] EqualityOperator
operators/dictstack/bind.ts:26:18
             throw e
           }
         }
-      } else if (value.type === ValueType.block) {
+      } else if (value.type !== ValueType.block) {
         blocks.push(value.data as unknown as ArrayLike)
       }
killedBy: operators/dictstack/bind replaces block calls with their callees
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeError: Cannot read properties of undefined (reading 'length')]
