[Killed] BlockStatement
operators/dictstack/begin.ts:4:72
 import { IDictionary, ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * begin ({ operands, dictionaries }: State): Generator {
-  const [dict] = operands.check(ValueType.dict)
-  dictionaries.begin(dict.data as IDictionary)
-  operands.pop()
-}
+export function * begin ({ operands, dictionaries }: State): Generator {}
 
killedBy: operators/dictstack/begin adds the dictionary to the dictionary stack
statusReason: Error: expect(received).toBeUndefined()

Received: [DictStackUnderflow: No custom dictionary left to unstack]
