[Killed] BlockStatement
operators/dictstack/def.ts:5:70
 import { checkIWritableDictionary } from '../../objects/dictionaries/index'
 import { State } from '../../state/index'
 
-export function * def ({ operands, dictionaries }: State): Generator {
-  const [value, name] = operands.check(null, ValueType.string)
-  const { data: top } = dictionaries.at(0)
-  const topDict = top as IDictionary
-  checkIWritableDictionary(topDict)
-  if (value.type === ValueType.block) {
-    topDict.def(name.data as string, {
-      ...value,
-      type: ValueType.proc
-    })
-  } else {
-    topDict.def(name.data as string, value)
-  }
-  operands.splice(2)
-}
+export function * def ({ operands, dictionaries }: State): Generator {}
 
killedBy: operators/dictstack/def sets a value on the top dictionary
statusReason: Error: expect(received).toBeUndefined()

Received: [Undefined: Name is not defined in the dictionary stack]

[Killed] BlockStatement
operators/dictstack/def.ts:10:39
   const { data: top } = dictionaries.at(0)
   const topDict = top as IDictionary
   checkIWritableDictionary(topDict)
-  if (value.type === ValueType.block) {
-    topDict.def(name.data as string, {
-      ...value,
-      type: ValueType.proc
-    })
-  } else {
+  if (value.type === ValueType.block) {} else {
     topDict.def(name.data as string, value)
   }
killedBy: operators/dictstack/def sets a procedure on the top dictionary
statusReason: Error: expect(received).toBeUndefined()

Received: [Undefined: Name is not defined in the dictionary stack]

[Killed] BlockStatement
operators/dictstack/def.ts:15:10
       ...value,
       type: ValueType.proc
     })
-  } else {
-    topDict.def(name.data as string, value)
-  }
+  } else {}
   operands.splice(2)
 }
killedBy: operators/dictstack/def sets a value on the top dictionary
statusReason: Error: expect(received).toBeUndefined()

Received: [Undefined: Name is not defined in the dictionary stack]
