[Killed] BlockStatement
operators/dictstack/currentdict.ts:3:78
 import { State } from '../../state/index'
 
-export function * currentdict ({ operands, dictionaries }: State): Generator {
-  operands.push(dictionaries.at(0))
-}
+export function * currentdict ({ operands, dictionaries }: State): Generator {}
 
killedBy: operators/dictstack/currentdict puts the current dictionary on top of the stack
statusReason: Error: expect(received).toBeUndefined()

Received: [StackUnderflow: Not enough operands on the stack to perform the operation]
