[Killed] BlockStatement
operators/dictstack/dictstack.ts:5:55
 import { ArrayLike } from '../../objects/Array'
 import { ValueType } from '../../index'
 
-export function * dictstack (state: State): Generator {
-  const array = new ArrayLike(state.memoryTracker)
-  const { operands, dictionaries } = state
-  try {
-    for (const value of dictionaries.ref) {
-      array.push(value)
-    }
-    operands.push({
-      type: ValueType.array,
-      data: array
-    })
-  } finally {
-    array.release()
-  }
-}
+export function * dictstack (state: State): Generator {}
 
killedBy: operators/dictstack/dictstack puts an array containing the dictionary stack on top of the stack
statusReason: Error: expect(received).toBeUndefined()

Received: [StackUnderflow: Not enough operands on the stack to perform the operation]

[Killed] BlockStatement
operators/dictstack/dictstack.ts:8:7
 export function * dictstack (state: State): Generator {
   const array = new ArrayLike(state.memoryTracker)
   const { operands, dictionaries } = state
-  try {
-    for (const value of dictionaries.ref) {
-      array.push(value)
-    }
-    operands.push({
-      type: ValueType.array,
-      data: array
-    })
-  } finally {
+  try {} finally {
     array.release()
   }
killedBy: operators/dictstack/dictstack puts an array containing the dictionary stack on top of the stack
statusReason: Error: expect(received).toBeUndefined()

Received: [StackUnderflow: Not enough operands on the stack to perform the operation]

[Killed] BlockStatement
operators/dictstack/dictstack.ts:9:43
   const array = new ArrayLike(state.memoryTracker)
   const { operands, dictionaries } = state
   try {
-    for (const value of dictionaries.ref) {
-      array.push(value)
-    }
+    for (const value of dictionaries.ref) {}
     operands.push({
       type: ValueType.array,
killedBy: operators/dictstack/dictstack puts an array containing the dictionary stack on top of the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": 2,

[Killed] BlockStatement
operators/dictstack/dictstack.ts:16:13
       type: ValueType.array,
       data: array
     })
-  } finally {
-    array.release()
-  }
+  } finally {}
 }
 
killedBy: operators/dictstack/dictstack puts an array containing the dictionary stack on top of the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 56
