[Killed] BlockStatement
operators/dictstack/globaldict.ts:4:77
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * globaldict ({ operands, dictionaries }: State): Generator {
-  operands.push({
-    type: ValueType.dict,
-    data: dictionaries.globaldict
-  })
-}
+export function * globaldict ({ operands, dictionaries }: State): Generator {}
 
killedBy: operators/dictstack/globaldict puts the globaldict on top of the stack
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
