[Killed] BlockStatement
operators/dictstack/systemdict.ts:4:77
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * systemdict ({ operands, dictionaries }: State): Generator {
-  operands.push({
-    type: ValueType.dict,
-    data: dictionaries.systemdict
-  })
-}
+export function * systemdict ({ operands, dictionaries }: State): Generator {}
 
killedBy: operators/dictstack/systemdict puts the systemdict on top of the stack
statusReason: RangeCheck: Operand is too big or too small
