[Killed] BlockStatement
operators/dictstack/where.ts:4:72
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * where ({ operands, dictionaries }: State): Generator {
-  const [name] = operands.check(ValueType.string)
-  const result = dictionaries.where(name.data as string)
-  if (result === null) {
-    operands.splice(1, {
-      type: ValueType.boolean,
-      data: false
-    })
-  } else {
-    operands.splice(1, [{
-      type: ValueType.dict,
-      data: result.dict
-    }, {
-      type: ValueType.boolean,
-      data: true
-    }])
-  }
-}
+export function * where ({ operands, dictionaries }: State): Generator {}
 
killedBy: operators/dictstack/where returns the dictionary and true when found
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    2

[Killed] BlockStatement
operators/dictstack/where.ts:7:24
 export function * where ({ operands, dictionaries }: State): Generator {
   const [name] = operands.check(ValueType.string)
   const result = dictionaries.where(name.data as string)
-  if (result === null) {
-    operands.splice(1, {
-      type: ValueType.boolean,
-      data: false
-    })
-  } else {
+  if (result === null) {} else {
     operands.splice(1, [{
       type: ValueType.dict,
killedBy: operators/dictstack/where returns false when if not found
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,9 +1,9 @@
  Array [
    Object {

[Killed] BlockStatement
operators/dictstack/where.ts:12:10
       type: ValueType.boolean,
       data: false
     })
-  } else {
-    operands.splice(1, [{
-      type: ValueType.dict,
-      data: result.dict
-    }, {
-      type: ValueType.boolean,
-      data: true
-    }])
-  }
+  } else {}
 }
 
killedBy: operators/dictstack/where returns the dictionary and true when found
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    2

[Killed] ArrayDeclaration
operators/dictstack/where.ts:13:24
       data: false
     })
   } else {
-    operands.splice(1, [{
-      type: ValueType.dict,
-      data: result.dict
-    }, {
-      type: ValueType.boolean,
-      data: true
-    }])
+    operands.splice(1, [])
   }
 }
killedBy: operators/dictstack/where returns the dictionary and true when found
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    1
