[Killed] BlockStatement
operators/dictstack/end.ts:3:60
 import { State } from '../../state/index'
 
-export function * end ({ dictionaries }: State): Generator {
-  dictionaries.end()
-}
+export function * end ({ dictionaries }: State): Generator {}
 
killedBy: operators/dictstack/end removes the dictionary from the dictionary stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 3
