[Killed] BlockStatement
operators/flow/ifelse.ts:5:52
 import { ValueType } from '../../index'
 import { ShareableObject } from '../../objects/ShareableObject'
 
-export function * ifelse (state: State): Generator {
-  const { operands } = state
-  const [blockElse, blockIf, condition] = operands.check(ValueType.block, ValueType.block, ValueType.boolean)
-  ShareableObject.addRef([blockIf, blockElse])
-  try {
-    operands.splice(3)
-    if (condition.data as boolean) {
-      yield * state.evalBlockOrProc(blockIf)
-    } else {
-      yield * state.evalBlockOrProc(blockElse)
-    }
-  } finally {
-    ShareableObject.release([blockIf, blockElse])
-  }
-}
+export function * ifelse (state: State): Generator {}
 
killedBy: operators/flow/ifelse evaluates if block if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  2
+ Received  + 30

  Array [
    Object {
-     "data": 42,

[Killed] BlockStatement
operators/flow/ifelse.ts:9:7
   const { operands } = state
   const [blockElse, blockIf, condition] = operands.check(ValueType.block, ValueType.block, ValueType.boolean)
   ShareableObject.addRef([blockIf, blockElse])
-  try {
-    operands.splice(3)
-    if (condition.data as boolean) {
-      yield * state.evalBlockOrProc(blockIf)
-    } else {
-      yield * state.evalBlockOrProc(blockElse)
-    }
-  } finally {
+  try {} finally {
     ShareableObject.release([blockIf, blockElse])
   }
killedBy: operators/flow/ifelse evaluates if block if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  2
+ Received  + 30

  Array [
    Object {
-     "data": 42,

[Killed] BlockStatement
operators/flow/ifelse.ts:11:36
   ShareableObject.addRef([blockIf, blockElse])
   try {
     operands.splice(3)
-    if (condition.data as boolean) {
-      yield * state.evalBlockOrProc(blockIf)
-    } else {
+    if (condition.data as boolean) {} else {
       yield * state.evalBlockOrProc(blockElse)
     }
killedBy: operators/flow/ifelse evaluates if block if true
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Killed] BlockStatement
operators/flow/ifelse.ts:13:12
     operands.splice(3)
     if (condition.data as boolean) {
       yield * state.evalBlockOrProc(blockIf)
-    } else {
-      yield * state.evalBlockOrProc(blockElse)
-    }
+    } else {}
   } finally {
     ShareableObject.release([blockIf, blockElse])
killedBy: operators/flow/ifelse evaluates else block if true
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Killed] BlockStatement
operators/flow/ifelse.ts:16:13
     } else {
       yield * state.evalBlockOrProc(blockElse)
     }
-  } finally {
-    ShareableObject.release([blockIf, blockElse])
-  }
+  } finally {}
 }
 
killedBy: operators/flow/ifelse evaluates if block if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 60
