[Killed] BlockStatement
operators/generic/eq.ts:4:55
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * eq ({ operands }: State): Generator {
-  const [value1, value2] = operands.check(null, null)
-  operands.splice(2, {
-    type: ValueType.boolean,
-    data: value1.type === value2.type && value1.data === value2.data
-  })
-}
+export function * eq ({ operands }: State): Generator {}
 
killedBy: operators/generic/eq outputs 1 == 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": true,

[Killed] EqualityOperator
operators/generic/eq.ts:8:11
   const [value1, value2] = operands.check(null, null)
   operands.splice(2, {
     type: ValueType.boolean,
-    data: value1.type === value2.type && value1.data === value2.data
+    data: value1.type !== value2.type && value1.data === value2.data
   })
 }
killedBy: operators/generic/eq outputs 1 == 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": true,

[Killed] EqualityOperator
operators/generic/eq.ts:8:42
   const [value1, value2] = operands.check(null, null)
   operands.splice(2, {
     type: ValueType.boolean,
-    data: value1.type === value2.type && value1.data === value2.data
+    data: value1.type === value2.type && value1.data !== value2.data
   })
 }
killedBy: operators/generic/eq outputs 1 == 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": true,
