[Killed] BlockStatement
operators/generic/neq.ts:4:56
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * neq ({ operands }: State): Generator {
-  const [value1, value2] = operands.check(null, null)
-  operands.splice(2, {
-    type: ValueType.boolean,
-    data: value1.type !== value2.type || value1.data !== value2.data
-  })
-}
+export function * neq ({ operands }: State): Generator {}
 
killedBy: operators/generic/neq outputs 1 != 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": false,

[Killed] ConditionalExpression
operators/generic/neq.ts:8:11
   const [value1, value2] = operands.check(null, null)
   operands.splice(2, {
     type: ValueType.boolean,
-    data: value1.type !== value2.type || value1.data !== value2.data
+    data: true
   })
 }
killedBy: operators/generic/neq outputs 1 != 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,

[Killed] EqualityOperator
operators/generic/neq.ts:8:11
   const [value1, value2] = operands.check(null, null)
   operands.splice(2, {
     type: ValueType.boolean,
-    data: value1.type !== value2.type || value1.data !== value2.data
+    data: value1.type === value2.type || value1.data !== value2.data
   })
 }
killedBy: operators/generic/neq outputs 1 != 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,
