[Killed] BlockStatement
operators/generic/type.ts:4:57
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * type ({ operands }: State): Generator {
-  const [{ type }] = operands.check(null)
-  operands.splice(1, {
-    type: ValueType.string,
-    data: type
-  })
-}
+export function * type ({ operands }: State): Generator {}
 
killedBy: operators/generic/type gives type of a boolean
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,9 +1,9 @@
  Array [
    Object {
