[Killed] BlockStatement
operators/number/gte.ts:4:49
 import { State } from '../../state/index'
 import { compare } from './integer'
 
-export function * gte (state: State): Generator {
-  compare(state, (value1: number, value2: number) => value1 >= value2)
-}
+export function * gte (state: State): Generator {}
 
killedBy: operators/number/gte outputs 1 > 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": true,

[Killed] ConditionalExpression
operators/number/gte.ts:5:54
 import { compare } from './integer'
 
 export function * gte (state: State): Generator {
-  compare(state, (value1: number, value2: number) => value1 >= value2)
+  compare(state, (value1: number, value2: number) => true)
 }
 
killedBy: operators/number/gte outputs 1 >= 2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,

[Killed] ConditionalExpression
operators/number/gte.ts:5:54
 import { compare } from './integer'
 
 export function * gte (state: State): Generator {
-  compare(state, (value1: number, value2: number) => value1 >= value2)
+  compare(state, (value1: number, value2: number) => false)
 }
 
killedBy: operators/number/gte outputs 1 > 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": true,
