[Killed] BlockStatement
operators/number/integer.ts:8:107
   return operands.check(ValueType.integer, ValueType.integer).map(value => value.data as number)
 }
 
-export function compare (state: State, implementation: (value1: number, value2: number) => boolean): void {
-  const [value2, value1] = extract(state)
-  state.operands.splice(2, {
-    type: ValueType.boolean,
-    data: implementation(value1, value2)
-  })
-}
+export function compare (state: State, implementation: (value1: number, value2: number) => boolean): void {}
 
 export function compute (state: State, implementation: (value1: number, value2: number) => number): void {
killedBy: operators/number/gte outputs 1 > 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": true,

[Killed] BlockStatement
operators/number/integer.ts:16:106
   })
 }
 
-export function compute (state: State, implementation: (value1: number, value2: number) => number): void {
-  const [value2, value1] = extract(state)
-  state.operands.splice(2, {
-    type: ValueType.integer,
-    data: implementation(value1, value2)
-  })
-}
+export function compute (state: State, implementation: (value1: number, value2: number) => number): void {}
 
killedBy: operators/number/add adds two integers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": 3,
