[Killed] BlockStatement
operators/number/lte.ts:4:49
 import { State } from '../../state/index'
 import { compare } from './integer'
 
-export function * lte (state: State): Generator {
-  compare(state, (value1: number, value2: number) => value1 <= value2)
-}
+export function * lte (state: State): Generator {}
 
killedBy: operators/number/lte outputs 1 <= 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": true,

[Killed] ConditionalExpression
operators/number/lte.ts:5:54
 import { compare } from './integer'
 
 export function * lte (state: State): Generator {
-  compare(state, (value1: number, value2: number) => value1 <= value2)
+  compare(state, (value1: number, value2: number) => false)
 }
 
killedBy: operators/number/lte outputs 1 <= 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": true,

[Killed] EqualityOperator
operators/number/lte.ts:5:54
 import { compare } from './integer'
 
 export function * lte (state: State): Generator {
-  compare(state, (value1: number, value2: number) => value1 <= value2)
+  compare(state, (value1: number, value2: number) => value1 > value2)
 }
 
killedBy: operators/number/lte outputs 1 <= 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": true,
