[Killed] BlockStatement
operators/number/sub.ts:4:49
 import { State } from '../../state/index'
 import { compute } from './integer'
 
-export function * sub (state: State): Generator {
-  compute(state, (value1: number, value2: number) => value1 - value2)
-}
+export function * sub (state: State): Generator {}
 
killedBy: operators/number/sub substracts two numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": -1,

[Killed] ArithmeticOperator
operators/number/sub.ts:5:54
 import { compute } from './integer'
 
 export function * sub (state: State): Generator {
-  compute(state, (value1: number, value2: number) => value1 - value2)
+  compute(state, (value1: number, value2: number) => value1 + value2)
 }
 
killedBy: operators/number/sub substracts two numbers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": -1,
