[Killed] BlockStatement
operators/open-close-helper.ts:5:65
 import { ArrayLike } from '../objects/Array'
 import { State } from '../state/index'
 
-export function openWithMark ({ operands, calls }: State): void {
-  const openInstruction = calls.ref[1]
-  operands.push({
-    ...openInstruction, // propagate debug infos
-    type: ValueType.mark,
-    data: null
-  })
-}
+export function openWithMark ({ operands, calls }: State): void {}
 
 export function closeToMark (state: State, type: ValueType.array | ValueType.block): void {
killedBy: operators/array/close-array (]) creates an array
statusReason: Error: expect(received).toBeUndefined()

Received: [UnmatchedMark: Unmatched mark in the operand stack]

[Killed] BlockStatement
operators/open-close-helper.ts:14:91
   })
 }
 
-export function closeToMark (state: State, type: ValueType.array | ValueType.block): void {
-  const { operands } = state
-  const markPos = operands.findMarkPos()
-  const mark = operands.ref[markPos]
-  const array = new ArrayLike(state.memoryTracker)
-  try {
-    let index: number
-    for (index = 0; index < markPos; ++index) {
-      array.unshift(operands.ref[index])
-    }
-    operands.splice(markPos + 1, {
-      ...mark, // propagate debug infos
-      type,
-      data: array
-    })
-  } finally {
-    array.release()
-  }
-}
+export function closeToMark (state: State, type: ValueType.array | ValueType.block): void {}
 
killedBy: operators/array/close-array (]) creates an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 5

[Killed] BlockStatement
operators/open-close-helper.ts:19:7
   const markPos = operands.findMarkPos()
   const mark = operands.ref[markPos]
   const array = new ArrayLike(state.memoryTracker)
-  try {
-    let index: number
-    for (index = 0; index < markPos; ++index) {
-      array.unshift(operands.ref[index])
-    }
-    operands.splice(markPos + 1, {
-      ...mark, // propagate debug infos
-      type,
-      data: array
-    })
-  } finally {
+  try {} finally {
     array.release()
   }
killedBy: operators/array/close-array (]) creates an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 5

[Killed] EqualityOperator
operators/open-close-helper.ts:21:21
   const array = new ArrayLike(state.memoryTracker)
   try {
     let index: number
-    for (index = 0; index < markPos; ++index) {
+    for (index = 0; index >= markPos; ++index) {
       array.unshift(operands.ref[index])
     }
killedBy: operators/array/close-array (]) creates an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] UpdateOperator
operators/open-close-helper.ts:21:38
   const array = new ArrayLike(state.memoryTracker)
   try {
     let index: number
-    for (index = 0; index < markPos; ++index) {
+    for (index = 0; index < markPos; --index) {
       array.unshift(operands.ref[index])
     }
killedBy: operators/array/close-array (]) creates an array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeError: Cannot read properties of undefined (reading 'untracked')]

[Killed] ArithmeticOperator
operators/open-close-helper.ts:24:21
     for (index = 0; index < markPos; ++index) {
       array.unshift(operands.ref[index])
     }
-    operands.splice(markPos + 1, {
+    operands.splice(markPos - 1, {
       ...mark, // propagate debug infos
       type,
killedBy: operators/array/close-array (]) creates an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 5
