[Killed] BlockStatement
operators/operandstack/count.ts:4:58
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * count ({ operands }: State): Generator {
-  operands.push({
-    type: ValueType.integer,
-    data: operands.length
-  })
-}
+export function * count ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/count counts the number of items in the stack
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0
