[Killed] BlockStatement
operators/operandstack/counttomark.ts:4:64
 import { ValueType } from '../../index'
 import { State } from '../../state/index'
 
-export function * counttomark ({ operands }: State): Generator {
-  operands.push({
-    type: ValueType.integer,
-    data: operands.findMarkPos()
-  })
-}
+export function * counttomark ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/counttomark counts the number of items up to the mark
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 6
Received:    5
