[Killed] BlockStatement
operators/operandstack/index-op.ts:5:58
 import { ValueType } from '../../index'
 import { RangeCheck, StackUnderflow } from '../../errors/index'
 
-export function * index ({ operands }: State): Generator {
-  const [pos] = operands.check(ValueType.integer).map(value => value.data as number)
-  if (pos < 0) {
-    throw new RangeCheck()
-  }
-  const valuePos = pos + 1
-  if (valuePos >= operands.length) {
-    throw new StackUnderflow()
-  }
-  operands.splice(1, operands.ref[valuePos])
-}
+export function * index ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/index picks a value in the stack by position
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": "a",

[Killed] EqualityOperator
operators/operandstack/index-op.ts:7:7
 
 export function * index ({ operands }: State): Generator {
   const [pos] = operands.check(ValueType.integer).map(value => value.data as number)
-  if (pos < 0) {
+  if (pos <= 0) {
     throw new RangeCheck()
   }
killedBy: operators/operandstack/index picks a value in the stack by position (2)
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] ConditionalExpression
operators/operandstack/index-op.ts:7:7
 
 export function * index ({ operands }: State): Generator {
   const [pos] = operands.check(ValueType.integer).map(value => value.data as number)
-  if (pos < 0) {
+  if (false) {
     throw new RangeCheck()
   }
killedBy: operators/operandstack/index fails with RangeError when using negative index
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ArithmeticOperator
operators/operandstack/index-op.ts:10:20
   if (pos < 0) {
     throw new RangeCheck()
   }
-  const valuePos = pos + 1
+  const valuePos = pos - 1
   if (valuePos >= operands.length) {
     throw new StackUnderflow()
killedBy: operators/operandstack/index picks a value in the stack by position
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": "a",

[Killed] EqualityOperator
operators/operandstack/index-op.ts:11:7
     throw new RangeCheck()
   }
   const valuePos = pos + 1
-  if (valuePos >= operands.length) {
+  if (valuePos < operands.length) {
     throw new StackUnderflow()
   }
killedBy: operators/operandstack/index picks a value in the stack by position
statusReason: Error: expect(received).toBeUndefined()

Received: [StackUnderflow: Not enough operands on the stack to perform the operation]

[Killed] ConditionalExpression
operators/operandstack/index-op.ts:11:7
     throw new RangeCheck()
   }
   const valuePos = pos + 1
-  if (valuePos >= operands.length) {
+  if (true) {
     throw new StackUnderflow()
   }
killedBy: operators/operandstack/index picks a value in the stack by position
statusReason: Error: expect(received).toBeUndefined()

Received: [StackUnderflow: Not enough operands on the stack to perform the operation]
