[Killed] BlockStatement
operators/operandstack/clear.ts:3:58
 import { State } from '../../state/index'
 
-export function * clear ({ operands }: State): Generator {
-  operands.splice(operands.length)
-}
+export function * clear ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/clear removes all items of the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 2
