[Killed] BlockStatement
operators/operandstack/cleartomark.ts:3:64
 import { State } from '../../state/index'
 
-export function * cleartomark ({ operands }: State): Generator {
-  operands.splice(operands.findMarkPos() + 1)
-}
+export function * cleartomark ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/cleartomark clears the stack up to the mark
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": 2,

[Killed] ArithmeticOperator
operators/operandstack/cleartomark.ts:4:19
 import { State } from '../../state/index'
 
 export function * cleartomark ({ operands }: State): Generator {
-  operands.splice(operands.findMarkPos() + 1)
+  operands.splice(operands.findMarkPos() - 1)
 }
 
killedBy: operators/operandstack/cleartomark clears the stack up to the mark
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Object {
-     "data": 2,
