[Killed] BlockStatement
operators/operandstack/dup.ts:3:56
 import { State } from '../../state/index'
 
-export function * dup ({ operands }: State): Generator {
-  const [value] = operands.check(null)
-  operands.push(value)
-}
+export function * dup ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/dup duplicates top item of the stack
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1
