[Killed] BlockStatement
operators/operandstack/exch.ts:3:57
 import { State } from '../../state/index'
 
-export function * exch ({ operands }: State): Generator {
-  const values = operands.check(null, null)
-  operands.splice(2, values)
-}
+export function * exch ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/exch swaps top items of the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "data": 1,
