[Killed] BlockStatement
operators/operandstack/pop.ts:3:56
 import { State } from '../../state/index'
 
-export function * pop ({ operands }: State): Generator {
-  operands.pop()
-}
+export function * pop ({ operands }: State): Generator {}
 
killedBy: operators/operandstack/pop removes top item of the stack
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": 1,
