[Killed] BooleanLiteral
state/State.ts:14:46
   private readonly _dictionaries: DictionaryStack
   private readonly _operands: OperandStack
   private readonly _calls: Stack
-  private readonly _keepDebugInfo: boolean = false
+  private readonly _keepDebugInfo: boolean = true
   private _noCall: number = 0
   private _parsing: boolean = false
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    Object {
      "data": 1,

[Killed] BooleanLiteral
state/State.ts:16:31
   private readonly _calls: Stack
   private readonly _keepDebugInfo: boolean = false
   private _noCall: number = 0
-  private _parsing: boolean = false
+  private _parsing: boolean = true
 
   constructor (settings: StateFactorySettings = {}) {
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] EqualityOperator
state/State.ts:23:9
     this._dictionaries = new DictionaryStack(this._memoryTracker, settings.hostDictionary)
     this._operands = new OperandStack(this._memoryTracker)
     this._calls = new Stack(this._memoryTracker)
-    if (settings.keepDebugInfo === true) {
+    if (settings.keepDebugInfo !== true) {
       this._keepDebugInfo = true
     }
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    Object {
      "data": 1,

[Killed] BlockStatement
state/State.ts:23:42
     this._dictionaries = new DictionaryStack(this._memoryTracker, settings.hostDictionary)
     this._operands = new OperandStack(this._memoryTracker)
     this._calls = new Stack(this._memoryTracker)
-    if (settings.keepDebugInfo === true) {
-      this._keepDebugInfo = true
-    }
+    if (settings.keepDebugInfo === true) {}
   }
 
killedBy: state/State debug information when on keeps debug information
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "1"
Received: undefined

[Killed] BooleanLiteral
state/State.ts:24:29
     this._operands = new OperandStack(this._memoryTracker)
     this._calls = new Stack(this._memoryTracker)
     if (settings.keepDebugInfo === true) {
-      this._keepDebugInfo = true
+      this._keepDebugInfo = false
     }
   }
killedBy: state/State debug information when on keeps debug information
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "1"
Received: undefined

[Killed] BlockStatement
state/State.ts:55:24
   }
 
   parse (source: string, sourceFile?: string): Generator {
-    if (this._parsing) {
-      this.wrapError(new BusyParsing())
-    }
+    if (this._parsing) {}
     this._parsing = true
     return this.outerParse(source, sourceFile)
killedBy: state/State protection against concurrent execution fails with BusyParsing if an execution is in progress
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
state/State.ts:55:9
   }
 
   parse (source: string, sourceFile?: string): Generator {
-    if (this._parsing) {
+    if (true) {
       this.wrapError(new BusyParsing())
     }
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: at State.parse (C:\Users\I850991\git\arnaud\progbots\engine\.stryker-tmp\sandbox4481113\state\State.ts:143:26)

[Killed] BooleanLiteral
state/State.ts:58:21
     if (this._parsing) {
       this.wrapError(new BusyParsing())
     }
-    this._parsing = true
+    this._parsing = false
     return this.outerParse(source, sourceFile)
   }
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
state/State.ts:72:24
     return this._keepDebugInfo
   }
 
-  preventCall (): void {
-    ++this._noCall
-  }
+  preventCall (): void {}
 
   allowCall (): void {
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 32

[Killed] UpdateOperator
state/State.ts:73:5
   }
 
   preventCall (): void {
-    ++this._noCall
+    --this._noCall
   }
 
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 30

[Killed] BlockStatement
state/State.ts:76:22
     ++this._noCall
   }
 
-  allowCall (): void {
-    --this._noCall
-  }
+  allowCall (): void {}
 
   private wrapError (error: Error): void {
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 30

[Killed] UpdateOperator
state/State.ts:77:5
   }
 
   allowCall (): void {
-    --this._noCall
+    ++this._noCall
   }
 
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 30

[Killed] BlockStatement
state/State.ts:80:42
     --this._noCall
   }
 
-  private wrapError (error: Error): void {
-    // No internal error should go out because memory cannot be controlled (and they are not documented)
-    if (error instanceof Break) {
-      const invalidBreak = new InvalidBreak()
-      invalidBreak.callstack = error.callstack
-      error = invalidBreak
-    }
-    // No internal error should go out because memory cannot be controlled (and they are not documented)
-    if (error instanceof InternalError) {
-      const ex = new Error(error.message)
-      ex.name = error.name
-      ex.stack = error.callstack
-      error.release()
-      throw ex
-    }
-    throw error
-  }
+  private wrapError (error: Error): void {}
 
   private * wrapStep (
killedBy: state/State protection against concurrent execution fails with BusyParsing if an execution is in progress
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
state/State.ts:82:33
 
   private wrapError (error: Error): void {
     // No internal error should go out because memory cannot be controlled (and they are not documented)
-    if (error instanceof Break) {
-      const invalidBreak = new InvalidBreak()
-      invalidBreak.callstack = error.callstack
-      error = invalidBreak
-    }
+    if (error instanceof Break) {}
     // No internal error should go out because memory cannot be controlled (and they are not documented)
     if (error instanceof InternalError) {
killedBy: state/State break and invalid break signals an invalid use of break
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "InvalidBreak"
Received: "Break"

[Killed] BlockStatement
state/State.ts:88:41
       error = invalidBreak
     }
     // No internal error should go out because memory cannot be controlled (and they are not documented)
-    if (error instanceof InternalError) {
-      const ex = new Error(error.message)
-      ex.name = error.name
-      ex.stack = error.callstack
-      error.release()
-      throw ex
-    }
+    if (error instanceof InternalError) {}
     throw error
   }
killedBy: state/State exception handling does not expose internal error type
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not InternalError
Received constructor:     TypeCheck extends InternalError

[Killed] BlockStatement
state/State.ts:105:16
       after: EngineSignal
     },
     step: () => Generator
-  ): Generator {
-    this._calls.push(value)
-    yield signals.before
-    try {
-      yield * step.apply(this)
-    } catch (e) {
-      if (e instanceof InternalError) {
-        e.callstack = renderCallStack(this.calls)
-      }
-      throw e
-    } finally {
-      yield signals.after
-      this._calls.pop()
-    }
-  }
+  ): Generator {}
 
   private * evalCall (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] BlockStatement
state/State.ts:108:9
   ): Generator {
     this._calls.push(value)
     yield signals.before
-    try {
-      yield * step.apply(this)
-    } catch (e) {
+    try {} catch (e) {
       if (e instanceof InternalError) {
         e.callstack = renderCallStack(this.calls)
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 2

[Killed] BlockStatement
state/State.ts:110:17
     yield signals.before
     try {
       yield * step.apply(this)
-    } catch (e) {
-      if (e instanceof InternalError) {
-        e.callstack = renderCallStack(this.calls)
-      }
-      throw e
-    } finally {
+    } catch (e) {} finally {
       yield signals.after
       this._calls.pop()
killedBy: state/State exception handling does not expose internal error type
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
state/State.ts:111:39
     try {
       yield * step.apply(this)
     } catch (e) {
-      if (e instanceof InternalError) {
-        e.callstack = renderCallStack(this.calls)
-      }
+      if (e instanceof InternalError) {}
       throw e
     } finally {
killedBy: state/State exception handling adds the call stack to the exception
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  3
+ Received  + 45

- -typecheck-
- typecheck
- "»typecheck«"

[Killed] BlockStatement
state/State.ts:115:15
         e.callstack = renderCallStack(this.calls)
       }
       throw e
-    } finally {
-      yield signals.after
-      this._calls.pop()
-    }
+    } finally {}
   }
 
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 4

[Killed] BlockStatement
state/State.ts:121:56
     }
   }
 
-  private * evalCall (value: InternalValue): Generator {
-    yield * this.wrapStep(value, {
-      before: EngineSignal.beforeCall,
-      after: EngineSignal.afterCall
-    }, function * (this: State): Generator {
-      yield * this.eval(this._dictionaries.lookup(value.data as string))
-    })
-  }
+  private * evalCall (value: InternalValue): Generator {}
 
   private * evalOperator (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 9

[Killed] BlockStatement
state/State.ts:125:44
     yield * this.wrapStep(value, {
       before: EngineSignal.beforeCall,
       after: EngineSignal.afterCall
-    }, function * (this: State): Generator {
-      yield * this.eval(this._dictionaries.lookup(value.data as string))
-    })
+    }, function * (this: State): Generator {})
   }
 
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 11

[Killed] BlockStatement
state/State.ts:130:60
     })
   }
 
-  private * evalOperator (value: InternalValue): Generator {
-    yield * this.wrapStep(value, {
-      before: EngineSignal.beforeOperator,
-      after: EngineSignal.afterOperator
-    }, function * (this: State): Generator {
-      const operator = value.data as OperatorFunction
-      yield * operator(this)
-    })
-  }
+  private * evalOperator (value: InternalValue): Generator {}
 
   public * evalBlockOrProc (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 11

[Killed] BlockStatement
state/State.ts:134:44
     yield * this.wrapStep(value, {
       before: EngineSignal.beforeOperator,
       after: EngineSignal.afterOperator
-    }, function * (this: State): Generator {
-      const operator = value.data as OperatorFunction
-      yield * operator(this)
-    })
+    }, function * (this: State): Generator {})
   }
 
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

  Array [
    Object {
-     "data": 3,

[Killed] BlockStatement
state/State.ts:140:62
     })
   }
 
-  public * evalBlockOrProc (value: InternalValue): Generator {
-    yield * this.wrapStep(value, {
-      before: EngineSignal.beforeProc,
-      after: EngineSignal.afterProc
-    }, function * (this: State): Generator {
-      const proc = value.data as IArray
-      const { length } = proc
-      for (let index = 0; index < length; ++index) {
-        yield * this.wrapStep({
-          type: ValueType.integer,
-          data: index
-        }, {
-          before: EngineSignal.beforeProcItem,
-          after: EngineSignal.afterProcItem
-        }, function * (this: State): Generator {
-          yield * this.eval(proc.at(index))
-        })
-      }
-    })
-  }
+  public * evalBlockOrProc (value: InternalValue): Generator {}
 
   private * evalWithoutProc (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 32

[Killed] BlockStatement
state/State.ts:144:44
     yield * this.wrapStep(value, {
       before: EngineSignal.beforeProc,
       after: EngineSignal.afterProc
-    }, function * (this: State): Generator {
-      const proc = value.data as IArray
-      const { length } = proc
-      for (let index = 0; index < length; ++index) {
-        yield * this.wrapStep({
-          type: ValueType.integer,
-          data: index
-        }, {
-          before: EngineSignal.beforeProcItem,
-          after: EngineSignal.afterProcItem
-        }, function * (this: State): Generator {
-          yield * this.eval(proc.at(index))
-        })
-      }
-    })
+    }, function * (this: State): Generator {})
   }
 
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 34

[Killed] UpdateOperator
state/State.ts:147:43
     }, function * (this: State): Generator {
       const proc = value.data as IArray
       const { length } = proc
-      for (let index = 0; index < length; ++index) {
+      for (let index = 0; index < length; --index) {
         yield * this.wrapStep({
           type: ValueType.integer,
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: { 2 3 add }
test
"\"test\" { 2 3 add } def »test«"

[Killed] ConditionalExpression
state/State.ts:147:27
     }, function * (this: State): Generator {
       const proc = value.data as IArray
       const { length } = proc
-      for (let index = 0; index < length; ++index) {
+      for (let index = 0; false; ++index) {
         yield * this.wrapStep({
           type: ValueType.integer,
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 34

[Killed] BlockStatement
state/State.ts:154:48
         }, {
           before: EngineSignal.beforeProcItem,
           after: EngineSignal.afterProcItem
-        }, function * (this: State): Generator {
-          yield * this.eval(proc.at(index))
-        })
+        }, function * (this: State): Generator {})
       }
     })
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 40

[Killed] BlockStatement
state/State.ts:161:63
     })
   }
 
-  private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {
-      yield * this.evalCall(value)
-    } else if (value.type === ValueType.operator) {
-      yield * this.evalOperator(value)
-    } else {
-      yield EngineSignal.beforeOperand
-      this.operands.push(value)
-      yield EngineSignal.afterOperand
-    }
-  }
+  private * evalWithoutProc (value: InternalValue): Generator {}
 
   private * eval (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 3

[Killed] ConditionalExpression
state/State.ts:162:43
   }
 
   private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {
+    if (value.type === ValueType.call && (false || ['{', '}'].includes(value.data))) {
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 11

[Killed] ConditionalExpression
state/State.ts:162:9
   }
 
   private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {
+    if (false) {
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 11

[Killed] ConditionalExpression
state/State.ts:164:16
   private * evalWithoutProc (value: InternalValue): Generator {
     if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {
       yield * this.evalCall(value)
-    } else if (value.type === ValueType.operator) {
+    } else if (false) {
       yield * this.evalOperator(value)
     } else {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 9

  Array [
    Object {
-     "data": 3,

[Killed] BlockStatement
state/State.ts:164:51
   private * evalWithoutProc (value: InternalValue): Generator {
     if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {
       yield * this.evalCall(value)
-    } else if (value.type === ValueType.operator) {
-      yield * this.evalOperator(value)
-    } else {
+    } else if (value.type === ValueType.operator) {} else {
       yield EngineSignal.beforeOperand
       this.operands.push(value)
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 11

[Killed] BlockStatement
state/State.ts:166:12
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
       yield * this.evalOperator(value)
-    } else {
-      yield EngineSignal.beforeOperand
-      this.operands.push(value)
-      yield EngineSignal.afterOperand
-    }
+    } else {}
   }
 
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 3

[Killed] BlockStatement
state/State.ts:173:52
     }
   }
 
-  private * eval (value: InternalValue): Generator {
-    if (value.type === ValueType.proc) {
-      yield * this.evalBlockOrProc(value)
-    } else {
-      yield * this.evalWithoutProc(value)
-    }
-  }
+  private * eval (value: InternalValue): Generator {}
 
   private * outerParse (source: string, sourceFile?: string): Generator {
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 3

[Killed] ConditionalExpression
state/State.ts:174:9
   }
 
   private * eval (value: InternalValue): Generator {
-    if (value.type === ValueType.proc) {
+    if (false) {
       yield * this.evalBlockOrProc(value)
     } else {
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 34

[Killed] ConditionalExpression
state/State.ts:174:9
   }
 
   private * eval (value: InternalValue): Generator {
-    if (value.type === ValueType.proc) {
+    if (true) {
       yield * this.evalBlockOrProc(value)
     } else {
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   Object {
-     "data": 1,

[Killed] BlockStatement
state/State.ts:176:12
   private * eval (value: InternalValue): Generator {
     if (value.type === ValueType.proc) {
       yield * this.evalBlockOrProc(value)
-    } else {
-      yield * this.evalWithoutProc(value)
-    }
+    } else {}
   }
 
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 3

[Killed] BlockStatement
state/State.ts:181:73
     }
   }
 
-  private * outerParse (source: string, sourceFile?: string): Generator {
-    try {
-      yield * this.innerParse(source, sourceFile)
-    } catch (e) {
-      this.wrapError(e as Error)
-    } finally {
-      this._parsing = false
-    }
-  }
+  private * outerParse (source: string, sourceFile?: string): Generator {}
 
   public * innerParse (source: string, sourceFile?: string): Generator {
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
state/State.ts:182:9
   }
 
   private * outerParse (source: string, sourceFile?: string): Generator {
-    try {
-      yield * this.innerParse(source, sourceFile)
-    } catch (e) {
+    try {} catch (e) {
       this.wrapError(e as Error)
     } finally {
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] BlockStatement
state/State.ts:184:17
   private * outerParse (source: string, sourceFile?: string): Generator {
     try {
       yield * this.innerParse(source, sourceFile)
-    } catch (e) {
-      this.wrapError(e as Error)
-    } finally {
+    } catch (e) {} finally {
       this._parsing = false
     }
killedBy: state/State exception handling does not expose internal error type
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
state/State.ts:186:15
       yield * this.innerParse(source, sourceFile)
     } catch (e) {
       this.wrapError(e as Error)
-    } finally {
-      this._parsing = false
-    }
+    } finally {}
   }
 
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BooleanLiteral
state/State.ts:187:23
     } catch (e) {
       this.wrapError(e as Error)
     } finally {
-      this._parsing = false
+      this._parsing = true
     }
   }
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BooleanLiteral
state/State.ts:195:18
     yield * this.wrapStep({
       type: ValueType.string,
       data: source,
-      untracked: true, // because external
+      untracked: false, // because external
       sourceFile,
       sourcePos: 0
killedBy: state/State memory monitoring does not include parsed source size
statusReason: at MemoryTracker.increment (C:\Users\I850991\git\arnaud\progbots\engine\.stryker-tmp\sandbox4481113\state\MemoryTracker.ts:228:17)

[Killed] BlockStatement
state/State.ts:201:44
     }, {
       before: EngineSignal.beforeParse,
       after: EngineSignal.afterParse
-    }, function * (this: State): Generator {
-      const parser = parse(source, sourceFile)
-      for (const parsedValue of parser) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: parsedValue.sourcePos as number
-        })
-        try {
-          yield EngineSignal.tokenParsed
-          const value: InternalValue = { ...parsedValue }
-          if (!this._keepDebugInfo) {
-            delete value.source
-            delete value.sourcePos
-            delete value.sourceFile
-          }
-          yield * this.eval(value)
-        } finally {
-          this._calls.pop()
-        }
-      }
-    })
+    }, function * (this: State): Generator {})
   }
 }
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 2

[Killed] BlockStatement
state/State.ts:203:41
       after: EngineSignal.afterParse
     }, function * (this: State): Generator {
       const parser = parse(source, sourceFile)
-      for (const parsedValue of parser) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: parsedValue.sourcePos as number
-        })
-        try {
-          yield EngineSignal.tokenParsed
-          const value: InternalValue = { ...parsedValue }
-          if (!this._keepDebugInfo) {
-            delete value.source
-            delete value.sourcePos
-            delete value.sourceFile
-          }
-          yield * this.eval(value)
-        } finally {
-          this._calls.pop()
-        }
-      }
+      for (const parsedValue of parser) {}
     })
   }
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 2

[Killed] BlockStatement
state/State.ts:208:13
           type: ValueType.integer,
           data: parsedValue.sourcePos as number
         })
-        try {
-          yield EngineSignal.tokenParsed
-          const value: InternalValue = { ...parsedValue }
-          if (!this._keepDebugInfo) {
-            delete value.source
-            delete value.sourcePos
-            delete value.sourceFile
-          }
-          yield * this.eval(value)
-        } finally {
+        try {} finally {
           this._calls.pop()
         }
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 2

[Killed] BlockStatement
state/State.ts:211:37
         try {
           yield EngineSignal.tokenParsed
           const value: InternalValue = { ...parsedValue }
-          if (!this._keepDebugInfo) {
-            delete value.source
-            delete value.sourcePos
-            delete value.sourceFile
-          }
+          if (!this._keepDebugInfo) {}
           yield * this.eval(value)
         } finally {
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    Object {
      "data": 1,

[Killed] ConditionalExpression
state/State.ts:211:15
         try {
           yield EngineSignal.tokenParsed
           const value: InternalValue = { ...parsedValue }
-          if (!this._keepDebugInfo) {
+          if (true) {
             delete value.source
             delete value.sourcePos
killedBy: state/State execution (and cycles) management step by step debugging operand push goes to step: parsed 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "engine-signal:token-parsed"
Received: undefined

[Killed] BlockStatement
state/State.ts:217:19
             delete value.sourceFile
           }
           yield * this.eval(value)
-        } finally {
-          this._calls.pop()
-        }
+        } finally {}
       }
     })
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1
