[Killed] ConditionalExpression
state/MemoryTracker.ts:35:9
   private _addStringRef (value: Value): number {
     const text = value.data as string
     const size = stringSizer(text)
-    if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
+    if (false) {
       const pos = this._strings.indexOf(text)
       if (pos === -1) {
killedBy: state/MemoryTracker string management reference counts big strings stores string in a buffer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 42
Received: 38

[Killed] ConditionalExpression
state/MemoryTracker.ts:37:11
     const size = stringSizer(text)
     if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
       const pos = this._strings.indexOf(text)
-      if (pos === -1) {
+      if (true) {
         this._strings.push(text)
         this._stringsRefCount.push(1)
killedBy: state/MemoryTracker string management reference counts big strings does not duplicate string if already reference counted
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 47
Received: 84

[Killed] ConditionalExpression
state/MemoryTracker.ts:51:9
   private _releaseString (value: Value): number {
     const text = value.data as string
     const size = stringSizer(text)
-    if (text.length >= MemoryTracker.CACHABLE_STRING_LENGTH) {
+    if (true) {
       const pos = this._strings.indexOf(text)
       const refCount = --this._stringsRefCount[pos]
killedBy: state/MemoryTracker string management small strings frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 6

[Killed] ConditionalExpression
state/MemoryTracker.ts:80:9
 
   addValueRef (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
-    if (value.untracked !== true) {
+    if (true) {
       if (isString(value)) {
         valueSize += this._addStringRef(value)
killedBy: state/MemoryTracker string management untracked does not track memory allocated to the string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 42

[Killed] ConditionalExpression
state/MemoryTracker.ts:81:11
   addValueRef (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
     if (value.untracked !== true) {
-      if (isString(value)) {
+      if (true) {
         valueSize += this._addStringRef(value)
       } else {
killedBy: state/MemoryTracker integer data type frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 2

[Killed] BlockStatement
state/MemoryTracker.ts:92:35
 
   releaseValue (value: InternalValue): void {
     let valueSize: number = MemoryTracker.VALUE_SIZE
-    if (value.untracked !== true) {
-      if (isString(value)) {
-        valueSize += this._releaseString(value)
-      } else {
-        ShareableObject.release(value)
-      }
-    }
+    if (value.untracked !== true) {}
     this.decrement(valueSize)
   }
killedBy: state/MemoryTracker string management small strings frees bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 6

[Killed] BlockStatement
state/MemoryTracker.ts:102:35
     this.decrement(valueSize)
   }
 
-  increment (bytes: number): void {
-    this._used += bytes
-    if (this._used > this._total) {
-      throw new VMError()
-    }
-    this._peak = Math.max(this._used, this._peak)
-  }
+  increment (bytes: number): void {}
 
   decrement (bytes: number): void {
killedBy: state/MemoryTracker integer data type counts bytes for the value
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not 0

[Killed] EqualityOperator
state/MemoryTracker.ts:104:9
 
   increment (bytes: number): void {
     this._used += bytes
-    if (this._used > this._total) {
+    if (this._used <= this._total) {
       throw new VMError()
     }
killedBy: state/MemoryTracker integer data type counts bytes for the value
statusReason: VMError: Virtual memory error

[Killed] MethodExpression
state/MemoryTracker.ts:107:18
     if (this._used > this._total) {
       throw new VMError()
     }
-    this._peak = Math.max(this._used, this._peak)
+    this._peak = Math.min(this._used, this._peak)
   }
 
killedBy: state/MemoryTracker integer data type sums up bytes
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 10
Received: 0
