[Killed] UpdateOperator
operators/dictstack/bind.ts:15:55
   const [block] = operands.check(ValueType.block)
   const blocks: ArrayLike[] = [block.data as unknown as ArrayLike]
   for (const procArray of blocks) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
+    for (let index = 0; index < procArray.ref.length; --index) {
       const value = procArray.at(index)
       if (value.type === ValueType.call) {
killedBy: operators/dictstack/bind replaces block calls with their callees
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] ConditionalExpression
operators/dictstack/bind.ts:27:15
             ...resolvedValue
           })
         } catch (e) {
-          if (!(e instanceof Undefined)) {
+          if (false) {
             throw e
           }
killedBy: operators/dictstack/bind should not ignore errors
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
operators/dictstack/bind.ts:31:18
             throw e
           }
         }
-      } else if (value.type === ValueType.block) {
+      } else if (false) {
         blocks.push(value.data as unknown as ArrayLike)
       }
killedBy: operators/dictstack/bind replaces block recursively
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -2,13 +2,13 @@
    Object {
      "data": [Function ifelse],
