[Killed] BlockStatement
operators/number/mul.ts:4:49
 import { State } from '../../state/index'
 import { compute } from './integer'
 
-export function * mul (state: State): Generator {
-  compute(state, (value1: number, value2: number) => value1 * value2)
-}
+export function * mul (state: State): Generator {}
 
killedBy: operators/number/mul multiplies two integers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": 6,

[Killed] ArithmeticOperator
operators/number/mul.ts:5:54
 import { compute } from './integer'
 
 export function * mul (state: State): Generator {
-  compute(state, (value1: number, value2: number) => value1 * value2)
+  compute(state, (value1: number, value2: number) => value1 / value2)
 }
 
killedBy: operators/number/mul multiplies two integers
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": 6,
