[Killed] EqualityOperator
state/State.ts:151:27
     }, function * (this: State): Generator {
       const proc = value.data as IArray
       const { length } = proc
-      for (let index = 0; index < length; ++index) {
+      for (let index = 0; index <= length; ++index) {
         yield * this.wrapStep({
           type: ValueType.integer,
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: { 2 3 add }
test
"\"test\" { 2 3 add } def »test«"

[Killed] EqualityOperator
state/State.ts:166:43
   }
 
   private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {
+    if (value.type === ValueType.call && (this._noCall !== 0 || ['{', '}'].includes(value.data))) {
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 11

[Killed] BlockStatement
state/State.ts:166:99
   }
 
   private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {
-      yield * this.evalCall(value)
-    } else if (value.type === ValueType.operator) {
+    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {} else if (value.type === ValueType.operator) {
       yield * this.evalOperator(value)
     } else {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 9

[Killed] ConditionalExpression
state/State.ts:168:16
   private * evalWithoutProc (value: InternalValue): Generator {
     if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data))) {
       yield * this.evalCall(value)
-    } else if (value.type === ValueType.operator) {
+    } else if (true) {
       yield * this.evalOperator(value)
     } else {
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: TypeError: yield* (intermediate value) is not iterable

[Killed] BlockStatement
state/State.ts:178:40
   }
 
   private * eval (value: InternalValue): Generator {
-    if (value.type === ValueType.proc) {
-      yield * this.evalBlockOrProc(value)
-    } else {
+    if (value.type === ValueType.proc) {} else {
       yield * this.evalWithoutProc(value)
     }
killedBy: state/State execution (and cycles) management general allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 48
Received: 32

[Killed] ConditionalExpression
state/State.ts:215:15
         try {
           yield EngineSignal.tokenParsed
           const value: InternalValue = { ...parsedValue }
-          if (!this._keepDebugInfo) {
+          if (false) {
             delete value.source
             delete value.sourcePos
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    Object {
      "data": 1,
