[Killed] BlockStatement
operators/catch.ts:6:53
 import { ShareableObject } from '../objects/ShareableObject'
 import { InternalError } from '../errors/InternalError'
 
-export function * catchOp (state: State): Generator {
-  const { operands } = state
-  const [procCatch, proc] = operands.check(ValueType.proc, ValueType.proc)
-  ShareableObject.addRef([proc, procCatch])
-  try {
-    operands.splice(2)
-    yield * state.eval(proc)
-  } catch (e) {
-    if (e instanceof InternalError) {
-      operands.push({
-        type: ValueType.dict,
-        data: e.dictionary
-      })
-      e.release()
-      yield * state.eval(procCatch)
-    } else {
-      // Any other error is incompatible with the engine
-      throw e
-    }
-  } finally {
-    ShareableObject.release([proc, procCatch])
-  }
-}
+export function * catchOp (state: State): Generator {}
 
 Object.defineProperty(catchOp, 'name', {
killedBy: operators/catch does not execute the catch block if no exception occurred
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 33

  Array [
    Object {
-     "data": 2,

[Killed] BlockStatement
operators/catch.ts:10:7
   const { operands } = state
   const [procCatch, proc] = operands.check(ValueType.proc, ValueType.proc)
   ShareableObject.addRef([proc, procCatch])
-  try {
-    operands.splice(2)
-    yield * state.eval(proc)
-  } catch (e) {
+  try {} catch (e) {
     if (e instanceof InternalError) {
       operands.push({
killedBy: operators/catch does not execute the catch block if no exception occurred
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 33

  Array [
    Object {
-     "data": 2,

[Killed] BlockStatement
operators/catch.ts:13:15
   try {
     operands.splice(2)
     yield * state.eval(proc)
-  } catch (e) {
-    if (e instanceof InternalError) {
-      operands.push({
-        type: ValueType.dict,
-        data: e.dictionary
-      })
-      e.release()
-      yield * state.eval(procCatch)
-    } else {
-      // Any other error is incompatible with the engine
-      throw e
-    }
-  } finally {
+  } catch (e) {} finally {
     ShareableObject.release([proc, procCatch])
   }
killedBy: operators/catch executes the catch block when an exception occurs
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Killed] BlockStatement
operators/catch.ts:14:37
     operands.splice(2)
     yield * state.eval(proc)
   } catch (e) {
-    if (e instanceof InternalError) {
-      operands.push({
-        type: ValueType.dict,
-        data: e.dictionary
-      })
-      e.release()
-      yield * state.eval(procCatch)
-    } else {
+    if (e instanceof InternalError) {} else {
       // Any other error is incompatible with the engine
       throw e
killedBy: operators/catch executes the catch block when an exception occurs
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Killed] BlockStatement
operators/catch.ts:21:12
       })
       e.release()
       yield * state.eval(procCatch)
-    } else {
-      // Any other error is incompatible with the engine
-      throw e
-    }
+    } else {}
   } finally {
     ShareableObject.release([proc, procCatch])
killedBy: operators/catch does not catch non managed exceptions
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
operators/catch.ts:25:13
       // Any other error is incompatible with the engine
       throw e
     }
-  } finally {
-    ShareableObject.release([proc, procCatch])
-  }
+  } finally {}
 }
 
killedBy: operators/catch does not execute the catch block if no exception occurred
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 69
