[Killed] BlockStatement
operators/close-proc.ts:5:55
 import { ValueType } from '../index'
 import { closeToMark } from './open-close-helper'
 
-export function * closeProc (state: State): Generator {
-  closeToMark(state, ValueType.proc)
-  state.allowCall()
-}
+export function * closeProc (state: State): Generator {}
 
 Object.defineProperty(closeProc, 'name', {
killedBy: operators/close-proc (}) creates a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
    Object {
-     "data": "add",
