[Killed] BlockStatement
operators/finally.ts:5:55
 import { ValueType } from '../index'
 import { ShareableObject } from '../objects/ShareableObject'
 
-export function * finallyOp (state: State): Generator {
-  const { operands } = state
-  const [procFinally, proc] = operands.check(ValueType.proc, ValueType.proc)
-  ShareableObject.addRef([proc, procFinally])
-  let released = false
-  const release = (): void => {
-    if (!released) {
-      ShareableObject.release([proc, procFinally])
-      released = true
-    }
-  }
-  try {
-    operands.splice(2)
-    yield * state.eval(proc)
-  } finally {
-    try {
-      yield * state.eval(procFinally)
-    } finally {
-      release()
-    }
-    release()
-  }
-}
+export function * finallyOp (state: State): Generator {}
 
 Object.defineProperty(finallyOp, 'name', {
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    2

[Killed] ArrayDeclaration
operators/finally.ts:8:26
 export function * finallyOp (state: State): Generator {
   const { operands } = state
   const [procFinally, proc] = operands.check(ValueType.proc, ValueType.proc)
-  ShareableObject.addRef([proc, procFinally])
+  ShareableObject.addRef([])
   let released = false
   const release = (): void => {
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toBeUndefined()

Received: [Internal: Superfluous release]

[Killed] BooleanLiteral
operators/finally.ts:9:18
   const { operands } = state
   const [procFinally, proc] = operands.check(ValueType.proc, ValueType.proc)
   ShareableObject.addRef([proc, procFinally])
-  let released = false
+  let released = true
   const release = (): void => {
     if (!released) {
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 69

[Killed] BlockStatement
operators/finally.ts:10:31
   const [procFinally, proc] = operands.check(ValueType.proc, ValueType.proc)
   ShareableObject.addRef([proc, procFinally])
   let released = false
-  const release = (): void => {
-    if (!released) {
-      ShareableObject.release([proc, procFinally])
-      released = true
-    }
-  }
+  const release = (): void => {}
   try {
     operands.splice(2)
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 69

[Killed] ConditionalExpression
operators/finally.ts:11:9
   ShareableObject.addRef([proc, procFinally])
   let released = false
   const release = (): void => {
-    if (!released) {
+    if (false) {
       ShareableObject.release([proc, procFinally])
       released = true
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 69

[Killed] BooleanLiteral
operators/finally.ts:13:18
   const release = (): void => {
     if (!released) {
       ShareableObject.release([proc, procFinally])
-      released = true
+      released = false
     }
   }
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toBeUndefined()

Received: [Internal: Superfluous release]

[Killed] BlockStatement
operators/finally.ts:16:7
       released = true
     }
   }
-  try {
-    operands.splice(2)
-    yield * state.eval(proc)
-  } finally {
+  try {} finally {
     try {
       yield * state.eval(procFinally)
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 33

@@ -2,13 +2,45 @@
    Object {
      "data": 3,

[Killed] BlockStatement
operators/finally.ts:19:13
   try {
     operands.splice(2)
     yield * state.eval(proc)
-  } finally {
-    try {
-      yield * state.eval(procFinally)
-    } finally {
-      release()
-    }
-    release()
-  }
+  } finally {}
 }
 
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    2

[Killed] BlockStatement
operators/finally.ts:20:9
     operands.splice(2)
     yield * state.eval(proc)
   } finally {
-    try {
-      yield * state.eval(procFinally)
-    } finally {
+    try {} finally {
       release()
     }
killedBy: operators/finally always execute the finally proc
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    2

[Killed] BlockStatement
operators/finally.ts:22:15
   } finally {
     try {
       yield * state.eval(procFinally)
-    } finally {
-      release()
-    }
+    } finally {}
     release()
   }
killedBy: operators/finally throws the last error
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 121
