[Killed] ConditionalExpression
operators/get.ts:7:7
 import { ArrayLike } from '../objects/Array'
 
 function arrayLikeGetter (container: InternalValue, index: InternalValue): InternalValue {
-  if (index.type !== ValueType.integer) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/get fails with TypeCheck if container is an array but index is not an integer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "RangeCheck"

[Killed] ConditionalExpression
operators/get.ts:7:7
 import { ArrayLike } from '../objects/Array'
 
 function arrayLikeGetter (container: InternalValue, index: InternalValue): InternalValue {
-  if (index.type !== ValueType.integer) {
+  if (true) {
     throw new TypeCheck()
   }
killedBy: operators/get gets item of an array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] ConditionalExpression
operators/get.ts:17:9
 
 const getters: Record<string, (container: InternalValue, index: InternalValue) => InternalValue> = {
   [ValueType.string]: (container: InternalValue, index: InternalValue): InternalValue => {
-    if (index.type !== ValueType.integer) {
+    if (false) {
       throw new TypeCheck()
     }
killedBy: operators/get fails with TypeCheck if container is a string but index is not an integer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "RangeCheck"

[Killed] BlockStatement
operators/get.ts:17:43
 
 const getters: Record<string, (container: InternalValue, index: InternalValue) => InternalValue> = {
   [ValueType.string]: (container: InternalValue, index: InternalValue): InternalValue => {
-    if (index.type !== ValueType.integer) {
-      throw new TypeCheck()
-    }
+    if (index.type !== ValueType.integer) {}
     const pos = index.data as number
     const string = container.data as string
killedBy: operators/get fails with TypeCheck if container is a string but index is not an integer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "RangeCheck"

[Killed] EqualityOperator
operators/get.ts:22:20
     }
     const pos = index.data as number
     const string = container.data as string
-    if (pos < 0 || pos >= string.length) {
+    if (pos < 0 || pos < string.length) {
       throw new RangeCheck()
     }
killedBy: operators/get gets character code of a string
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] EqualityOperator
operators/get.ts:34:9
   [ValueType.array]: arrayLikeGetter,
 
   [ValueType.dict]: (container: InternalValue, index: InternalValue): InternalValue => {
-    if (index.type !== ValueType.string) {
+    if (index.type === ValueType.string) {
       throw new TypeCheck()
     }
killedBy: operators/get gets item of a dictionary
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] ConditionalExpression
operators/get.ts:34:9
   [ValueType.array]: arrayLikeGetter,
 
   [ValueType.dict]: (container: InternalValue, index: InternalValue): InternalValue => {
-    if (index.type !== ValueType.string) {
+    if (false) {
       throw new TypeCheck()
     }
killedBy: operators/get fails with TypeCheck if container is a dictionary but index is not a name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "Undefined"

[Killed] ConditionalExpression
operators/get.ts:52:7
 export function * get ({ operands }: State): Generator {
   const [index, container] = operands.check(null, null)
   const getter = getters[container.type]
-  if (getter === undefined) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/get fails with TypeCheck if container is not an array, a string, a dict or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"
