[Killed] BlockStatement
operators/if.ts:5:50
 import { ValueType } from '../index'
 import { ShareableObject } from '../objects/ShareableObject'
 
-export function * ifOp (state: State): Generator {
-  const { operands } = state
-  const [proc, condition] = operands.check(ValueType.proc, ValueType.boolean)
-  ShareableObject.addRef(proc)
-  try {
-    operands.splice(2)
-    if (condition.data as boolean) {
-      yield * state.eval(proc)
-    }
-  } finally {
-    ShareableObject.release(proc)
-  }
-}
+export function * ifOp (state: State): Generator {}
 
 Object.defineProperty(ifOp, 'name', {
killedBy: operators/if evaluates proc if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  2
+ Received  + 16

  Array [
    Object {
+     "data": ArrayLike {

[Killed] BlockStatement
operators/if.ts:9:7
   const { operands } = state
   const [proc, condition] = operands.check(ValueType.proc, ValueType.boolean)
   ShareableObject.addRef(proc)
-  try {
-    operands.splice(2)
-    if (condition.data as boolean) {
-      yield * state.eval(proc)
-    }
-  } finally {
+  try {} finally {
     ShareableObject.release(proc)
   }
killedBy: operators/if evaluates proc if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  2
+ Received  + 16

  Array [
    Object {
+     "data": ArrayLike {

[Killed] BlockStatement
operators/if.ts:11:36
   ShareableObject.addRef(proc)
   try {
     operands.splice(2)
-    if (condition.data as boolean) {
-      yield * state.eval(proc)
-    }
+    if (condition.data as boolean) {}
   } finally {
     ShareableObject.release(proc)
killedBy: operators/if evaluates proc if true
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Killed] BlockStatement
operators/if.ts:14:13
     if (condition.data as boolean) {
       yield * state.eval(proc)
     }
-  } finally {
-    ShareableObject.release(proc)
-  }
+  } finally {}
 }
 
killedBy: operators/if evaluates proc if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 47
