[Killed] EqualityOperator
operators/in.ts:8:74
 
 function arrayLikeImpl (container: InternalValue, value: InternalValue): boolean {
   const array = container.data as ArrayLike
-  return array.some((item: InternalValue) => item.type === value.type && item.data === value.data)
+  return array.some((item: InternalValue) => item.type === value.type && item.data !== value.data)
 }
 
killedBy: operators/get checks item of an array (2)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,

[Killed] ConditionalExpression
operators/in.ts:8:74
 
 function arrayLikeImpl (container: InternalValue, value: InternalValue): boolean {
   const array = container.data as ArrayLike
-  return array.some((item: InternalValue) => item.type === value.type && item.data === value.data)
+  return array.some((item: InternalValue) => item.type === value.type && true)
 }
 
killedBy: operators/get checks item of an array (2)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,

[Killed] EqualityOperator
operators/in.ts:15:9
   [ValueType.array]: arrayLikeImpl,
 
   [ValueType.dict]: (container: InternalValue, index: InternalValue): boolean => {
-    if (index.type !== ValueType.string) {
+    if (index.type === ValueType.string) {
       throw new TypeCheck()
     }
killedBy: operators/get checks name of a dictionary
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] BlockStatement
operators/in.ts:15:42
   [ValueType.array]: arrayLikeImpl,
 
   [ValueType.dict]: (container: InternalValue, index: InternalValue): boolean => {
-    if (index.type !== ValueType.string) {
-      throw new TypeCheck()
-    }
+    if (index.type !== ValueType.string) {}
     const name = index.data as string
     const iDict = container.data as IDictionary
killedBy: operators/get fails with TypeCheck if container is a dict but name is not a string
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined
