[Killed] ConditionalExpression
operators/length.ts:30:7
 export function * length ({ operands }: State): Generator {
   const [container] = operands.check(null)
   const sizer = sizers[container.type]
-  if (sizer === undefined) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/length fails with TypeCheck if container is not an array, a string, a dict or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"
