[Killed] BlockStatement
operators/loop.ts:6:50
 import { ShareableObject } from '../objects/ShareableObject'
 import { State } from '../state/index'
 
-export function * loop (state: State): Generator {
-  const { operands } = state
-  const [proc] = operands.check(ValueType.proc)
-  ShareableObject.addRef(proc)
-  try {
-    operands.pop()
-    // Stryker disable next-line all: will obviously lead to a timeout
-    while (true) {
-      yield * state.eval(proc)
-    }
-  } catch (e) {
-    if (!(e instanceof Break)) {
-      throw e
-    }
-  } finally {
-    ShareableObject.release(proc)
-  }
-}
+export function * loop (state: State): Generator {}
 
killedBy: operators/loop loops until break is called
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 5
Received:    1

[Killed] BlockStatement
operators/loop.ts:10:7
   const { operands } = state
   const [proc] = operands.check(ValueType.proc)
   ShareableObject.addRef(proc)
-  try {
-    operands.pop()
-    // Stryker disable next-line all: will obviously lead to a timeout
-    while (true) {
-      yield * state.eval(proc)
-    }
-  } catch (e) {
+  try {} catch (e) {
     if (!(e instanceof Break)) {
       throw e
killedBy: operators/loop loops until break is called
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 5
Received:    1

[Killed] ConditionalExpression
operators/loop.ts:17:9
       yield * state.eval(proc)
     }
   } catch (e) {
-    if (!(e instanceof Break)) {
+    if (false) {
       throw e
     }
killedBy: operators/loop loops until an error occurs
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined
