[Killed] BlockStatement
operators/open-proc.ts:4:54
 import { State } from '../state/index'
 import { openWithMark } from './open-close-helper'
 
-export function * openProc (state: State): Generator {
-  openWithMark(state)
-  state.preventCall()
-}
+export function * openProc (state: State): Generator {}
 
 Object.defineProperty(openProc, 'name', {
killedBy: operators/open-proc ({) adds a mark
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0
