[Killed] EqualityOperator
operators/roll.ts:7:7
 
 export function * roll ({ operands }: State): Generator {
   const [steps, size] = operands.check(ValueType.integer, ValueType.integer).map(value => value.data as number)
-  if (size <= 0) {
+  if (size > 0) {
     throw new RangeCheck()
   }
killedBy: operators/roll rolls 1 down
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] BlockStatement
operators/roll.ts:7:18
 
 export function * roll ({ operands }: State): Generator {
   const [steps, size] = operands.check(ValueType.integer, ValueType.integer).map(value => value.data as number)
-  if (size <= 0) {
-    throw new RangeCheck()
-  }
+  if (size <= 0) {}
   const values = operands.ref.slice(2, 2 + size).reverse()
   const rolledValues = [...values, ...values]
killedBy: operators/roll fails with RangeCheck on invalid size
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined
