[Killed] EqualityOperator
operators/set.ts:9:45
 
 const setters: Record<string, (container: InternalValue, index: InternalValue, value: InternalValue) => InternalValue> = {
   [ValueType.string]: (container: InternalValue, index: InternalValue, value: InternalValue): InternalValue => {
-    if (index.type !== ValueType.integer || value.type !== ValueType.integer) {
+    if (index.type !== ValueType.integer || value.type === ValueType.integer) {
       throw new TypeCheck()
     }
killedBy: operators/set sets character code of a string
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] ConditionalExpression
operators/set.ts:9:9
 
 const setters: Record<string, (container: InternalValue, index: InternalValue, value: InternalValue) => InternalValue> = {
   [ValueType.string]: (container: InternalValue, index: InternalValue, value: InternalValue): InternalValue => {
-    if (index.type !== ValueType.integer || value.type !== ValueType.integer) {
+    if (false) {
       throw new TypeCheck()
     }
killedBy: operators/set fails with TypeCheck if container is a string and index is not an integer
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] LogicalOperator
operators/set.ts:14:9
     }
     const pos = index.data as number
     const string = container.data as string
-    if (pos < 0 || pos >= string.length) {
+    if (pos < 0 && pos >= string.length) {
       throw new RangeCheck()
     }
killedBy: operators/set fails with RangeCheck if container is a string and index is out of range
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
operators/set.ts:14:9
     }
     const pos = index.data as number
     const string = container.data as string
-    if (pos < 0 || pos >= string.length) {
+    if (true) {
       throw new RangeCheck()
     }
killedBy: operators/set sets character code of a string
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] MethodExpression
operators/set.ts:22:9
       data: [
         string.substring(0, pos),
         String.fromCharCode(value.data as number),
-        string.substring(pos + 1)
+        string
       ].join('')
     }
killedBy: operators/set sets character code of a string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": "Abc",

[Killed] ArithmeticOperator
operators/set.ts:22:26
       data: [
         string.substring(0, pos),
         String.fromCharCode(value.data as number),
-        string.substring(pos + 1)
+        string.substring(pos - 1)
       ].join('')
     }
killedBy: operators/set sets character code of a string
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": "Abc",

[Killed] BlockStatement
operators/set.ts:28:43
   },
 
   [ValueType.array]: (container: InternalValue, index: InternalValue, value: InternalValue): InternalValue => {
-    if (index.type !== ValueType.integer) {
-      throw new TypeCheck()
-    }
+    if (index.type !== ValueType.integer) {}
     const pos = index.data as number
     const array = container.data as ArrayLike
killedBy: operators/set fails with TypeCheck if container is an array but index is not an integer
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
operators/set.ts:28:9
   },
 
   [ValueType.array]: (container: InternalValue, index: InternalValue, value: InternalValue): InternalValue => {
-    if (index.type !== ValueType.integer) {
+    if (true) {
       throw new TypeCheck()
     }
killedBy: operators/set sets item in an array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] ConditionalExpression
operators/set.ts:33:9
     }
     const pos = index.data as number
     const array = container.data as ArrayLike
-    if (pos >= array.length) {
+    if (false) {
       throw new RangeCheck()
     }
killedBy: operators/set fails with RangeCheck if container is an array and index is out of range
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
operators/set.ts:41:9
   },
 
   [ValueType.dict]: (container: InternalValue, index: InternalValue, value: InternalValue): InternalValue => {
-    if (index.type !== ValueType.string) {
+    if (false) {
       throw new TypeCheck()
     }
killedBy: operators/set fails with TypeCheck if container is a dict but index is not a name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "InvalidAccess"

[Killed] EqualityOperator
operators/set.ts:41:9
   },
 
   [ValueType.dict]: (container: InternalValue, index: InternalValue, value: InternalValue): InternalValue => {
-    if (index.type !== ValueType.string) {
+    if (index.type === ValueType.string) {
       throw new TypeCheck()
     }
killedBy: operators/set sets item in a dict
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] ConditionalExpression
operators/set.ts:55:7
 export function * set ({ operands }: State): Generator {
   const [value, index, container] = operands.check(null, null, null)
   const setter = setters[container.type]
-  if (setter === undefined) {
+  if (true) {
     throw new TypeCheck()
   }
killedBy: operators/set sets item in an array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]
