[Killed] StringLiteral
state/callstack.ts:34:24
       }
       const keyword = formatters[value.type](value)
       const after = text.substring(step + keyword.length)
-      return stringify(`${before}${BEFORE_CURRENT}${keyword}${AFTER_CURRENT}${after}`)
+      return stringify(``)
     }
     return stringify(text)
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\""
Received: "\"\""

[Killed] BlockStatement
state/callstack.ts:41:29
   [ValueType.call]: (value: Value): string => formatters[value.type](value),
   [ValueType.operator]: (value: Value, step: number | undefined): string => {
     const base = formatters[value.type](value)
-    if (step !== undefined) {
-      return `${base}:${step}`
-    }
+    if (step !== undefined) {}
     return base
   },
killedBy: callstack shows operator and call progress
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

- -test-:2
+ -test-
  test @test.ps:0

[Killed] StringLiteral
state/callstack.ts:50:21
   [ValueType.array]: unexpected,
   [ValueType.dict]: unexpected,
   [ValueType.proc]: (value: Value, step: number | undefined): string => {
-    const output = ['{']
+    const output = [""]
     const array: IArray = value.data as IArray
     const { length } = array
killedBy: callstack shows proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 2 add }"
Received: " 1 2 add }"

[Killed] EqualityOperator
state/callstack.ts:53:25
     const output = ['{']
     const array: IArray = value.data as IArray
     const { length } = array
-    for (let index = 0; index < length; ++index) {
+    for (let index = 0; index <= length; ++index) {
       const item = array.at(index)
       if (step === index) {
killedBy: callstack shows proc
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
state/callstack.ts:55:11
     const { length } = array
     for (let index = 0; index < length; ++index) {
       const item = array.at(index)
-      if (step === index) {
+      if (step !== index) {
         output.push(BEFORE_CURRENT + formatters[item.type](item) + AFTER_CURRENT)
       } else {
killedBy: callstack shows proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 2 add }"
Received: "{ »1« »2« »add« }"

[Killed] BlockStatement
state/callstack.ts:70:48
   const { length } = calls
   const callstack: string[] = []
   let step: number | undefined
-  for (let index = 0; index < length; ++index) {
-    const value = calls.at(index) as InternalValue
-    if (value.type === ValueType.integer) {
-      step = value.data as number
-      continue
-    }
-    let debugInfo = ''
-    const { sourceFile, sourcePos } = value
-    if (sourceFile !== undefined && sourcePos !== undefined) {
-      debugInfo = ` @${sourceFile}:${sourcePos.toString()}`
-    }
-    const rendered = renderers[value.type](value, step)
-    callstack.push(rendered + debugInfo)
-    step = undefined
-  }
+  for (let index = 0; index < length; ++index) {}
   return callstack.join('\n')
 }
killedBy: callstack shows parser
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 2 add\""
Received: ""

[Killed] EqualityOperator
state/callstack.ts:72:9
   let step: number | undefined
   for (let index = 0; index < length; ++index) {
     const value = calls.at(index) as InternalValue
-    if (value.type === ValueType.integer) {
+    if (value.type !== ValueType.integer) {
       step = value.data as number
       continue
killedBy: callstack shows parser
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 2 add\""
Received: ""

[Killed] BlockStatement
state/callstack.ts:72:43
   let step: number | undefined
   for (let index = 0; index < length; ++index) {
     const value = calls.at(index) as InternalValue
-    if (value.type === ValueType.integer) {
-      step = value.data as number
-      continue
-    }
+    if (value.type === ValueType.integer) {}
     let debugInfo = ''
     const { sourceFile, sourcePos } = value
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

- "1 »2« add"
+ /!\ unexpected stack item type integertype
+ "1 2 add"

[Killed] StringLiteral
state/callstack.ts:79:19
     let debugInfo = ''
     const { sourceFile, sourcePos } = value
     if (sourceFile !== undefined && sourcePos !== undefined) {
-      debugInfo = ` @${sourceFile}:${sourcePos.toString()}`
+      debugInfo = ``
     }
     const rendered = renderers[value.type](value, step)
killedBy: callstack shows parser with current token and debug info
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "\"1 »2« add\" @test.ps:0"
Received: "\"1 »2« add\""
