[Killed] BlockStatement
objects/stacks/Dictionary.ts:47:49
   }
 
   lookup (name: string): InternalValue {
-    for (const dictionaryValue of this._values) {
-      const dictionary = dictionaryValue.data as IDictionary
-      const value = dictionary.lookup(name)
-      if (value !== null) {
-        return value
-      }
-    }
+    for (const dictionaryValue of this._values) {}
     throw new Undefined()
   }
killedBy: objects/stacks/Dictionary lookup searches for a known name (from systemdict)
statusReason: Undefined: Name is not defined in the dictionary stack

[Killed] BlockStatement
objects/stacks/Dictionary.ts:50:27
     for (const dictionaryValue of this._values) {
       const dictionary = dictionaryValue.data as IDictionary
       const value = dictionary.lookup(name)
-      if (value !== null) {
-        return value
-      }
+      if (value !== null) {}
     }
     throw new Undefined()
killedBy: objects/stacks/Dictionary lookup searches for a known name (from systemdict)
statusReason: Undefined: Name is not defined in the dictionary stack
