[Killed] BlockStatement
operators/aload.ts:6:58
 import { TypeCheck } from '../errors/index'
 import { ArrayLike } from '../objects/Array'
 
-export function * aload ({ operands }: State): Generator {
-  const [{ type, data }] = operands.check(null)
-  if (![ValueType.array, ValueType.proc].includes(type)) {
-    throw new TypeCheck()
-  }
-  const array = data as unknown as ArrayLike
-  const { length } = array
-  array.addRef()
-  try {
-    operands.pop()
-    for (let index = 0; index < length; ++index) {
-      const value = array.at(index)
-      operands.push(value)
-    }
-  } finally {
-    array.release()
-  }
-}
+export function * aload ({ operands }: State): Generator {}
 
killedBy: operators/aload pushes all the element of the array
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    1

[Killed] BooleanLiteral
operators/aload.ts:8:7
 
 export function * aload ({ operands }: State): Generator {
   const [{ type, data }] = operands.check(null)
-  if (![ValueType.array, ValueType.proc].includes(type)) {
+  if ([ValueType.array, ValueType.proc].includes(type)) {
     throw new TypeCheck()
   }
killedBy: operators/aload pushes all the element of the array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]

[Killed] ConditionalExpression
operators/aload.ts:8:7
 
 export function * aload ({ operands }: State): Generator {
   const [{ type, data }] = operands.check(null)
-  if (![ValueType.array, ValueType.proc].includes(type)) {
+  if (false) {
     throw new TypeCheck()
   }
killedBy: operators/aload fails with TypeCheck if not an array or a proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "TypeCheck"
Received: "TypeError"

[Killed] EqualityOperator
operators/aload.ts:16:25
   array.addRef()
   try {
     operands.pop()
-    for (let index = 0; index < length; ++index) {
+    for (let index = 0; index <= length; ++index) {
       const value = array.at(index)
       operands.push(value)
killedBy: operators/aload pushes all the element of the array
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] UpdateOperator
operators/aload.ts:16:41
   array.addRef()
   try {
     operands.pop()
-    for (let index = 0; index < length; ++index) {
+    for (let index = 0; index < length; --index) {
       const value = array.at(index)
       operands.push(value)
killedBy: operators/aload pushes all the element of the array
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]
