[Killed] ArrayDeclaration
operators/bind.ts:8:30
 
 export function * bind ({ operands, dictionaries }: State): Generator {
   const [proc] = operands.check(ValueType.proc)
-  const procs: ArrayLike[] = [proc.data as unknown as ArrayLike]
+  const procs: ArrayLike[] = []
   for (const procArray of procs) {
     for (let index = 0; index < procArray.ref.length; ++index) {
killedBy: operators/bind replaces proc calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] BlockStatement
operators/bind.ts:9:34
 export function * bind ({ operands, dictionaries }: State): Generator {
   const [proc] = operands.check(ValueType.proc)
   const procs: ArrayLike[] = [proc.data as unknown as ArrayLike]
-  for (const procArray of procs) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
-      const value = procArray.at(index)
-      if (value.type === ValueType.call) {
-        yield // bind cycle
-        try {
-          const resolvedValue = dictionaries.lookup(value.data as string)
-          // TODO: some operators can be replaced with values (true, false, mark...)
-          procArray.set(index, {
-            ...value, // propagate debug infos
-            ...resolvedValue
-          })
-        } catch (e) {
-          if (!(e instanceof Undefined)) {
-            throw e
-          }
-        }
-      } else if (value.type === ValueType.proc) {
-        procs.push(value.data as unknown as ArrayLike)
-      }
-    }
-  }
+  for (const procArray of procs) {}
 }
 
killedBy: operators/bind replaces proc calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] ConditionalExpression
operators/bind.ts:10:25
   const [proc] = operands.check(ValueType.proc)
   const procs: ArrayLike[] = [proc.data as unknown as ArrayLike]
   for (const procArray of procs) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
+    for (let index = 0; false; ++index) {
       const value = procArray.at(index)
       if (value.type === ValueType.call) {
killedBy: operators/bind replaces proc calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] EqualityOperator
operators/bind.ts:10:25
   const [proc] = operands.check(ValueType.proc)
   const procs: ArrayLike[] = [proc.data as unknown as ArrayLike]
   for (const procArray of procs) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
+    for (let index = 0; index >= procArray.ref.length; ++index) {
       const value = procArray.at(index)
       if (value.type === ValueType.call) {
killedBy: operators/bind replaces proc calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] ConditionalExpression
operators/bind.ts:12:11
   for (const procArray of procs) {
     for (let index = 0; index < procArray.ref.length; ++index) {
       const value = procArray.at(index)
-      if (value.type === ValueType.call) {
+      if (false) {
         yield // bind cycle
         try {
killedBy: operators/bind replaces proc calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] BlockStatement
operators/bind.ts:12:42
   for (const procArray of procs) {
     for (let index = 0; index < procArray.ref.length; ++index) {
       const value = procArray.at(index)
-      if (value.type === ValueType.call) {
-        yield // bind cycle
-        try {
-          const resolvedValue = dictionaries.lookup(value.data as string)
-          // TODO: some operators can be replaced with values (true, false, mark...)
-          procArray.set(index, {
-            ...value, // propagate debug infos
-            ...resolvedValue
-          })
-        } catch (e) {
-          if (!(e instanceof Undefined)) {
-            throw e
-          }
-        }
-      } else if (value.type === ValueType.proc) {
+      if (value.type === ValueType.call) {} else if (value.type === ValueType.proc) {
         procs.push(value.data as unknown as ArrayLike)
       }
killedBy: operators/bind replaces proc calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] BlockStatement
operators/bind.ts:14:13
       const value = procArray.at(index)
       if (value.type === ValueType.call) {
         yield // bind cycle
-        try {
-          const resolvedValue = dictionaries.lookup(value.data as string)
-          // TODO: some operators can be replaced with values (true, false, mark...)
-          procArray.set(index, {
-            ...value, // propagate debug infos
-            ...resolvedValue
-          })
-        } catch (e) {
+        try {} catch (e) {
           if (!(e instanceof Undefined)) {
             throw e
killedBy: operators/bind replaces proc calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] ConditionalExpression
operators/bind.ts:26:18
             throw e
           }
         }
-      } else if (value.type === ValueType.proc) {
+      } else if (false) {
         procs.push(value.data as unknown as ArrayLike)
       }
killedBy: operators/bind replaces proc recursively
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -2,13 +2,13 @@
    Object {
      "data": [Function ifelse],

[Killed] EqualityOperator
operators/bind.ts:26:18
             throw e
           }
         }
-      } else if (value.type === ValueType.proc) {
+      } else if (value.type !== ValueType.proc) {
         procs.push(value.data as unknown as ArrayLike)
       }
killedBy: operators/bind replaces proc calls with their callees
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeError: Cannot read properties of undefined (reading 'length')]
