[Killed] LogicalOperator
operators/eq.ts:8:11
   const [value1, value2] = operands.check(null, null)
   operands.splice(2, {
     type: ValueType.boolean,
-    data: value1.type === value2.type && value1.data === value2.data
+    data: value1.type === value2.type || value1.data === value2.data
   })
 }
killedBy: operators/eq outputs 1 == 2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,

[Killed] ConditionalExpression
operators/eq.ts:8:11
   const [value1, value2] = operands.check(null, null)
   operands.splice(2, {
     type: ValueType.boolean,
-    data: value1.type === value2.type && value1.data === value2.data
+    data: true
   })
 }
killedBy: operators/eq outputs 1 == 2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,
