[Killed] BlockStatement
operators/ifelse.ts:5:52
 import { ValueType } from '../index'
 import { ShareableObject } from '../objects/ShareableObject'
 
-export function * ifelse (state: State): Generator {
-  const { operands } = state
-  const [procElse, procIf, condition] = operands.check(ValueType.proc, ValueType.proc, ValueType.boolean)
-  ShareableObject.addRef([procIf, procElse])
-  try {
-    operands.splice(3)
-    if (condition.data as boolean) {
-      yield * state.eval(procIf)
-    } else {
-      yield * state.eval(procElse)
-    }
-  } finally {
-    ShareableObject.release([procIf, procElse])
-  }
-}
+export function * ifelse (state: State): Generator {}
 
killedBy: operators/ifelse evaluates if proc if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  2
+ Received  + 30

  Array [
    Object {
-     "data": 42,

[Killed] BlockStatement
operators/ifelse.ts:9:7
   const { operands } = state
   const [procElse, procIf, condition] = operands.check(ValueType.proc, ValueType.proc, ValueType.boolean)
   ShareableObject.addRef([procIf, procElse])
-  try {
-    operands.splice(3)
-    if (condition.data as boolean) {
-      yield * state.eval(procIf)
-    } else {
-      yield * state.eval(procElse)
-    }
-  } finally {
+  try {} finally {
     ShareableObject.release([procIf, procElse])
   }
killedBy: operators/ifelse evaluates if proc if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  2
+ Received  + 30

  Array [
    Object {
-     "data": 42,

[Killed] BlockStatement
operators/ifelse.ts:11:36
   ShareableObject.addRef([procIf, procElse])
   try {
     operands.splice(3)
-    if (condition.data as boolean) {
-      yield * state.eval(procIf)
-    } else {
+    if (condition.data as boolean) {} else {
       yield * state.eval(procElse)
     }
killedBy: operators/ifelse evaluates if proc if true
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Killed] BlockStatement
operators/ifelse.ts:13:12
     operands.splice(3)
     if (condition.data as boolean) {
       yield * state.eval(procIf)
-    } else {
-      yield * state.eval(procElse)
-    }
+    } else {}
   } finally {
     ShareableObject.release([procIf, procElse])
killedBy: operators/ifelse evaluates else proc if true
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Killed] BlockStatement
operators/ifelse.ts:16:13
     } else {
       yield * state.eval(procElse)
     }
-  } finally {
-    ShareableObject.release([procIf, procElse])
-  }
+  } finally {}
 }
 
killedBy: operators/ifelse evaluates if proc if true
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 34
Received: 60
