[Killed] EqualityOperator
operators/index-op.ts:7:7
 
 export function * index ({ operands }: State): Generator {
   const [pos] = operands.check(ValueType.integer).map(value => value.data as number)
-  if (pos < 0) {
+  if (pos >= 0) {
     throw new RangeCheck()
   }
killedBy: operators/index picks a value in the stack by position
statusReason: Error: expect(received).toBeUndefined()

Received: [RangeCheck: Operand is too big or too small]

[Killed] BlockStatement
operators/index-op.ts:7:16
 
 export function * index ({ operands }: State): Generator {
   const [pos] = operands.check(ValueType.integer).map(value => value.data as number)
-  if (pos < 0) {
-    throw new RangeCheck()
-  }
+  if (pos < 0) {}
   const valuePos = pos + 1
   if (valuePos >= operands.length) {
killedBy: operators/index fails with RangeError when using negative index
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
operators/index-op.ts:11:36
     throw new RangeCheck()
   }
   const valuePos = pos + 1
-  if (valuePos >= operands.length) {
-    throw new StackUnderflow()
-  }
+  if (valuePos >= operands.length) {}
   operands.splice(1, operands.ref[valuePos])
 }
killedBy: operators/index fails with StackUnderflow when going beyond the stack size
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined
