[Killed] ConditionalExpression
operators/lt.ts:5:54
 import { compare } from './integer'
 
 export function * lt (state: State): Generator {
-  compare(state, (value1: number, value2: number) => value1 < value2)
+  compare(state, (value1: number, value2: number) => true)
 }
 
killedBy: operators/lt outputs 1 < 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "data": false,
