[Killed] BlockStatement
operators/open-close-helper.ts:5:65
 import { ArrayLike } from '../objects/Array'
 import { State } from '../state/index'
 
-export function openWithMark ({ operands, calls }: State): void {
-  const openInstruction = calls.ref[1] // TODO: add a test to validate
-  operands.push({
-    ...openInstruction, // propagate debug infos
-    type: ValueType.mark,
-    data: null
-  })
-}
+export function openWithMark ({ operands, calls }: State): void {}
 
 export function closeToMark (state: State, type: ValueType.array | ValueType.proc): void {
killedBy: operators/close-array (]) creates an array
statusReason: Error: expect(received).toBeUndefined()

Received: [UnmatchedMark: Unmatched mark in the operand stack]

[Killed] BlockStatement
operators/open-close-helper.ts:14:90
   })
 }
 
-export function closeToMark (state: State, type: ValueType.array | ValueType.proc): void {
-  const { operands } = state
-  const markPos = operands.findMarkPos()
-  const mark = operands.ref[markPos]
-  const array = new ArrayLike(state.memoryTracker)
-  try {
-    let index: number
-    for (index = 0; index < markPos; ++index) {
-      array.unshift(operands.ref[index])
-    }
-    operands.splice(markPos + 1, {
-      ...mark, // propagate debug infos
-      type,
-      data: array
-    })
-  } finally {
-    array.release()
-  }
-}
+export function closeToMark (state: State, type: ValueType.array | ValueType.proc): void {}
 
killedBy: operators/close-array (]) creates an array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 5
