[Killed] BlockStatement
state/State.ts:98:79
     throw error
   }
 
-  private * wrapCall (value: InternalValue, call: () => Generator): Generator {
-    this._calls.push(value)
-    yield // execution cycle
-    try {
-      yield * call.apply(this)
-    } catch (e) {
-      if (e instanceof InternalError) {
-        e.callstack = renderCallStack(this.calls)
-      }
-      throw e
-    } finally {
-      this._calls.pop()
-    }
-  }
+  private * wrapCall (value: InternalValue, call: () => Generator): Generator {}
 
   private * evalCall (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 0

[Killed] BlockStatement
state/State.ts:101:9
   private * wrapCall (value: InternalValue, call: () => Generator): Generator {
     this._calls.push(value)
     yield // execution cycle
-    try {
-      yield * call.apply(this)
-    } catch (e) {
+    try {} catch (e) {
       if (e instanceof InternalError) {
         e.callstack = renderCallStack(this.calls)
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 1

[Killed] BlockStatement
state/State.ts:103:17
     yield // execution cycle
     try {
       yield * call.apply(this)
-    } catch (e) {
-      if (e instanceof InternalError) {
-        e.callstack = renderCallStack(this.calls)
-      }
-      throw e
-    } finally {
+    } catch (e) {} finally {
       this._calls.pop()
     }
killedBy: state/State exception handling does not expose internal error type
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
state/State.ts:108:15
         e.callstack = renderCallStack(this.calls)
       }
       throw e
-    } finally {
-      this._calls.pop()
-    }
+    } finally {}
   }
 
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
state/State.ts:113:56
     }
   }
 
-  private * evalCall (value: InternalValue): Generator {
-    yield * this.wrapCall(value, function * (this: State): Generator {
-      yield * this.eval(this._dictionaries.lookup(value.data as string))
-    })
-  }
+  private * evalCall (value: InternalValue): Generator {}
 
   private * evalOperator (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 8
Received: 6

[Killed] BlockStatement
state/State.ts:114:70
   }
 
   private * evalCall (value: InternalValue): Generator {
-    yield * this.wrapCall(value, function * (this: State): Generator {
-      yield * this.eval(this._dictionaries.lookup(value.data as string))
-    })
+    yield * this.wrapCall(value, function * (this: State): Generator {})
   }
 
killedBy: state/State execution (and cycles) management resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 8
Received: 7

[Killed] BlockStatement
state/State.ts:119:60
     })
   }
 
-  private * evalOperator (value: InternalValue): Generator {
-    yield * this.wrapCall(value, function * (this: State): Generator {
-      const operator = value.data as OperatorFunction
-      yield * operator(this)
-    })
-  }
+  private * evalOperator (value: InternalValue): Generator {}
 
   private * evalProc (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 8
Received: 7

[Killed] BlockStatement
state/State.ts:120:70
   }
 
   private * evalOperator (value: InternalValue): Generator {
-    yield * this.wrapCall(value, function * (this: State): Generator {
-      const operator = value.data as OperatorFunction
-      yield * operator(this)
-    })
+    yield * this.wrapCall(value, function * (this: State): Generator {})
   }
 
killedBy: state/State execution (and cycles) management resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

  Array [
    Object {
-     "data": 3,

[Killed] BlockStatement
state/State.ts:126:56
     })
   }
 
-  private * evalProc (value: InternalValue): Generator {
-    yield * this.wrapCall(value, function * (this: State): Generator {
-      const proc = value.data as IArray
-      const { length } = proc
-      for (let index = 0; index < length; ++index) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: index
-        })
-        try {
-          yield * this.evalWithoutProc(proc.at(index))
-        } finally {
-          this._calls.pop()
-        }
-      }
-    })
-  }
+  private * evalProc (value: InternalValue): Generator {}
 
   private * evalWithoutProc (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 25
Received: 20

[Killed] BlockStatement
state/State.ts:127:70
   }
 
   private * evalProc (value: InternalValue): Generator {
-    yield * this.wrapCall(value, function * (this: State): Generator {
-      const proc = value.data as IArray
-      const { length } = proc
-      for (let index = 0; index < length; ++index) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: index
-        })
-        try {
-          yield * this.evalWithoutProc(proc.at(index))
-        } finally {
-          this._calls.pop()
-        }
-      }
-    })
+    yield * this.wrapCall(value, function * (this: State): Generator {})
   }
 
killedBy: state/State execution (and cycles) management allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 25
Received: 21

[Killed] BlockStatement
state/State.ts:130:52
     yield * this.wrapCall(value, function * (this: State): Generator {
       const proc = value.data as IArray
       const { length } = proc
-      for (let index = 0; index < length; ++index) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: index
-        })
-        try {
-          yield * this.evalWithoutProc(proc.at(index))
-        } finally {
-          this._calls.pop()
-        }
-      }
+      for (let index = 0; index < length; ++index) {}
     })
   }
killedBy: state/State execution (and cycles) management allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 25
Received: 21

[Killed] BlockStatement
state/State.ts:135:13
           type: ValueType.integer,
           data: index
         })
-        try {
-          yield * this.evalWithoutProc(proc.at(index))
-        } finally {
+        try {} finally {
           this._calls.pop()
         }
killedBy: state/State execution (and cycles) management allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 25
Received: 21

[Killed] BlockStatement
state/State.ts:137:19
         })
         try {
           yield * this.evalWithoutProc(proc.at(index))
-        } finally {
-          this._calls.pop()
-        }
+        } finally {}
       }
     })
killedBy: state/State execution (and cycles) management allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 0
Received: 3

[Killed] BlockStatement
state/State.ts:144:63
     })
   }
 
-  private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data as string))) {
-      yield * this.evalCall(value)
-    } else if (value.type === ValueType.operator) {
-      yield * this.evalOperator(value)
-    } else {
-      yield // execution cycle
-      this.operands.push(value)
-    }
-  }
+  private * evalWithoutProc (value: InternalValue): Generator {}
 
   * eval (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 2

[Killed] ConditionalExpression
state/State.ts:145:9
   }
 
   private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data as string))) {
+    if (true) {
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: "»1« 2 3"

[Killed] ConditionalExpression
state/State.ts:145:9
   }
 
   private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data as string))) {
+    if (true && (this._noCall === 0 || ['{', '}'].includes(value.data as string))) {
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: "»1« 2 3"

[Killed] BlockStatement
state/State.ts:149:12
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
       yield * this.evalOperator(value)
-    } else {
-      yield // execution cycle
-      this.operands.push(value)
-    }
+    } else {}
   }
 
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 2

[Killed] BlockStatement
state/State.ts:155:44
     }
   }
 
-  * eval (value: InternalValue): Generator {
-    if (value.type === ValueType.proc) { // } && this._noCall === 0) {
-      yield * this.evalProc(value)
-    } else {
-      yield * this.evalWithoutProc(value)
-    }
-  }
+  * eval (value: InternalValue): Generator {}
 
   * outerParse (source: string, sourceFile?: string): Generator {
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 2

[Killed] ConditionalExpression
state/State.ts:156:9
   }
 
   * eval (value: InternalValue): Generator {
-    if (value.type === ValueType.proc) { // } && this._noCall === 0) {
+    if (false) { // } && this._noCall === 0) {
       yield * this.evalProc(value)
     } else {
killedBy: state/State execution (and cycles) management allows proc definition and execution
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 25
Received: 21

[Killed] EqualityOperator
state/State.ts:156:9
   }
 
   * eval (value: InternalValue): Generator {
-    if (value.type === ValueType.proc) { // } && this._noCall === 0) {
+    if (value.type !== ValueType.proc) { // } && this._noCall === 0) {
       yield * this.evalProc(value)
     } else {
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   Object {
-     "data": 1,

[Killed] BlockStatement
state/State.ts:158:12
   * eval (value: InternalValue): Generator {
     if (value.type === ValueType.proc) { // } && this._noCall === 0) {
       yield * this.evalProc(value)
-    } else {
-      yield * this.evalWithoutProc(value)
-    }
+    } else {}
   }
 
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 2

[Killed] BlockStatement
state/State.ts:163:65
     }
   }
 
-  * outerParse (source: string, sourceFile?: string): Generator {
-    try {
-      yield * this.innerParse(source, sourceFile)
-    } catch (e) {
-      this.wrapError(e as Error)
-    } finally {
-      this._parsing = false
-    }
-  }
+  * outerParse (source: string, sourceFile?: string): Generator {}
 
   * innerParse (source: string, sourceFile?: string): Generator {
killedBy: state/State protection against concurrent execution maintains a parsing flag
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
state/State.ts:164:9
   }
 
   * outerParse (source: string, sourceFile?: string): Generator {
-    try {
-      yield * this.innerParse(source, sourceFile)
-    } catch (e) {
+    try {} catch (e) {
       this.wrapError(e as Error)
     } finally {
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 0

[Killed] BlockStatement
state/State.ts:180:44
       untracked: true, // because external
       sourceFile,
       sourcePos: 0
-    }, function * (this: State): Generator {
-      const parser = parse(source, sourceFile)
-      for (const parsedValue of parser) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: parsedValue.sourcePos as number
-        })
-        try {
-          yield // parse cycle
-          let value
-          if (this._keepDebugInfo) {
-            value = parsedValue
-          } else {
-            const { type, data } = parsedValue
-            value = { type, data }
-          }
-          yield * this.eval(value)
-        } finally {
-          this._calls.pop()
-        }
-      }
-    })
+    }, function * (this: State): Generator {})
   }
 }
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 1

[Killed] BlockStatement
state/State.ts:182:41
       sourcePos: 0
     }, function * (this: State): Generator {
       const parser = parse(source, sourceFile)
-      for (const parsedValue of parser) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: parsedValue.sourcePos as number
-        })
-        try {
-          yield // parse cycle
-          let value
-          if (this._keepDebugInfo) {
-            value = parsedValue
-          } else {
-            const { type, data } = parsedValue
-            value = { type, data }
-          }
-          yield * this.eval(value)
-        } finally {
-          this._calls.pop()
-        }
-      }
+      for (const parsedValue of parser) {}
     })
   }
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 1

[Killed] BlockStatement
state/State.ts:187:13
           type: ValueType.integer,
           data: parsedValue.sourcePos as number
         })
-        try {
-          yield // parse cycle
-          let value
-          if (this._keepDebugInfo) {
-            value = parsedValue
-          } else {
-            const { type, data } = parsedValue
-            value = { type, data }
-          }
-          yield * this.eval(value)
-        } finally {
+        try {} finally {
           this._calls.pop()
         }
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 3
Received: 1

[Killed] ConditionalExpression
state/State.ts:190:15
         try {
           yield // parse cycle
           let value
-          if (this._keepDebugInfo) {
+          if (true) {
             value = parsedValue
           } else {
killedBy: state/State execution (and cycles) management stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    Object {
      "data": 1,

[Killed] ConditionalExpression
state/State.ts:190:15
         try {
           yield // parse cycle
           let value
-          if (this._keepDebugInfo) {
+          if (false) {
             value = parsedValue
           } else {
killedBy: state/State debug information when on keeps debug information
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "1"
Received: undefined
