[Killed] ArrayDeclaration
operators/finally.ts:8:26
 export function * finallyOp (state: State): Generator {
   const { operands } = state
   const [blockFinally, block] = operands.check(ValueType.block, ValueType.block)
-  ShareableObject.addRef([block, blockFinally])
+  ShareableObject.addRef([])
   let released = false
   const release = (): void => {
killedBy: operators/finally always execute the finally block
statusReason: Error: expect(received).toBeUndefined()

Received: [Internal: Superfluous release]
