[Killed] ConditionalExpression
state/callstack.ts:54:25
     const output = ['{']
     const array: IArray = value.data as IArray
     const { length } = array
-    for (let index = 0; index < length; ++index) {
+    for (let index = 0; false; ++index) {
       const item = array.at(index)
       if (step === index) {
killedBy: callstack shows proc
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "{ 1 2 add }"
Received: "{ }"

[Killed] ConditionalExpression
state/callstack.ts:73:9
   let step: number | undefined
   for (let index = 0; index < length; ++index) {
     const value = calls.at(index) as InternalValue
-    if (value.type === ValueType.integer) {
+    if (false) {
       step = value.data as number
       continue
killedBy: callstack shows parser with current token
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

- "1 »2« add"
+ /!\ unexpected stack item type integertype
+ "1 2 add"
