[Killed] BooleanLiteral
operators/aload.ts:8:7
 
 export function * aload ({ operands }: State): Generator {
   const [{ type, data }] = operands.check(null)
-  if (![ValueType.array, ValueType.block, ValueType.proc].includes(type)) {
+  if ([ValueType.array, ValueType.block, ValueType.proc].includes(type)) {
     throw new TypeCheck()
   }
killedBy: operators/aload pushes all the element of the array
statusReason: Error: expect(received).toBeUndefined()

Received: [TypeCheck: Operand is of the wrong type]
