[Killed] BlockStatement
operators/bind.ts:9:35
 export function * bind ({ operands, dictionaries }: State): Generator {
   const [block] = operands.check(ValueType.block)
   const blocks: ArrayLike[] = [block.data as unknown as ArrayLike]
-  for (const procArray of blocks) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
-      const value = procArray.at(index)
-      if (value.type === ValueType.call) {
-        yield // bind cycle
-        try {
-          const resolvedValue = dictionaries.lookup(value.data as string)
-          // TODO: some operators can be replaced with values (true, false, mark...)
-          procArray.set(index, {
-            ...value, // propagate debug infos
-            ...resolvedValue
-          })
-        } catch (e) {
-          if (!(e instanceof Undefined)) {
-            throw e
-          }
-        }
-      } else if (value.type === ValueType.block) {
-        blocks.push(value.data as unknown as ArrayLike)
-      }
-    }
-  }
+  for (const procArray of blocks) {}
 }
 
killedBy: operators/bind replaces block calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] ConditionalExpression
operators/bind.ts:10:25
   const [block] = operands.check(ValueType.block)
   const blocks: ArrayLike[] = [block.data as unknown as ArrayLike]
   for (const procArray of blocks) {
-    for (let index = 0; index < procArray.ref.length; ++index) {
+    for (let index = 0; false; ++index) {
       const value = procArray.at(index)
       if (value.type === ValueType.call) {
killedBy: operators/bind replaces block calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] BlockStatement
operators/bind.ts:12:42
   for (const procArray of blocks) {
     for (let index = 0; index < procArray.ref.length; ++index) {
       const value = procArray.at(index)
-      if (value.type === ValueType.call) {
-        yield // bind cycle
-        try {
-          const resolvedValue = dictionaries.lookup(value.data as string)
-          // TODO: some operators can be replaced with values (true, false, mark...)
-          procArray.set(index, {
-            ...value, // propagate debug infos
-            ...resolvedValue
-          })
-        } catch (e) {
-          if (!(e instanceof Undefined)) {
-            throw e
-          }
-        }
-      } else if (value.type === ValueType.block) {
+      if (value.type === ValueType.call) {} else if (value.type === ValueType.block) {
         blocks.push(value.data as unknown as ArrayLike)
       }
killedBy: operators/bind replaces block calls with their callees
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -2,21 +2,21 @@
    Object {
      "data": "unchanged",

[Killed] BlockStatement
operators/bind.ts:26:50
             throw e
           }
         }
-      } else if (value.type === ValueType.block) {
-        blocks.push(value.data as unknown as ArrayLike)
-      }
+      } else if (value.type === ValueType.block) {}
     }
   }
killedBy: operators/bind replaces block recursively
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -2,13 +2,13 @@
    Object {
      "data": [Function ifelse],
