[NoCoverage] BlockStatement
operators/close-blockspec.ts:12:62
   executeTests({
     'creates a block': {
       host: {
-        addCall: function * ({ operands }: State): Generator {
-          operands.push({
-            type: ValueType.call,
-            data: 'add'
-          })
-        }
+        addCall: function * ({ operands }: State): Generator {}
       },
       src: '{ 3 4 add } aload',

[NoCoverage] StringLiteral
operators/close-blockspec.ts:23:12
       expect: '3 4 addCall'
     },
     'handles block inside block': {
-      src: 'true { false { 1 } { 2 } ifelse } if',
+      src: "",
       expect: '2'
     },

[NoCoverage] BooleanLiteral
operators/close-blockspec.ts:32:22
     },
     'keeps debug info from the opening bracket': {
       src: '{ }',
-      keepDebugInfo: true,
+      keepDebugInfo: false,
       expect: ({ operands }: State) => {
         const { type, sourceFile, sourcePos } = operands.ref[0]

[NoCoverage] BlockStatement
operators/close-blockspec.ts:33:40
     'keeps debug info from the opening bracket': {
       src: '{ }',
       keepDebugInfo: true,
-      expect: ({ operands }: State) => {
-        const { type, sourceFile, sourcePos } = operands.ref[0]
-        expect(type).toStrictEqual(ValueType.block)
-        expect(sourceFile).toStrictEqual('test-src.ps')
-        expect(sourcePos).toStrictEqual(0)
-      }
+      expect: ({ operands }: State) => {}
     },
     'fails with UnmatchedMark if the stack does not contain a mark': {
