[Killed] BlockStatement
state/State.ts:161:63
     })
   }
 
-  private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data as string))) {
-      yield * this.evalCall(value)
-    } else if (value.type === ValueType.operator) {
-      yield * this.evalOperator(value)
-    } else {
-      yield EngineSignal.beforeOperand
-      this.operands.push(value)
-      yield EngineSignal.afterOperand
-    }
-  }
+  private * evalWithoutProc (value: InternalValue): Generator {}
 
   private * eval (value: InternalValue): Generator {
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 3

[Killed] ConditionalExpression
state/State.ts:162:43
   }
 
   private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data as string))) {
+    if (value.type === ValueType.call && (false || ['{', '}'].includes(value.data as string))) {
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 11

[Killed] ConditionalExpression
state/State.ts:162:9
   }
 
   private * evalWithoutProc (value: InternalValue): Generator {
-    if (value.type === ValueType.call && (this._noCall === 0 || ['{', '}'].includes(value.data as string))) {
+    if (false) {
       yield * this.evalCall(value)
     } else if (value.type === ValueType.operator) {
killedBy: state/State execution (and cycles) management general resolves and call an operator
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 13
Received: 11

[Killed] BlockStatement
state/State.ts:201:44
     }, {
       before: EngineSignal.beforeParse,
       after: EngineSignal.afterParse
-    }, function * (this: State): Generator {
-      const parser = parse(source, sourceFile)
-      for (const parsedValue of parser) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: parsedValue.sourcePos as number
-        })
-        try {
-          yield EngineSignal.tokenParsed
-          let value
-          if (this._keepDebugInfo) {
-            value = parsedValue
-          } else {
-            const { type, data } = parsedValue
-            value = { type, data }
-          }
-          yield * this.eval(value)
-        } finally {
-          this._calls.pop()
-        }
-      }
-    })
+    }, function * (this: State): Generator {})
   }
 }
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 2

[Killed] BlockStatement
state/State.ts:203:41
       after: EngineSignal.afterParse
     }, function * (this: State): Generator {
       const parser = parse(source, sourceFile)
-      for (const parsedValue of parser) {
-        this._calls.push({
-          type: ValueType.integer,
-          data: parsedValue.sourcePos as number
-        })
-        try {
-          yield EngineSignal.tokenParsed
-          let value
-          if (this._keepDebugInfo) {
-            value = parsedValue
-          } else {
-            const { type, data } = parsedValue
-            value = { type, data }
-          }
-          yield * this.eval(value)
-        } finally {
-          this._calls.pop()
-        }
-      }
+      for (const parsedValue of parser) {}
     })
   }
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 2

[Killed] BlockStatement
state/State.ts:208:13
           type: ValueType.integer,
           data: parsedValue.sourcePos as number
         })
-        try {
-          yield EngineSignal.tokenParsed
-          let value
-          if (this._keepDebugInfo) {
-            value = parsedValue
-          } else {
-            const { type, data } = parsedValue
-            value = { type, data }
-          }
-          yield * this.eval(value)
-        } finally {
+        try {} finally {
           this._calls.pop()
         }
killedBy: state/State execution (and cycles) management general stacks integer value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 5
Received: 2
